{
  "key": "3com-microcode",
  "short_name": "3Com Microcode",
  "name": "3Com Microcode",
  "category": "Permissive",
  "owner": "HP - Hewlett Packard",
  "notes": "this is a Linux firmware BSD-like license with some weird extra terms",
  "spdx_license_key": "LicenseRef-scancode-3com-microcode",
  "text": "Redistribution and use in source and binary forms of the \nmicrocode software are permitted provided that the following conditions\nare met:\n1. Redistribution of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n2. Redistribution in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n3. The name of 3Com may not be used to endorse or promote products\n   derived from this software without specific prior written permission\n\nTHIS SOFTWARE IS PROVIDED BY 3COM ``AS IS'' AND ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\nIN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\nNOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nUSER ACKNOWLEDGES AND AGREES THAT PURCHASE OR USE OF THE\nMICROCODE SOFTWARE WILL NOT CREATE OR GIVE GROUNDS FOR A LICENSE BY\nIMPLICATION, ESTOPPEL, OR OTHERWISE IN ANY INTELLECTUAL PROPERTY RIGHTS\n(PATENT, COPYRIGHT, TRADE SECRET, MASK WORK, OR OTHER PROPRIETARY RIGHT)\nEMBODIED IN ANY OTHER 3COM HARDWARE OR SOFTWARE EITHER SOLELY OR IN\nCOMBINATION WITH THE MICROCODE SOFTWARE"
}