{
  "key": "4suite-1.1",
  "short_name": "4Suite 1.1",
  "name": "4Suite License v1.1",
  "category": "Permissive",
  "owner": "Fourthought, Inc.",
  "spdx_license_key": "LicenseRef-scancode-4suite-1.1",
  "ignorable_copyrights": [
    "Copyright (c) 2000 Fourthought, Inc.",
    "Copyright (c) 2000 The Apache Software Foundation"
  ],
  "ignorable_holders": [
    "Fourthought, Inc.",
    "The Apache Software Foundation"
  ],
  "ignorable_authors": [
    "Fourthought, Inc. (http://www.fourthought.com)"
  ],
  "ignorable_urls": [
    "http://www.fourthought.com/"
  ],
  "ignorable_emails": [
    "info@fourthought.com"
  ],
  "text": "License and copyright info for 4Suite software\n=====================================\n\n4Suite software copyright\n-------------------------\n\nThe copyright on 4Suite as a whole is owned by Fourthought, Inc.\n(USA). Copyright on the components of 4Suite is indicated in the\nsource code; most files have their own notice of copyright and\nownership, and a CVS datestamp to clarify the actual date of\nauthorship or last revision/publication. For purposes of usage and\nredistribution, the following Apache-based license applies.\n\nThe 4Suite License, Version 1.1\n-------------------------------\n\nCopyright (c) 2000 Fourthought, Inc.  All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n 1. Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n\n 2. Redistributions in binary form must reproduce the above\n    copyright notice, this list of conditions and the following\n    disclaimer in the documentation and/or other materials provided\n    with the distribution.\n\n 3. The end-user documentation included with the redistribution,\n    if any, must include the following acknowledgment:\n       \"This product includes software developed by\n        Fourthought, Inc. (http://www.fourthought.com).\"\n    Alternately, this acknowledgment may appear in the software\n    itself, if and wherever such third-party acknowledgments\n    normally appear.\n\n 4. The names \"4Suite\", \"4Suite Server\" and \"Fourthought\" must not\n    be used to endorse or promote products derived from this\n    software without prior written permission. For written\n    permission, please contact info@fourthought.com.\n\n 5. Products derived from this software may not be called \"4Suite\",\n    nor may \"4Suite\" appear in their name, without prior written\n    permission of Fourthought, Inc.\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\n IN NO EVENT SHALL FOURTHOGHT, INC. OR ITS CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n===================================================================\n\nThis license is based on the Apache Software License, Version 1.1,\nCopyright (c) 2000 The Apache Software Foundation.\nAll rights reserved."
}