{
  "key": "aardvark-py-2014",
  "short_name": "Aardvark I2C/SPI 2014",
  "name": "Aardvark I2C/SPI Software and Firmware License 2014",
  "category": "Proprietary Free",
  "owner": "Total Phase",
  "homepage_url": "https://github.com/totalphase/aardvark_py/blob/master/LICENSE.txt",
  "spdx_license_key": "LicenseRef-scancode-aardvark-py-2014",
  "ignorable_emails": [
    "sales@totalphase.com"
  ],
  "text": "LICENSE AGREEMENT\n\nAardvark I2C/SPI Software and Firmware\n\nPREAMBLE:\n  The accompanying software, firmware, documentation, and related\n  materials (\"Product\") are the sole property of Total Phase, Inc.\n  (\"Total Phase\").  Its use and distribution is subject to the\n  terms in this License Agreement (\"Agreement\").\n\n  By the use or distribution of the Product, you are consenting to\n  be bound by the terms of this Agreement.  If you do not agree, do\n  not use or distribute the Product in whole or in part.\n\n\nTERMS OF USE:\n  Permission to use, copy, modify, and distribute the Product\n  is hereby granted, subject to the conditions stated below:\n\n  a. The Product is licensed only for use with other Total Phase\n     products.  Any other use is permitted only with the express\n     written permission of Total Phase.\n\n  b. The Product may only be copied unmodified in its entirety,\n     with all of the files intact including a verbatim copy of this\n     Agreement.  Distribution of modified copies is permitted only\n     with the express written permission of Total Phase.\n\n  c. The Product must not be placed on any publicly-accessible\n     Internet server including, but not limited to, web servers, ftp\n     servers, and file sharing systems.  Instead, a link should be\n     placed to the Total Phase website where the latest versions\n     may be obtained.\n\n  d. As a special exemption, a copy of the shared object file,\n     aardvark.dll or aardvark.so (\"Shared Object File\"), may be\n     distributed separately from the Product, provided that it is part\n     of a separate work (\"Separate Work\").  Such Shared Object Files\n     carry with them all of the rights and limitations outlined in\n     this Agreement, except that it may not be further distributed\n     unless part of the Separate Work.\n\n     Before publicly distributing the Shared Object Files, whether\n     gratis or for a fee, you must notify Total Phase by electronic\n     mail to: sales@totalphase.com to the attention of General\n     Manager. Provide a description of the Separate Work, specifically\n     mentioning how any Total Phase hardware and the Shared Object\n     Files will be integrated into the Separate Work and your proposed\n     method of distribution. Total Phase will acknowledge the\n     notification within one week.\n\n     You are required to include a copy of this Agreement with your\n     Separate Work.\n\n  e. Any separate works which include the Product must be plainly\n     marked as such, and must not be misrepresented as the original\n     software.\n\n  f. You may not modify, translate, reverse-engineer, decompile,\n     disassemble (except and solely to the extent that an applicable\n     statute expressly and specifically prohibits such restrictions),\n     or create derivative works of the Product.  A separate work\n     that only makes use of the unmodified shared object file is not\n     considered a derivative work.\n\n\nPROPRIETARY RIGHTS:\n  The Product is owned by Total Phase and is protected by United\n  States copyright laws and international treaty provisions.  All\n  copyright, patent, trade secret, trademarks, and other intellectual\n  and proprietary rights in the Product are and shall remain the\n  valuable property of Total Phase.  You agree to take all necessary\n  steps to ensure that this property is protected and that the\n  provisions of this Agreement are not violated by you or by any\n  person under your control or in your service.\n\n\nTERMINATION:\n  Your rights under this license will terminate automatically if you\n  fail to comply with the terms and conditions set forth herein.\n\n  If any provision of this license agreement is held to be\n  unenforceable, that provision shall be reformed only to the extent\n  necessary to make it enforceable; and the balance of this license\n  agreement shall remain in full force and effect.\n\n\nSAFETY-CRITICAL SYSTEMS POLICY:\n  The Product is not authorized for use in life support devices or\n  systems.  Life support devices or systems include, but are not\n  limited to, surgical implants, medical systems, and other\n  safety-critical systems in which failure of a Total Phase product\n  could cause personal injury or loss of life.\n\n  The Product is not fault-tolerant and is not designed, manufactured\n  or intended for use or resale in hazardous environments requiring\n  fail-safe performance, such as in the operation of nuclear facilities,\n  aircraft navigation or communication systems, air traffic control,\n  or weapons systems, in which the failure of the Product could lead\n  directly to death, personal injury, or severe physical or environ-\n  mental damage.  Such use is unauthorized by Total Phase.\n\n  Should the Product be used in any such unauthorized manner, Buyer\n  agrees to indemnify and hold harmless Total Phase, its officers,\n  employees, affiliates, and distributors from any and all claims\n  arising from such use, even if such claim alleges that Total Phase\n  was negligent in the design or manufacture of the Product.\n\n\nOPEN SOURCE:\n  The software API portion of the Product makes use of open source\n  libraries that are not owned by Total Phase and are licensed under\n  different terms.  For specific details, please see the documentation\n  that is included with the software API package.\n\n\nDISCLAIMER:\n  THE PRODUCT IS PROVIDED \"AS IS,\" WITHOUT WARRANTY OF ANY KIND.\n  THE COPYRIGHT HOLDER(S) AND TOTAL PHASE DISCLAIM ANY AND ALL\n  WARRANTIES, WHETHER EXPRESSED OR IMPLIED, INCLUDING BUT NOT\n  LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\n  PARTICULAR PURPOSE AND NON-INFRINGEMENT.\n\n  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S), TOTAL PHASE, ITS\n  OFFICERS, EMPLOYEES, AFFILIATES, AND DISTRIBUTORS BE LIABLE FOR\n  ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT\n  OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n  BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\n  USE OF THE PRODUCT, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\n  DAMAGE."
}