{
  "key": "accellera-systemc",
  "short_name": "SystemC Open Source License Agreement",
  "name": "SystemC Open Source License Agreement",
  "category": "Permissive",
  "owner": "Accellera",
  "homepage_url": "https://www.accellera.org/images/about/policies/SystemC_Open_Source_License_v3.3.pdf",
  "spdx_license_key": "LicenseRef-scancode-accellera-systemc",
  "faq_url": "https://accellera.org/about/policies-and-procedures",
  "ignorable_copyrights": [
    "(c) 1996- current year here",
    "(c) 1996- current year here by all Contributors",
    "Copyright (c) 1996- current year here by all Contributors"
  ],
  "ignorable_holders": [
    "here",
    "here by all Contributors"
  ],
  "ignorable_authors": [
    "through the Accellera working group process"
  ],
  "ignorable_urls": [
    "http://www.accellera.org/"
  ],
  "ignorable_emails": [
    "info@accellera.org"
  ],
  "text": "SystemC Open Source License Agreement\n(Download, Use and Contribution License Agreement Version 3.3)\n\nPLEASE READ THIS LICENSE AGREEMENT CAREFULLY BEFORE CLICKING ON THE \"ACCEPT\"\nBUTTON, AS BY CLICKING ON THE \"ACCEPT\" BUTTON YOU ACKNOWLEDGE THAT YOU\nHAVE READ, UNDERSTOOD AND AGREE TO BE BOUND BY THIS LICENSE AGREEMENT AND\nALL OF ITS TERMS AND CONDITIONS.\n\nAccellera Systems Initiative\n\nThe purpose of the following license agreement (the \"Agreement\") is to encourage interoperability and\ndevelopment of a C++ modeling language known as \"SystemC\" for system simulation and design (the\n\"Purpose\"). The SystemC software and other items licensed hereunder are licensed, without fee of any kind,\nfor use pursuant to the terms and conditions set forth in this Agreement.\n\nLicense Agreement\n\nTHE CONTRIBUTORS ARE WILLING TO LICENSE THEIR RESPECTIVE CONTRIBUTIONS TO YOU ONLY\nON THE CONDITION THAT YOU ACCEPT ALL OF THE TERMS OF THIS LICENSE AGREEMENT. IF YOU\nDO NOT AGREE TO ALL OF THE TERMS OF THIS LICENSE AGREEMENT, THEN NO RIGHTS ARE\nGRANTED TO YOU HEREUNDER TO USE ANY CONTRIBUTIONS. NOTWITHSTANDING ANYTHING TO\nCONTRARY, ANY USE, REPRODUCTION OR DISTRIBUTION OF ANY CONTRIBUTION CONSTITUTES\nYOUR ACCEPTANCE OF THIS AGREEMENT.\n\n1. Definitions\n\n1.1 “Agreement” means this contract.\n1.2 “Accellera” means Accellera Systems Initiative, a California nonprofit mutual benefit corporation.\n1.3 “Accellera Documentation” means the SystemC language reference manual and any other materials\nassigned to Accellera pursuant to the Copyright Agreement.\n1.4 “Accellera Release” means a Contribution or combination of Contributions which is developed or\ncreated through the Accellera working group process, and the final work approved for release by a Accellera\nworking group, approved for release by the Accellera steering group and approved for release by the board of\ndirectors of Accellera. Examples of Accellera Releases include Accellera libraries and Accellera\nspecifications. Accellera Documentation shall be deemed to be included in the definition of Accellera\nRelease.\n1.5 “Code Contribution” means any Contribution in the form of Source Code.\n1.6 “Contribution” means any work of authorship that is deposited or contributed in accordance with\nSection 3 in furtherance of the Purpose including, without limitation, libraries, programs, specifications\nand User Documentation and Modifications. Without limiting the generality of the foregoing, a list of all\nContributions which were deposited or contributed on or before July 13, 2006 is set forth on Exhibit A\nattached hereto and incorporated herein by reference, all of which are considered Contributions pursuant to\nthis Agreement. A list of all Contributions is available upon written request to Accellera and can also be\nfound on the Website. For purposes of clarification, all contributions licensed pursuant to that certain\nSystemC Open Source License Agreement (Software Download and Use License Agreement Version 2.4)\nshall constitute, and be treated as, Contributions pursuant to this Agreement.\n1.7 “Copyright Agreement” means any LRM and Copyright Contribution Agreement entered into\nbetween Accellera and the signatory thereto at any time prior to or after the date hereof.\n1.8 “ Contribution Questionnaire” means the questionnaire attached hereto as Exhibit C.\n1.9 “Contributor” means any person or entity that makes a Contribution pursuant to Section 3. For\npurposes of clarification, any person or entity depositing or contributing, as part or all of a Contribution, a\nContribution which has previously been so deposited or contributed is not the Contributor of such re-\ndeposited Contribution for the purposes of this Agreement. A list of all Contributors is available upon written\nrequest to Accellera and can also be found on the Website.\n1.10 “Contributor's Necessary Patent Claims” means those claims of all patents owned or licensable by\nContributor throughout the world that: (1) Contributor has the right to license (within the scope set forth\nherein) without the obligation to pay royalties or other consideration to third parties; and (2) are necessarily\nand directly infringed solely by the portion of a computer program that either implements, or is compiled\nfrom, either an unmodified Contribution or an Accellera Release. For clarity, Contributor’s Necessary Patent\nClaims shall not include any claim directed towards a data structure, method, algorithm, process, technique,\ncircuit representation, or circuit implementation that is not completely and entirely described either in such\nContributor’s Contribution or in an Accellera Release. Further, a Contributor’s Necessary Patent Claims shall\nnot include any claim based upon the combination of any Contribution or an Accellera Release with other\nworks of authorship, to the extent that the Contributor’s Necessary Patent Claims are infringed as a result of\nsuch combination.\n1.11 “Copyright Rights” means worldwide statutory and common law rights associated solely with works\nof authorship including copyrights, copyright applications, copyright registrations, and “moral rights”. For\npurposes of clarification, patents are not included in Copyright Rights.\n1.12 “Derivative” or “Derivative work” means a work based upon one or more preexisting works, such\nas a translation, condensation, or any other form in which a work may be recast, transformed, or\nadapted. A work consisting of editorial revisions, annotations, elaborations, or other modifications, which,\nas a whole, represent an original work of authorship, is a “derivative work”.\n1.13 “Distribute” means making a Distribution.\n1.14 “Distribution” means any distribution, sublicensing or other transfer of a Contribution to any third\nparty.\n1.15 “Documentation” means, collectively, all User Documentation and Accellera Documentation.\n1.16 “Marks” means, collectively, the registered and unregistered marks and logos that Accellera has\nlicensed or otherwise authorized Recipient to use. All marks and logos are listed on Exhibit D, which list\nmay be amended from time to time by Accellera to add or delete any marks or logos.\n1.17 “Modification” means any additions or deletions to any Contribution.\n1.18 “Recipient” means any person or entity which receives any Contribution under this Agreement. For\nlegal entities, “Recipient” includes any entity that controls, is controlled by, or is under common control with\nRecipient. For purposes of this Section 1.18, “control” means beneficial ownership of fifty percent (50%) or\nmore of the outstanding shares or similar interest of such entity entitled to vote for election of the board of\ndirectors or similar managing authority.\n1.19 “Source Code” means human readable text in an electronic form suitable for modification that\ndescribe the functions and data structures, including C, C++, and other language modules, plus any associated\ninterface definition files, scripts used to control compilation and installation of a computer program, or a list\nof source code differential comparisons.\n1.20 “User Documentation” means all user guides, user manuals and other similar materials related to any\nContribution or an Accellera Release.\n1.21 “Website” means Accellera’s internet website located at http://www.accellera.org.\n\n2. GRANT OF RIGHTS\n\n2.1 Subject to the terms of this Agreement, each Contributor hereby grants to each Recipient a non-\nexclusive, worldwide, royalty-free license under such Contributor's Copyright Rights to do the following:\n(a) Use, reproduce, prepare Derivative works of, publicly display, publicly perform and Distribute any\nContributions of such Contributor and Derivative works thereof; and\n(b) Use the know-how, information and knowledge embedded in the Contribution, without any\nobligation to keep the foregoing confidential so long as the Recipient does not otherwise violate this\nAgreement.\n2.2 Accellera hereby grants to each Recipient a non-exclusive, worldwide, royalty- free license under\nAccellera's Copyright Rights to use, reproduce, prepare Derivative works of, publicly display, publicly\nperform and distribute the Accellera Documentation and any Derivative works thereof, subject to the terms\nand conditions of this Agreement.\n2.3 Subject to the terms of this Agreement, each Contributor hereby grants to each Recipient, a worldwide,\nroyalty-free, non-exclusive license under such Contributor's Necessary Patent Claims to make, have made,\nuse, sell, offer for sale, or import: (a) such Contributor's Contributions; (b) those portions of a computer\nprogram that either implements, or is compiled from, the Contributor’s unmodified Contribution; and (c)\nthose portions of a computer program that implement, or are compiled from, an Accellera Release.\n2.4 Each Contributor represents that, to its knowledge, it has sufficient rights in and to each of its\nContributions to grant the licenses set forth in Sections 2.1 and 2.3. Accellera represents that, to its\nknowledge, it has sufficient rights in the Accellera Documentation to grant the license set forth in Section\n2.2.\n2.5 Except as expressly stated in Sections 2.1, 2.2 and 2.3, Recipient receives no rights or licenses to the\nintellectual property of any Contributor or Accellera under this Agreement, whether expressly, by implication,\nestoppel or otherwise. All rights in and to any Contribution not expressly granted under this Agreement are\nreserved.\n2.6 Except as specifically set forth in any Copyright Agreement, Contributor shall ensure that transfers or\nassignments of all or any part of its right, title, and interest in and to any Contributions contributed or\ndeposited by Contributor hereunder, including all Copyright Rights and patent rights embodied therein,\nshall be subject to the rights expressly granted in this Agreement including, without limitation, the licenses\ngranted in Sections 2.1 and 2.3. Recipient shall not remove or alter any proprietary notices contained in\nthe Contributions licensed to Recipient hereunder and shall reproduce and include such notices on any copies\nof the Contributions made by Recipient in any media.\n2.7 License to Marks.\n(a) Accellera shall retain all right, title and interest in and to the Marks worldwide, subject to the\nlimited license granted to Recipient in this Section 2.7. Accellera hereby grants Recipient a non-\nexclusive, royalty-free, limited license to use the Marks solely in connection with its exercise of\nthe rights granted pursuant to this Agreement and to indicate that the products being marketed by\nRecipient are compatible with, and meet the standards of, Accellera Releases. All uses of the Marks\nshall be in accordance with Accellera’s trademark usage policy set forth in Exhibit D.\n(b) Recipient shall assist Accellera to the extent reasonably necessary to protect and maintain the\nMarks worldwide, including, but not limited to, giving prompt notice to Accellera of any known or\npotential infringement of the Marks, and cooperating with Accellera in preparing and executing any\ndocuments necessary to register the Marks, or as may be required by the laws or rules of any country\nor jurisdiction. In its sole discretion, Accellera may commence, prosecute or defend any action or\nclaim concerning the Marks. Accellera shall have the right to control any such litigation, and\nRecipient shall fully cooperate with Accellera in any such litigation. Accellera shall reimburse\nRecipient for the reasonable costs associated with providing such assistance, except to the extent that\nsuch costs result from Recipient’s breach of this Section 2.7. Recipient shall not commence any action\nregarding the Marks without Accellera’s prior written consent.\n(c) All goodwill with respect to the Marks shall accrue for the sole benefit of Accellera.\nRecipient shall maintain the quality of any products, associated packaging, collateral and marketing\nmaterials on which it uses any of the Marks in a manner consistent with all terms, conditions and\nrequirements set forth in this Section 2.7 and at a level that meets or exceeds Recipient’s overall\nreputation for quality and that is at least commensurate with industry standards.\n2.8 RECIPIENT UNDERSTANDS THAT ALTHOUGH EACH CONTRIBUTOR AND ACCELLERA GRANTS\nTHE LICENSES SET FORTH HEREIN, NO ASSURANCES ARE PROVIDED BY ANY CONTRIBUTOR OR\nACCELLERA THAT ANY ACCELLERA RELEASE OR ANY CONTRIBUTION, EITHER ALONE OR IN\nCOMBINATION WITH ANY OTHER CONTRIBUTION, DOES NOT INFRINGE THE PATENT OR OTHER\nINTELLECTUAL PROPERTY RIGHTS OF ANY OTHER ENTITY. MOREOVER, NO ASSURANCES ARE\nMADE THAT ANY CONTRIBUTION OF ONE CONTRIBUTOR DOES NOT INFRINGE THE INTELLECTUAL\nPROPERTY RIGHTS OF ANOTHER CONTRIBUTOR. EACH CONTRIBUTOR AND ACCELLERA DISCLAIM\nANY LIABILITY TO RECIPIENT FOR CLAIMS BROUGHT BY ANY OTHER ENTITY BASED ON\nINFRINGEMENT OF INTELLECTUAL PROPERTY RIGHTS OR OTHERWISE. In addition, as a condition to\nexercising the rights and licenses granted hereunder, each Recipient hereby assumes sole responsibility to\nsecure any other intellectual property rights needed, if any. For example, if a third party patent license is\nrequired to allow Recipient to distribute a computer program, then it is Recipient's responsibility to acquire\nthat license before Distributing such computer program.\n\n3. DESCRIPTION AND DEPOSIT OF CONTRIBUTIONS\n\n3.1 To the extent Recipient wishes to become a Contributor by making a Contribution, such\nContributor shall:\n(a) (i) Deposit such Contribution at the Website according to the Contribution instructions found at\nsuch Website, or (ii) disclose such Contribution at a meeting of any working group of Accellera;\n(b) (i) Describe such Contribution in reasonable detail on Exhibit B (including the additions or\nchanges such Contributor made to create the Contribution and the date of any such changes or\nadditions), (ii) completing a Contribution Questionnaire with respect to such Contribution, and (iii)\ndelivering both documents to the Secretary of Accellera. All Contributions made after the date\nhereof shall be effectuated by Contributor (x) amending Exhibit B and delivering such amended\nExhibit B to the Secretary of Accellera, which amended exhibit shall automatically replace the existing\nExhibit B, (y) completing a Contribution Questionnaire with respect to such Contribution, and (z)\ndelivering both documents to the Secretary of Accellera;\n(c) Cause such Contribution to contain a file documenting such Contributor's name and contact\ninformation, additions or changes such Contributor made to create the Contribution, and the date of\nany such changes or additions; and\n(d) Cause such Contribution to include in each file a prominent statement substantially similar to the\nfollowing: “Any code contained in this Contribution is derived, directly or indirectly, from the\nSystemC source code. Copyright© 1996-[current year here] by all Contributors. All Rights reserved.\nThe contents of this file are subject to the restrictions and limitations set forth in the SystemC Open\nSource License Version 3.1 (the “License”). You may not use this file except in compliance with such\nrestrictions and limitations. You may obtain instructions on how to receive a copy of the License at\nhttp://www.accellera.org/. Software distributed by Contributors under the License is distributed\nexclusively on an “AS IS” basis, WITHOUT WARRANTY OF ANY KIND, either express or\nimplied. See the License for the specific language governing rights and limitations under the License.”\n3.2 Accellera may from time to time publish policies and procedures regarding the contribution or\ndepositing of Contributions as well as establish additional details regarding the contribution process. Without\nlimiting the foregoing, Accellera or the administrators of the Website shall have the right to remove any\nContribution from the Website at any time.\n\n4. REQUIREMENTS OF DISTRIBUTION\n\n4.1 A Recipient may choose to Distribute any Contribution or any compilation of multiple Contributions\n(except for any Code Contributions) under its own license agreement provided that:\n(a) Recipient complies with the terms and conditions of this Agreement;\n(b) As between Recipient and any other Contributor, Recipient assumes all warranties and conditions,\nexpress and implied, and all liability for damages arising out of its Distribution; and\n(c) Recipient makes available to recipients of such Distribution then Source Code for such\nDistributions, and informs them on how to obtain it in a reasonable manner on or through a medium\ncustomarily used for software exchange.\n4.2 If a Recipient chooses to Distribute any Code Contribution or compilations of Code Contributions\nthen:\n(a) Such Code Contribution must be Distributed under this Agreement; and\n(b) A copy of this Agreement must be included with each copy of such Code Contribution.\n4.3 Each Recipient must include the following in a conspicuous location in the Code Contribution so\nDistributed: “Copyright© 1996-[current year here], by all Contributors. All rights reserved.”\n4.4 In addition, each Recipient that creates and Distributes or otherwise transfers a Modification whether\nor not such Modification has been deposited pursuant to Section 3 must identify the originator of such\nModification in a manner that reasonably allows third parties to identify the originator of the Modification.\n4.5 A Recipient may choose to Distribute the Accellera Documentation under its own license agreement,\nprovided that Recipient complies with the terms and conditions of this Agreement. Each Recipient must\ninclude the following in a conspicuous location in the Accellera Documentation so Distributed or transferred:\n“Copyright© 1996-[current year here], by Accellera Systems Initiative. All rights reserved.”\nIn addition, each Recipient that creates and Distributes a modification or Derivative work of the Accellera\nDocumentation, whether or not such modification or Derivative work has been contributed pursuant to a\nCopyright Agreement must identify the originator of such modification or Derivative work in a manner that\nreasonably allows third parties to identify the originator of the modification or derivative work.\n\n5. INDEMNIFICATION\n\nAny Recipient which Distributes any Contribution and/or Accellera Release (a “Distributor”) may accept\ncertain responsibilities with respect to end users, business partners and the like. While this license is\nintended to facilitate the commercial use of Contributions Accellera Documentation and Accellera\nReleases, a Distributor shall Distribute such Contributions, Accellera Documentation and Accellera Releases\nin a manner which does not create potential liability for the Contributors. Therefore each Distributor hereby\nagrees to defend and indemnify every Contributor (“Indemnified Contributor”) against any losses,\ndamages and costs (collectively “Losses”) arising from claims, lawsuits and other legal actions brought\nby a third party against the Indemnified Contributor to the extent caused by the acts or omissions of such\nDistributor, including but not limited to the terms and conditions under which Distributor offered such\nContributions, Accellera Documentation and/or Accellera Releases in connection with its Distribution thereof.\nThe obligations in this Section 5 do not apply to any claims or Losses relating to any actual or alleged\nintellectual property infringement of any Contribution, Accellera Documentation or Accellera Release. In\norder to qualify, an Indemnified Contributor must: (a) promptly notify the Distributor in writing of such\nclaim, and (b) allow the Distributor to control, and cooperate with the Distributor in, the defense and any\nrelated settlement negotiations. The Indemnified Contributor may participate in the defense of any such claim\nat its own expense.\nFor example, a Recipient might include a Contribution in a commercial product offering, Product X. That\nRecipient is then a Distributor. If that Distributor then makes performance claims, or offers warranties,\nsupport, or indemnity or any other license terms related to Product X, those performance claims, offers and\nother terms are such Distributor's responsibility alone. Under this Section 5, the Distributor would have to\ndefend claims against the Contributors related to those performance claims, offers, and other terms, and if a\ncourt requires any Contributor to pay any damages as a result, the Distributor must pay those damages.\n\n6. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, ALL CONTRIBUTIONS, ACCELLERA\nDOCUMENTATION AND ACCELLERA RELEASES ARE PROVIDED EXCLUSIVELY ON AN “AS IS” BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING,\nWITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT,\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. EACH RECIPIENT IS SOLELY\nRESPONSIBLE FOR DETERMINING THE APPROPRIATENESS OF ITS USE AND DISTRIBUTION OF ANY\nCONTRIBUTION, ACCELLERA DOCUMENTATION AND ACCELLERA RELEASE AND ASSUMES ALL\nRISKS ASSOCIATED WITH ITS EXERCISE OF RIGHTS UNDER THIS AGREEMENT, INCLUDING BUT NOT\nLIMITED TO THE RISKS AND COSTS OF PROGRAM ERRORS, COMPLIANCE WITH APPLICABLE LAWS,\nDAMAGE TO OR LOSS OF DATA, PROGRAMS OR EQUIPMENT, AND UNAVAILABILITY OR\nINTERRUPTION OF OPERATIONS. THIS DISCLAIMER OR WARRANTY CONSTITUTES AN ESSENTIAL\nPART OF THIS AGREEMENT. NO USE OF ANY CONTRIBUTION, ACCELLERA DOCUMENTATION OR\nACCELLERA RELEASE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n7. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NONE OF THE RECIPIENTS, CONTRIBUTORS\nOR ACCELLERA SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, PUNITIVE, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST\nPROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\nUSE OR DISTRIBUTION OF ANY CONTRIBUTION, ACCELLERA DOCUMENTATION OR ACCELLERA\nRELEASE OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n8. U.S. GOVERNMENT USE\n\nIf Recipient is licensing any computer program on behalf of any unit or agency of the United States\nGovernment, then such computer program is commercial computer software, and, pursuant to FAR 12.212 or\nDFARS 227.7202 and their successors, as applicable, shall be licensed to the Government under the terms and\nconditions of this Agreement.\n\n9. PATENT CLAIMS\n\nIf Recipient institutes patent litigation against any entity (including a cross-claim, counterclaim or declaratory\njudgment claim in a lawsuit) alleging that any Contribution, Accellera Release or combination of\nContributions (excluding combinations of any Contribution with other software or hardware) infringes such\nRecipient's patent(s), then the rights granted to Recipient by each Contributor under Section 2 shall terminate\nas of the date such litigation is filed.\n\n10. TERMINATION\n\nAll Recipient's rights under this Agreement shall terminate if Recipient fails to comply with any of the\nmaterial terms or conditions of this Agreement and does not cure such failure in a reasonable period of time\nafter becoming aware of such noncompliance. If such occurs, Recipient shall cease all use and Distribution of\nany Contributions of any other Contributor, Accellera Documentation and Accellera Releases based upon the\nrights granted to Recipient under this Agreement as soon as reasonably practicable. However,\nRecipient's obligations under this Agreement and any licenses granted by Recipient relating to any\nContributions shall survive such termination.\n\n11. LICENSE VERSIONS\n\nAccellera may publish new versions (including revisions) of this Agreement from time to time. Each\nnew version of the Agreement will be given a distinguishing version number. Any Contribution, Accellera\nDocumentation or Accellera Release may always be Distributed subject to the version of the Agreement under\nwhich it was received. In addition, after a new version of the Agreement is published, Contributor may elect\nto Distribute any Contribution, Accellera Documentation or Accellera Release under the new version. No\none other than Accellera, acting by a vote of at least seventy five percent (75%) of the members of its Board\nof Directors, has the right to modify this Agreement; provided that Exhibit B and Exhibit C may be amended\nas specifically set forth in Section 3.1(b), and Exhibit D may be amended as specifically set forth in Section\n1.13.\n\n12. ELECTRONIC ACCEPTANCE\n\nThis Agreement may be executed either electronically or on paper. If this Agreement is executed\nelectronically, by clicking on the “Accept” button, Recipient warrants that it agrees to all of the terms of this\nAgreement, that Recipient is authorized to enter into this Agreement, and that this Agreement is legally\nbinding upon Recipient. If Recipient does not agree to be bound by this Agreement, then Recipient shall\nclick the “Decline” button and Recipient shall not receive any rights from the Contributors nor shall\nRecipient download any Contributions, Accellera Documentation or Accellera Releases.\n\n13. GENERAL\n\nThis Agreement represents the complete agreement concerning the subject matter hereof and supersedes all\nprior agreements or representations, oral or written, regarding the subject matter hereof. If any provision of\nthis Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or\nenforceability of the remainder of the terms of this Agreement, and without further action by the parties\nhereto, such provision shall be reformed to the minimum extent necessary to make such provision valid and\nenforceable. This Agreement shall be executed in multiple counterparts (either electronically and/or on paper),\neach of which shall be deemed to be an original, but all of which shall be one and the same Agreement. A\nfacsimile or other copy of the Agreement shall have the same force and effect as an originally executed copy\nthereof.\nThis Agreement is governed by the laws of California, without reference to conflict of laws principles. Each\nparty waives its rights to a jury trial in any resulting litigation. Any litigation relating to this Agreement shall\nbe subject to the jurisdiction of the Federal Courts of the Northern District of California, with venue lying in\nSanta Clara County, California, or the Santa Clara County Superior Court. The application of the United\nNations Convention on Contracts for the International Sale of Goods is expressly excluded. The provisions of\nthis Agreement shall be construed fairly in accordance with its terms and no rules of construction for or\nagainst either party shall be applied in the interpreting this Agreement. Recipient shall not use any\nContribution, Accellera Documentation or Accellera Release in violation of local and other applicable laws\nincluding, but not limited to, the export control laws of the United States.\n\n<Signature page follows>\n\nIN WITNESS WHEREOF, duly authorized representatives of the parties have executed and delivered this\nAgreement as of the later of the dates set forth below.\n\nRECIPIENT:\nBy:\nName:\nIts:\nDate:\nACCELLERA SYSTEMS INITIATIVE:\nBy:\nName:\nIts:\nDate:\n\nEXHIBIT A\nList of Contributions as of July 13, 2006\n\nNumber Contribution\n1. Updated TLM Proposal\n2. TLM Extensions\n3. Abstract titled \"Transaction Level Modeling in SystemC\"\n4. Code and related material entitled \"SCE-API Example - Standard Co-emulation APO v1.8 Spec and Routed\n  Example\"\n5. Code and related material entitled \"Simplebus v2.2 Example for SystemC v2.0.\n6. Code and related material entitled \"SystemC Generic Transaction Level Communication Channel.\"\n7. Review of TLM API code and related documents.\n8. SystemC Verification Library version 1.0; versions 1.1, 1.2, 2.0, 2.0.1 of the SystemC modeling language as\n   released by Accellera and which are, or were, available for download on the website prior to the\n   agreement; version 2.1 (beta 11) of the SystemC modeling language to be released and made available by\n   Open SystemC Initiative for download on the website.\n9. Code and related material entitled \"System Design with SystemC Examples.\"\n10. Presentation document titled \"Towards a SystemC Transaction Level Modeling Standard,\" dated June\n    2004; presentation document titled \"TLM Extensions,\" dated April 2004; presentation document titled\n    \"Updated TLM Proposal,\" dated March 29, 2004; abstract titled \"Transaction Level Modeling in System C.\"\n11. Code and related material entitled \"MP3 Decoder Example plus Performance Benchmark.\"\n12. SystemC October 12 Library.\n13. Source code modifications to the SystemC Library embodied in the October 12, 2004 kit\n    (system_2_z_lib.oct_12_2004.tgz).\n    Source code modifications to the SystemC Regression Test Suite embodied in the October 12, 2004 kit\n    (systemc_2_1_tests.oct_12_2004.tgz).\n14. Synthesizable Subset 1.0.\n15. TLM Contribution (Presentation documents; abstract; code; proposal dated 3/24/04).\n16. Updated version of TLM kit\n17. Code and related material “2.1 Beta Regression Tests”\n18. Code and related material “OSCI SystemC 2.1 Beta”\n19. SystemC 2.1\n20. Assorted recommendations for enhancements, bug fixes and improved cross-platform support, including\n    project files for Microsoft Visual C++ versions 6.0 and 7.1 that are contained within the files systemc-\n    2.1.05may05.tgz and systemc_tests-2.105may05.tgz.\n21. Minor modifications incorporated in SystemC 2.1 open source implementation dated July 14, 2005 to\n    permit port to Microsoft VC++ Version 7.\n22. Numerous modifications incorporated in SystemC 2.1 open source implementation dated July 14, 2005.\n23. A collection of interfaces and implementations in SystemC for analysis objects.\n    A collection of interfaces and implementations in SystemC for configuring components in a design.\n24. Modifications to the most recent version of SCV which allow it to run under the SystemC-2.1v1 kit.\n25. Set of header files intended to be included in the SystemC TLM Modeling library code. The API provides\n    for 1 interfaces: (a) “Atom at once (Variously called BA, PVT, CC) in which a single atom is transported at\n    once.\n26. Modifications included in SystemC 2.2 library labeled “systemc-2.2.04feb06.tgz;”\n    Modifications included in SystemC 2.2 test suites labeled “systemc_tests-2.2.04feb06.tgz.”\n27. Modifications to the SystemC 2.2 library to enable the port to gcc version 4;\n    Addition of compliance_1666 tests to the SystemC 2.2 regression test suite.\n28. OSCI_TL3_2006_03_01.zip, including any updates of any of the foregoing, and\n    OSCI_SCML_Memory_and_Bitfield_2006_03_01.zip, including any updates of any of the foregoing.\n29. C++/SystemC Code for Mentor’s SMI System PVT channel implementation; An example of a protocol\n    specific SystemC PVT channel implementation; Design examples using the above channel models; A\n    white-paper describing the channel implementations.\n\nEXHIBIT B\nForm of Description of Contributions\n\nA. Description of Contributions\n1.\n2.\n\nThe undersigned hereby makes the Contributions described above\npursuant to the term, conditions and limitations of the SystemC\nLicense.\nBy:\nName:\nIts:\nDate:\nAddress:\nTel:\nFax:\nEmail:\n\nEXHIBIT C\nContribution Questionnaire\nContribution Number (see Exhibit B):\nDate:\n1. Is Contributor a member of Accellera Systems Initiative?\n□ Yes\n□ No\nIf Contributor is a member of Accellera Systems Initiative, please indicate Contributor’s membership status\nand complete questions 2 or 3 (as applicable):\n□ Corporate Member\n□ Associate Member\nIf Contributor is not a member of Accellera Systems Initiative, please skip questions 2 and 3 and go to\nquestion 4.\n\n2. If Contributor is a Corporate Member or Associate Member of Accellera Systems Initiative, please indicate the\nname, title, and contact information for the person making this Contribution on behalf of such Corporate Member\nor Associate Member:\nName:\nTitle:\nAddress:\nPhone:\nFax:\nEmail:\n\n3. If Contributor is not a member of Accellera Systems Initiative, then please complete the following:\nIf the Contributor is a natural person, please indicate the name and address of Contributor’s employer\nand the title of the position held at such employer:\nName of Employer:\nTitle with such Employer:\nAddress:\nPhone:\nFax:\nEmail:\nIf Contributor is an entity (corporation, limited liability company, partnership), then please indicate the\nname, title, and contact information for the person making this Contribution on behalf of such Contributor.\nEntity Name:\nName:\nTitle:\nAddress:\nPhone:\nFax:\nEmail:\n\nEXHIBIT D\n\nTrademark Usage Policy\n\nI. LIST OF MARKS\n1. Open SystemC\n2. Open SystemC Initiative\n3. OSCI\n4. SystemC\n5. SystemC Initiative\n6. All logos that incorporate the foregoing word marks\n\nII. PROPER USE OF MARKS\nTrademarks and service marks function as adjectives and generally should not be used as nouns or verbs.\nAccordingly, as often as possible, the Marks should be used as adjectives immediately preceding the generic\nnoun that refers to the service in question. For example:\nThe SystemC® software\nThe OSCI® LRM\nNo Possessives or Plurals. Since they are not nouns, the Marks should never be used in the possessive or\nplural forms. For example, it is not appropriate to write “SystemC’s software.”\nNo Use as Verbs or as Puns. The Marks should never be used as verbs or as puns.\n\nIII. PROPER ATTRIBUTION\nTrademark ownership is attributed in two ways, with the use of a symbol (TM, SM, ®) after the mark and with a\nlegal legend, usually found at the end of a document following the copyright notice. Following are Accellera’s\nrules for symbols and legends to attribute the Marks:\nSymbols:\nWhich Symbol Do I Use?\nThe Marks generally function as trademarks rather than service marks. Unless you are specifically directed\notherwise, please use the ® symbol after the Marks.\nWhere Do I Place the ® Symbol?\nThe ® symbol is placed immediately after the mark, either in superscript or subscript.\nWhen Do I Use the Symbol?\nThe ® symbol is to be used after the Marks in the following instances:\nMost Prominent Uses: A ® symbol is required after prominent uses of the Marks, e.g., in the headlines and\nlarge print text of web pages, advertisements, other promotional materials and press releases, except where\nspace limitations or specific style considerations prevent compliance with this requirement.\nFirst Use in Text: A ® symbol is required after the first use of each Mark in text, e.g. advertising copy or the\nbody of press releases, even though the symbol may have already appeared in the headline or after another\nprominent use of the mark in the same document.\nAll Logos: The ® symbol must appear after all logos incorporating the Marks.\n\nIV. LEGENDS\nAll Marks that appear on a web page or in a press release, advertisement or other written material (whether in\nprint or electronic form) must be attributed in an appropriate legend. The legend may be presented in\n“mouseprint” but must be large enough to be read easily. Legends generally appear at the end of a document or\nthe bottom of a web page but may be placed elsewhere, e.g. the inside covers of documentation.\nThe Accellera Systems Initiative Legend: The following legend should be used in all materials in which any\nof the Marks appear:\n[Insert the Marks] are trademarks or registered trademarks of Accellera Systems Initiative, Inc. in the United\nStates and other countries and are used with permission.\n\nV. MARKS NEVER COMBINED\nThe Marks should never be combined with the marks of any business other than Accellera. The Marks should\nalways appear visually separate from any other marks appearing in the same materials such that each mark\ncreates a distinct commercial impression. It would, for instance, not be appropriate to superimpose the logo of\nanother business over any Accellera logo.\n\nVI. LOGOS\nLogos incorporating the Marks can only be used in the format provided to you by Accellera for incorporation\ninto your materials or web pages. The logos provided to you by Accellera cannot be modified in any way\nwithout Accellera’s prior written approval. Logos copied from Accellera web pages or other materials may not\nto be used. Please contact info@accellera.org to obtain electronic files containing the Accellera logos and to\nask any question regarding the logos."
}