{
  "key": "adi-bsd-2011",
  "short_name": "ADI BSD 2011",
  "name": "ADI BSD License 2011",
  "category": "Proprietary Free",
  "owner": "Analog Devices",
  "homepage_url": "https://github.com/analogdevicesinc/Linduino/blob/bff9185178d2bf694d0fed14a85392f21655c7de/LICENSE_ADIBSD.txt",
  "spdx_license_key": "LicenseRef-scancode-adi-bsd-2011",
  "text": "Redistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n    - Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n    - Redistributions in binary form must reproduce the above copyright\n      notice, this list of conditions and the following disclaimer in\n      the documentation and/or other materials provided with the\n      distribution.\n    - Neither the name of Analog Devices, Inc. nor the names of its\n      contributors may be used to endorse or promote products derived\n      from this software without specific prior written permission.\n    - The use of this software may or may not infringe the patent rights\n      of one or more patent holders.  This license does not release you\n      from the requirement that you obtain separate licenses from these\n      patent holders to use this software.\n    - Use of the software either in source or binary form, must be run\n      on or directly connected to an Analog Devices Inc. component.\n   \nTHIS SOFTWARE IS PROVIDED BY ANALOG DEVICES \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED.\n\nIN NO EVENT SHALL ANALOG DEVICES BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, INTELLECTUAL PROPERTY\nRIGHTS, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR \nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\nSTRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF \nTHE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}