{
  "key": "adi-bsd-2017",
  "short_name": "ADI BSD 2017",
  "name": "ADI BSD License 2017",
  "category": "Proprietary Free",
  "owner": "Analog Devices",
  "homepage_url": "https://github.com/analogdevicesinc/EVAL-ADICUP360/blob/7d76cf79a72e9e6f28345b37f9476a1da2c2d930/projects/ADuCM360_demo_cn0394/include/ADC.h",
  "spdx_license_key": "LicenseRef-scancode-adi-bsd-2017",
  "text": "Redistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n  - Redistributions of source code must retain the above copyright notice,\n    this list of conditions and the following disclaimer.\n  - Redistributions in binary form must reproduce the above copyright notice,\n    this list of conditions and the following disclaimer in the documentation\n    and/or other materials provided with the distribution.\n  - Modified versions of the software must be conspicuously marked as such.\n  - This software is licensed solely and exclusively for use with processors\n    manufactured by or for Analog Devices, Inc.\n  - This software may not be combined or merged with other code in any manner\n    that would cause the software to become subject to terms and conditions\n    which differ from those listed here.\n  - Neither the name of Analog Devices, Inc. nor the names of its\n    contributors may be used to endorse or promote products derived\n    from this software without specific prior written permission.\n  - The use of this software may or may not infringe the patent rights of one\n    or more patent holders.  This license does not release you from the\n    requirement that you obtain separate licenses from these patent holders\n    to use this software.\n\nTHIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. AND CONTRIBUTORS \"AS IS\" AND ANY\nEXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, NON-INFRINGEMENT,\nTITLE, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN\nNO EVENT SHALL ANALOG DEVICES, INC. OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, DAMAGES ARISING OUT OF CLAIMS OF INTELLECTUAL\nPROPERTY RIGHTS INFRINGEMENT; PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS\nOF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}