{
  "key": "adi-bsd",
  "short_name": "ADI BSD",
  "name": "ADI BSD License",
  "category": "Permissive",
  "owner": "Analog Devices",
  "homepage_url": "https://docs.blackfin.uclinux.org/doku.php?id=adi_bsd",
  "notes": "the home page contains these comments This is a slightly modified version\nof the three clause BSD license. It adds a clause to explicitly state the\npatent protection that this license provides (which is none). The ADI BSD\nLicense is similar to the Clear BSD License, which the Free Software\nFoundation indicates is compatible with both GPLv2 and GPLv3. If you have\nany questions about license compatibility - consult your nearest lawyer.\nBefore incorporating code licensed under the ADI BSD license into projects\nwhich you are going to ship in a end product, you must ensure that you have\nthe patent rights to do.\n",
  "spdx_license_key": "LicenseRef-scancode-adi-bsd",
  "text_urls": [
    "https://docs.blackfin.uclinux.org/doku.php?id=adi_bsd"
  ],
  "text": "Redistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n  - Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n  - Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in\n    the documentation and/or other materials provided with the\n    distribution.\n  - Neither the name of Analog Devices, Inc. nor the names of its\n    contributors may be used to endorse or promote products derived\n    from this software without specific prior written permission.\n  - The use of this software may or may not infringe the patent rights\n    of one or more patent holders.  This license does not release you\n    from the requirement that you obtain separate licenses from these\n    patent holders to use this software.\n\nTHIS SOFTWARE IS PROVIDED BY ANALOG DEVICES \"AS IS\" AND ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, NON-INFRINGEMENT,\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\nIN NO EVENT SHALL ANALOG DEVICES BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\nBUT NOT LIMITED TO, INTELLECTUAL PROPERTY RIGHTS, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\nOTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE"
}