{
  "key": "afl-1.2",
  "short_name": "AFL 1.2",
  "name": "Academic Free License 1.2",
  "category": "Permissive",
  "owner": "Lawrence Rosen",
  "homepage_url": "https://spdx.org/licenses/AFL-1.2.html",
  "notes": "Per SPDX.org, this license has been superseded by later versions. This\nlicense was OSI certified.\n",
  "spdx_license_key": "AFL-1.2",
  "text_urls": [
    "http://opensource-definition.org/licenses/afl-1.2.txt",
    "http://opensource.linux-mirror.org/licenses/afl-1.2.txt",
    "https://spdx.org/licenses/AFL-1.2.html"
  ],
  "other_urls": [
    "http://wayback.archive.org/web/20021204204652/http://www.opensource.org/licenses/academic.php",
    "http://www.gnu.org/licenses/license-list.html#AcademicFreeLicense"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2002 Lawrence E. Rosen"
  ],
  "ignorable_holders": [
    "Lawrence E. Rosen"
  ],
  "text": "Academic Free License\n\t\tVersion 1.2\n\nThis Academic Free License applies to any original work of authorship \n(the \"Original Work\") whose owner (the \"Licensor\") has placed the \nfollowing notice immediately following the copyright notice for the \nOriginal Work:\n\nLicensed under the Academic Free License version 1.2\n\nGrant of License. Licensor hereby grants to any person obtaining a \ncopy of the Original Work (\"You\") a world-wide, royalty-free, \nnon-exclusive, perpetual, non-sublicenseable license (1) to use, copy, \nmodify, merge, publish, perform, distribute and/or sell copies of the \nOriginal Work and derivative works thereof, and (2) under patent claims \nowned or controlled by the Licensor that are embodied in the Original \nWork as furnished by the Licensor, to make, use, sell and offer for \nsale the Original Work and derivative works thereof, subject to the \nfollowing conditions.\n\nAttribution Rights. You must retain, in the Source Code of any \nDerivative Works that You create, all copyright, patent or trademark \nnotices from the Source Code of the Original Work, as well as any \nnotices of licensing and any descriptive text identified therein as an \n\"Attribution Notice.\" You must cause the Source Code for any Derivative \nWorks that You create to carry a prominent Attribution Notice reasonably \ncalculated to inform recipients that You have modified the Original Work.\n\nExclusions from License Grant. Neither the names of Licensor, nor the \nnames of any contributors to the Original Work, nor any of their \ntrademarks or service marks, may be used to endorse or promote products \nderived from this Original Work without express prior written permission \nof the Licensor.\n\nWarranty and Disclaimer of Warranty. Licensor warrants that the copyright \nin and to the Original Work is owned by the Licensor or that the Original \nWork is distributed by Licensor under a valid current license from the \ncopyright owner. Except as expressly stated in the immediately proceeding \nsentence, the Original Work is provided under this License on an \"AS IS\" \nBASIS and WITHOUT WARRANTY, either express or implied, including, without \nlimitation, the warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS \nFOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL \nWORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part \nof this License. No license to Original Work is granted hereunder except \nunder this disclaimer.\n\nLimitation of Liability. Under no circumstances and under no legal theory, \nwhether in tort (including negligence), contract, or otherwise, shall the \nLicensor be liable to any person for any direct, indirect, special, \nincidental, or consequential damages of any character arising as a result \nof this License or the use of the Original Work including, without \nlimitation, damages for loss of goodwill, work stoppage, computer failure \nor malfunction, or any and all other commercial damages or losses. This \nlimitation of liability shall not apply to liability for death or personal \ninjury resulting from Licensor's negligence to the extent applicable law \nprohibits such limitation. Some jurisdictions do not allow the exclusion or \nlimitation of incidental or consequential damages, so this exclusion and \nlimitation may not apply to You.\n\nLicense to Source Code. The term \"Source Code\" means the preferred form of \nthe Original Work for making modifications to it and all available \ndocumentation describing how to modify the Original Work. Licensor hereby \nagrees to provide a machine-readable copy of the Source Code of the Original \nWork along with each copy of the Original Work that Licensor distributes. \nLicensor reserves the right to satisfy this obligation by placing a \nmachine-readable copy of the Source Code in an information repository \nreasonably calculated to permit inexpensive and convenient access by You for \nas long as Licensor continues to distribute the Original Work, and by \npublishing the address of that information repository in a notice immediately \nfollowing the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate \nautomatically and You may no longer exercise any of the rights granted to You \nby this License if You file a lawsuit in any court alleging that any OSI \nCertified open source software that is licensed under any license containing \nthis \"Mutual Termination for Patent Action\" clause infringes any patent \nclaims that are essential to use that software.\n\nRight to Use. You may use the Original Work in all ways not otherwise \nrestricted or conditioned by this License or by law, and Licensor promises \nnot to interfere with or be responsible for such uses by You.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights reserved. \nPermission is hereby granted to copy and distribute this license without \nmodification. This license may not be modified without the express written \npermission of its copyright owner."
}