{
  "key": "afl-1.1",
  "short_name": "AFL 1.1",
  "name": "Academic Free License 1.1",
  "category": "Permissive",
  "owner": "Lawrence Rosen",
  "homepage_url": "https://spdx.org/licenses/AFL-1.1",
  "notes": "Per SPDX.org, this license has been superseded by later versions.",
  "spdx_license_key": "AFL-1.1",
  "text_urls": [
    "http://open2.mirrors-r-us.net/licenses/afl-1.1.txt",
    "http://opensource.linux-mirror.org/licenses/afl-1.1.txt",
    "http://spdx.org/licenses/AFL-1.1",
    "http://web.archive.org/web/20060924134536/http://www.opensource.org/licenses/afl-1.1.txt",
    "http://www.opensource.org/licenses/afl-1.1.txt"
  ],
  "osi_url": "http://web.archive.org/web/20060924134536/http://www.opensource.org/licenses/afl-1.1.txt",
  "other_urls": [
    "http://wayback.archive.org/web/20021004124254/http://www.opensource.org/licenses/academic.php",
    "http://www.gnu.org/licenses/license-list.html#AcademicFreeLicense"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2002 Lawrence E. Rosen"
  ],
  "ignorable_holders": [
    "Lawrence E. Rosen"
  ],
  "text": "Academic Free License\nVersion 1.1\n\nThe Academic Free License applies to any original work of authorship\n(the \"Original Work\") whose owner (the \"Licensor\") has placed the\nfollowing notice immediately following the copyright notice for the\nOriginal Work: \"Licensed under the Academic Free License version 1.1.\"\n\nGrant of License. Licensor hereby grants to any person obtaining a\ncopy of the Original Work (\"You\") a world-wide, royalty-free,\nnon-exclusive, perpetual, non-sublicenseable license (1) to use, copy,\nmodify, merge, publish, perform, distribute and/or sell copies of the\nOriginal Work and derivative works thereof, and (2) under patent\nclaims owned or controlled by the Licensor that are embodied in the\nOriginal Work as furnished by the Licensor, to make, use, sell and\noffer for sale the Original Work and derivative works thereof, subject\nto the following conditions.\n\nRight of Attribution. Redistributions of the Original Work must\nreproduce all copyright notices in the Original Work as furnished by\nthe Licensor, both in the Original Work itself and in any\ndocumentation and/or other materials provided with the distribution of\nthe Original Work in executable form.\n\nExclusions from License Grant. Neither the names of Licensor, nor the\nnames of any contributors to the Original Work, nor any of their\ntrademarks or service marks, may be used to endorse or promote\nproducts derived from this Original Work without express prior written\npermission of the Licensor.\n\nWARRANTY AND DISCLAIMERS. LICENSOR WARRANTS THAT THE COPYRIGHT IN AND\nTO THE ORIGINAL WORK IS OWNED BY THE LICENSOR OR THAT THE ORIGINAL\nWORK IS DISTRIBUTED BY LICENSOR UNDER A VALID CURRENT LICENSE FROM THE\nCOPYRIGHT OWNER. EXCEPT AS EXPRESSLY STATED IN THE IMMEDIATELY\nPRECEEDING SENTENCE, THE ORIGINAL WORK IS PROVIDED UNDER THIS LICENSE\nON AN \"AS IS\" BASIS, WITHOUT WARRANTY, EITHER EXPRESS OR IMPLIED,\nINCLUDING, WITHOUT LIMITATION, THE WARRANTY OF NON-INFRINGEMENT AND\nWARRANTIES THAT THE ORIGINAL WORK IS MERCHANTABLE OR FIT FOR A\nPARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL\nWORK IS WITH YOU. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL\nPART OF THIS LICENSE. NO LICENSE TO ORIGINAL WORK IS GRANTED HEREUNDER\nEXCEPT UNDER THIS DISCLAIMER.\n\nLIMITATION OF LIABILITY. UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL\nTHEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE,\nSHALL THE LICENSOR BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT,\nSPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER ARISING\nAS A RESULT OF THIS LICENSE OR THE USE OF THE ORIGINAL WORK INCLUDING,\nWITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE,\nCOMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL\nDAMAGES OR LOSSES, EVEN IF SUCH PERSON SHALL HAVE BEEN INFORMED OF THE\nPOSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT\nAPPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH\nPARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH\nLIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR\nLIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION\nAND LIMITATION MAY NOT APPLY TO YOU.\n\nLicense to Source Code. The term \"Source Code\" means the preferred\nform of the Original Work for making modifications to it and all\navailable documentation describing how to access and modify the\nOriginal Work. Licensor hereby agrees to provide a machine-readable\ncopy of the Source Code of the Original Work along with each copy of\nthe Original Work that Licensor distributes. Licensor reserves the\nright to satisfy this obligation by placing a machine-readable copy of\nthe Source Code in an information repository reasonably calculated to\npermit inexpensive and convenient access by You for as long as\nLicensor continues to distribute the Original Work, and by publishing\nthe address of that information repository in a notice immediately\nfollowing the copyright notice that applies to the Original Work.\n\nMutual Termination for Patent Action. This License shall terminate\nautomatically and You may no longer exercise any of the rights granted\nto You by this License if You file a lawsuit in any court alleging\nthat any OSI Certified open source software that is licensed under any\nlicense containing this \"Mutual Termination for Patent Action\" clause\ninfringes any patent claims that are essential to use that software.\n\nThis license is Copyright (C) 2002 Lawrence E. Rosen. All rights\nreserved. Permission is hereby granted to copy and distribute this\nlicense without modification. This license may not be modified without\nthe express written permission of its copyright owner.\n\n--\nEND OF LICENSE."
}