{
  "key": "afpl-8.0",
  "short_name": "Aladdin FPL v8",
  "name": "Aladdin Free Public License v8",
  "category": "Copyleft",
  "owner": "Aladdin Enterprises",
  "homepage_url": "http://pages.cs.wisc.edu/~ghost/doc/AFPL/6.01/Public.htm",
  "notes": "Per SPDX.org, this license was released 18 Nov 1999",
  "spdx_license_key": "Aladdin",
  "text_urls": [
    "http://pages.cs.wisc.edu/~ghost/doc/AFPL/6.01/Public.htm"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 1994, 1995, 1997, 1998, 1999 Aladdin Enterprises, Menlo Park, California, U.S.A."
  ],
  "ignorable_holders": [
    "Aladdin Enterprises, Menlo Park, California, U.S.A."
  ],
  "text": "Aladdin Free Public License\n(Version 8, November 18, 1999)\n\nCopyright (C) 1994, 1995, 1997, 1998, 1999 Aladdin Enterprises,\nMenlo Park, California, U.S.A. All rights reserved.\n\nNOTE: This License is not the same as any of the GNU Licenses published by the\nFree Software Foundation. Its terms are substantially different from those of\nthe GNU Licenses. If you are familiar with the GNU Licenses, please read this\nlicense with extra care.\n\nAladdin Enterprises hereby grants to anyone the permission to apply this License\nto their own work, as long as the entire License (including the above notices\nand this paragraph) is copied with no changes, additions, or deletions except\nfor changing the first paragraph of Section 0 to include a suitable description\nof the work to which the license is being applied and of the person or entity\nthat holds the copyright in the work, and, if the License is being applied to a\nwork created in a country other than the United States, replacing the first\nparagraph of Section 6 with an appropriate reference to the laws of the\nappropriate country.\n\n0. Subject Matter \nThis License applies to the computer program known as \"Aladdin Ghostscript.\" The\n\"Program\", below, refers to such program. The Program is a copyrighted work\nwhose copyright is held by Aladdin Enterprises (the \"Licensor\"). Please note\nthat Aladdin Ghostscript is neither the program known as \"GNU Ghostscript\" nor\nthe version of Ghostscript available for commercial licensing from Artifex\nSoftware Inc.\n\nA \"work based on the Program\" means either the Program or any derivative work of\nthe Program, as defined in the United States Copyright Act of 1976, such as a\ntranslation or a modification.\n\nBY MODIFYING OR DISTRIBUTING THE PROGRAM (OR ANY WORK BASED ON THE PROGRAM), YOU\nINDICATE YOUR ACCEPTANCE OF THIS LICENSE TO DO SO, AND ALL ITS TERMS AND\nCONDITIONS FOR COPYING, DISTRIBUTING OR MODIFYING THE PROGRAM OR WORKS BASED ON\nIT. NOTHING OTHER THAN THIS LICENSE GRANTS YOU PERMISSION TO MODIFY OR\nDISTRIBUTE THE PROGRAM OR ITS DERIVATIVE WORKS. THESE ACTIONS ARE PROHIBITED BY\nLAW. IF YOU DO NOT ACCEPT THESE TERMS AND CONDITIONS, DO NOT MODIFY OR\nDISTRIBUTE THE PROGRAM.\n\n1. Licenses.\nLicensor hereby grants you the following rights, provided that you comply with\nall of the restrictions set forth in this License and provided, further, that\nyou distribute an unmodified copy of this License with the Program:\n\n(a)\nYou may copy and distribute literal (i.e., verbatim) copies of the Program's\nsource code as you receive it throughout the world, in any medium.\n\n(b)\nYou may modify the Program, create works based on the Program and distribute\ncopies of such throughout the world, in any medium.\n\n\n2. Restrictions.\nThis license is subject to the following restrictions:\n\n(a)\nDistribution of the Program or any work based on the Program by a commercial\norganization to any third party is prohibited if any payment is made in\nconnection with such distribution, whether directly (as in payment for a copy of\nthe Program) or indirectly (as in payment for some service related to the\nProgram, or payment for some product or service that includes a copy of the\nProgram \"without charge\"; these are only examples, and not an exhaustive\nenumeration of prohibited activities). The following methods of distribution\ninvolving payment shall not in and of themselves be a violation of this\nrestriction:\n\n(i)\nPosting the Program on a public access information storage and retrieval service\nfor which a fee is received for retrieving information (such as an on-line\nservice), provided that the fee is not content-dependent (i.e., the fee would be\nthe same for retrieving the same volume of information consisting of random\ndata) and that access to the service and to the Program is available independent\nof any other product or service. An example of a service that does not fall\nunder this section is an on-line service that is operated by a company and that\nis only available to customers of that company. (This is not an exhaustive\nenumeration.)\n\n(ii)\nDistributing the Program on removable computer-readable media, provided that the\nfiles containing the Program are reproduced entirely and verbatim on such media,\nthat all information on such media be redistributable for non-commercial\npurposes without charge, and that such media are distributed by themselves\n(except for accompanying documentation) independent of any other product or\nservice. Examples of such media include CD-ROM, magnetic tape, and optical\nstorage media. (This is not intended to be an exhaustive list.) An example of a\ndistribution that does not fall under this section is a CD-ROM included in a\nbook or magazine. (This is not an exhaustive enumeration.)\n\n(b)\nActivities other than copying, distribution and modification of the Program are\nnot subject to this License and they are outside its scope. Functional use\n(running) of the Program is not restricted, and any output produced through the\nuse of the Program is subject to this license only if its contents constitute a\nwork based on the Program (independent of having been made by running the\nProgram).\n\n(c)\nYou must meet all of the following conditions with respect to any work that you\ndistribute or publish that in whole or in part contains or is derived from the\nProgram or any part thereof (\"the Work\"):\n\n(i)\nIf you have modified the Program, you must cause the Work to carry prominent\nnotices stating that you have modified the Program's files and the date of any\nchange. In each source file that you have modified, you must include a prominent\nnotice that you have modified the file, including your name, your e-mail address\n(if any), and the date and purpose of the change;\n\n(ii)\nYou must cause the Work to be licensed as a whole and at no charge to all third\nparties under the terms of this License;\n\n(iii)\nIf the Work normally reads commands interactively when run, you must cause it,\nat each time the Work commences operation, to print or display an announcement\nincluding an appropriate copyright notice and a notice that there is no warranty\n(or else, saying that you provide a warranty). Such notice must also state that\nusers may redistribute the Work only under the conditions of this License and\ntell the user how to view the copy of this License included with the Work.\n(Exceptions: if the Program is interactive but normally prints or displays such\nan announcement only at the request of a user, such as in an \"About box\", the\nWork is required to print or display the notice only under the same\ncircumstances; if the Program itself is interactive but does not normally print\nsuch an announcement, the Work is not required to print an announcement.);\n\n(iv)\nYou must accompany the Work with the complete corresponding machine-readable\nsource code, delivered on a medium customarily used for software interchange.\nThe source code for a work means the preferred form of the work for making\nmodifications to it. For an executable work, complete source code means all the\nsource code for all modules it contains, plus any associated interface\ndefinition files, plus the scripts used to control compilation and installation\nof the executable code. If you distribute with the Work any component that is\nnormally distributed (in either source or binary form) with the major components\n(compiler, kernel, and so on) of the operating system on which the executable\nruns, you must also distribute the source code of that component if you have it\nand are allowed to do so;\n\n(v)\nIf you distribute any written or printed material at all with the Work, such\nmaterial must include either a written copy of this License, or a prominent\nwritten indication that the Work is covered by this License and written\ninstructions for printing and/or displaying the copy of the License on the\ndistribution medium;\n\n(vi)\nYou may not impose any further restrictions on the recipient's exercise of the\nrights granted herein.\n\nIf distribution of executable or object code is made by offering the equivalent\nability to copy from a designated place, then offering equivalent ability to\ncopy the source code from the same place counts as distribution of the source\ncode, even though third parties are not compelled to copy the source code along\nwith the object code.\n\n3. Reservation of Rights.\nNo rights are granted to the Program except as expressly set forth herein. You\nmay not copy, modify, sublicense, or distribute the Program except as expressly\nprovided under this License. Any attempt otherwise to copy, modify, sublicense\nor distribute the Program is void, and will automatically terminate your rights\nunder this License. However, parties who have received copies, or rights, from\nyou under this License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n4. Other Restrictions.\nIf the distribution and/or use of the Program is restricted in certain countries\nfor any reason, Licensor may add an explicit geographical distribution\nlimitation excluding those countries, so that distribution is permitted only in\nor among countries not thus excluded. In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n5. Limitations.\nTHE PROGRAM IS PROVIDED TO YOU \"AS IS,\" WITHOUT WARRANTY. THERE IS NO WARRANTY\nFOR THE PROGRAM, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT OF THIRD PARTY RIGHTS. THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU\nASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL\nLICENSOR, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS\nPERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL,\nINCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE\nTHE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED\nINACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE\nPROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY\nHAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n6. General.\n\nThis License is governed by the laws of the State of California, U.S.A.,\nexcluding choice of law rules.\n\nIf any part of this License is found to be in conflict with the law, that part\nshall be interpreted in its broadest meaning consistent with the law, and no\nother parts of the License shall be affected.\n\nFor United States Government users, the Program is provided with RESTRICTED\nRIGHTS. If you are a unit or agency of the United States Government or are\nacquiring the Program for any such unit or agency, the following apply:\n\nIf the unit or agency is the Department of Defense (\"DOD\"), the Program and its\ndocumentation are classified as \"commercial computer software\" and \"commercial\ncomputer software documentation\" respectively and, pursuant to DFAR Section\n227.7202, the Government is acquiring the Program and its documentation in\naccordance with the terms of this License. If the unit or agency is other than\nDOD, the Program and its documentation are classified as \"commercial computer\nsoftware\" and \"commercial computer software documentation\" respectively and,\npursuant to FAR Section 12.212, the Government is acquiring the Program and its\ndocumentation in accordance with the terms of this License."
}