{
  "key": "agere-sla",
  "short_name": "Agere WindModem EULA",
  "name": "Agere Systems WinModem EULA",
  "category": "Proprietary Free",
  "owner": "LSI Corporation",
  "homepage_url": "http://fedoraproject.org/wiki/Licensing/Agere_LT_Modem_Driver_License",
  "spdx_license_key": "LicenseRef-scancode-agere-sla",
  "text_urls": [
    "http://fedoraproject.org/wiki/Licensing/Agere_LT_Modem_Driver_License"
  ],
  "text": "Agere Systems WinModem End User SOFTWARE LICENSE AGREEMENT\n\n\nYOU SHOULD READ THE TERMS AND CONDITIONS OF THIS AGREEMENT BEFORE \nYOU DOWNLOAD AND USE THE AGERE SYSTEMS WINMODEM LICENSED SOFTWARE.  \nONCE YOU HAVE READ THIS LICENSE AGREEMENT AND AGREE TO ITS TERMS, \nYOU MAY DOWNLOAD AND USE THE AGERE SYSTEMS WINMODEM LICENSED SOFTWARE.  \nDOWNLOADING OR USING THE AGERE SYSTEMS WINMODEM LICENSED SOFTWARE SHOWS \nYOUR ACCEPTANCE OF THE TERMS OF THIS LICENSE AGREEMENT.  \n\nThe terms and conditions of this Agreement will apply to the Agere \nSystems WinModem Software (hereafter \"Software\") supplied under this Agreement \nand any derivatives obtained therefrom, including any copy.  The term Software \nincludes programs and related documentation supplied herewith.\n\nThe following file is made available under the standard Linux license, \na copy of which may be found at .\nserial.c\nserial24.c\n \nThese additional files are not derived from any Linux open source content, \nand are subject to the following restrictions.\nltmodem.c\nlinuxif.h\nltmdmobj.o\nMakefile\nltinst\nltuninst\nreadme.txt\n\n1.0  TITLE AND LICENSE GRANT\n\n\t1.1\tThe Software is copyrighted and/or contains proprietary \n                information protected by law.  All Software and all copies \n                thereof are and will remain the sole property of Agere Systems or \n                its suppliers.  Agere Systems hereby grants you a non-exclusive right \n                to use the Software, in whatever form recorded, which is furnished to \n                you under or in contemplation of this Agreement, in an Agere Systems \n                winmodem.  Any other use of the Software or removal of the Software from \n                a country in which use is licensed shall automatically terminate this license.\n\n\t1.2\tYou agree to use your best efforts to see that any user of the Software \n                licensed hereunder complies with the terms and conditions of this Agreement.\n\n\n2.0  SOFTWARE USE\n\n\t2.1\tYou are permitted to make copies of the Software provided that any such copy \n                shall contain the same copyright notice and proprietary marking included on \n                the original Software.\n\n\t2.2\tYou agree not to merge or combine any portion of the Software with any other \n                software, other than the Linux operating system, unless expressly permitted by \n                the laws of the jurisdiction where you are located.  Any portion of the Software \n                merged or combined with the other software will continue to be the subject of the \n                terms and conditions of this Agreement and you agree to reproduce on the merged \n                or combined portion of the Software the copyright and other proprietary rights \n                notices included in the original Software.\n\n       2.3      Redistribution and Usage\n                Agere permits use and limited redistribution of this Licensed Software in source and \n                binary forms, with or without modification, subject to the following terms and conditions, \n                in addition to the terms mentioned in this agreement. \n                \n                2.3.1 \tAgere Systems reserves the right not to allow a third party to reuse or \n                        redistribute the software, at its sole discretion.\n                \n                2.3.2\tUser hereby agrees not to remove or alter any copyright, trademark, credits \n                        and other proprietary notices contained within or associated with the Licensed \n                        Software, and shall include all such unaltered copyright, trademark, credits and \n                        other proprietary notices on or in every copy of the Software.\n\n                2.3.3\tNotwithstanding any other provisions in this Agreement to the contrary, any \n                        modifications or alterations made to the Licensed Software shall cause any \n                        warranties and intellectual property indemnifications to become null and \n                        void and of no further effect.\n\n3.0  DISCLAIMER OF WARRANTY\n\n\t3.1  You understand and acknowledge that the Software may contain errors, bugs or other \n             defects.  The Software is provided on AS-IS basis, without warranty of any kind.\n\n\t3.2  Agere Systems has used reasonable efforts to minimize defects or errors in the Software.  \n             HOWEVER, YOU ASSUME THE RISK OF ANY AND ALL DAMAGE OR LOSS FROM USE OR INABILITY TO USE \n             THE SOFTWARE.  Specifically, but not in limitation of the foregoing disclaimers, Agere \n             Systems does not warrant that the functions of the Software will meet your requirements \n             or that the Software operation will be error-free or uninterrupted.\n\n\t3.3  Agere Systems bears no responsibility for supplying assistance for fixing or for \n             communicating known errors to you pertaining to the Software supplied hereunder.\n\n\t3.4  YOU UNDERSTAND THAT AGERE SYSTEMS, ITS AFFILIATES, CONTRACTORS, SUPPLIERS, AND AGENTS \n             MAKE NO WARRANTIES, EXPRESS OR IMPLIED, AND SPECIFICALLY DISCLAIM ANY WARRANTY OF \n             MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\n4.0  EXCLUSIVE REMEDIES AND LIMITATION OF LIABILITIES\n\n\t4.1  Regardless of any other provisions of this Agreement, neither Agere Systems nor its \n             affiliates, contractors, suppliers, or agents shall be liable for any indirect, incidental, \n             or consequential damages (including lost profits) sustained or incurred in connection with \n             the use, operation, or inability to use the Software or for damages due to causes beyond \n             the reasonable control of Agere Systems, its affiliates, contractors, suppliers, and agents \n             attributable to any service, products, or action of any other person.\n\n\t4.2  This Agreement shall be construed in accordance with and governed by the laws of the \n             State of New York.\n\nYOU ACKNOWLEDGE THAT YOU HAVE READ THIS AGREEMENT AND UNDERSTAND IT, AND THAT BY DOWNLOADING OR USING \nTHE SOFTWARE, YOU AGREE TO BE BOUND BY ITS TERMS AND CONDITIONS.  YOU FURTHER AGREE THAT THIS AGREEMENT \nIS THE COMPLETE AND EXCLUSIVE STATEMENT OF THE RIGHTS AND LIABILITIES OF THE PARTIES.  THIS AGREEMENT \nSUPERCEDES ALL PRIOR ORAL AGREEMENTS, PROPOSALS OR UNDERSTANDINGS, AND ANY OTHER COMMUNICATIONS BETWEEN \nUS RELATING TO THE SUBJECT MATTER OF THIS AGREEMENT."
}