{
  "key": "agere-bsd",
  "short_name": "Agere BSD",
  "name": "Agere Systems BSD Software license",
  "category": "Permissive",
  "owner": "LSI Corporation",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.agere",
  "notes": "commonly found in Linux The driver is coverred by the following copyright\nand software license. ... license text ... The following statement from\nAgere clarifies the status of the firmware. I would like to confirm that\nthe two drivers; Linux LKM Wireless Driver Source Code, Version 7.18 and\nLinux LKM Wireless Driver Source Code, Version 7.22 comply with Open Source\nBSD License. Therefore the source code can be distributed in unmodified or\nmodified form consistent with the terms of the license. The Linux driver\narchitecture was based on two modules, the MSF (Module specific functions)\nand the HCF (Hardware Control Functions). Included in the HCF is run-time\nfirmware (binary format) which is downloaded into the RAM of the Hermes\n1/2/2.5 WMAC. This hex coded firmware is not based on any open source\nsoftware and hence it is not subject to any Open Source License. The\nfirmware was developed by Agere and runs on the DISC processor embedded\nwithin the Hermes 1/2/2.5 Wireless MAC devices. Hope this helps. Sincerely,\nViren Pathare Intellectual Property Licensing Manager Agere\n",
  "spdx_license_key": "LicenseRef-scancode-agere-bsd",
  "other_urls": [
    "https://github.com/mdamt/linux-firmware/blob/bf9f8648fdf1d1d63db471554781f897d219bd62/LICENCE.agere"
  ],
  "minimum_coverage": 80,
  "text": "SOFTWARE LICENSE\n\nThis software is provided subject to the following terms and conditions,\nwhich you should read carefully before using the software.  Using this\nsoftware indicates your acceptance of these terms and conditions.  If you do\nnot agree with these terms and conditions, do not use the software.\n\nRedistribution and use in source or binary forms, with or without\nmodifications, are permitted provided that the following conditions are met:\n\n. Redistributions of source code must retain the above copyright notice, this\n   list of conditions and the following Disclaimer as comments in the code as\n   well as in the documentation and/or other materials provided with the\n   distribution.\n\n. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following Disclaimer in the documentation\n   and/or other materials provided with the distribution.\n\n. Neither the name of Agere Systems Inc. nor the names of the contributors\n   may be used to endorse or promote products derived from this software\n   without specific prior written permission.\n\nDisclaimer\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, INFRINGEMENT AND THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  ANY\nUSE, MODIFICATION OR DISTRIBUTION OF THIS SOFTWARE IS SOLELY AT THE USERS OWN\nRISK. IN NO EVENT SHALL AGERE SYSTEMS INC. OR CONTRIBUTORS BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, INCLUDING, BUT NOT LIMITED TO, CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\nOF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGE."
}