{
  "key": "agtpl",
  "short_name": "AGTPL",
  "name": "Access Grid Toolkit Public License (AGTPL)",
  "category": "Permissive",
  "owner": "University of Chicago",
  "homepage_url": "https://www.mcs.anl.gov/research/projects/accessgrid/about/license.html",
  "spdx_license_key": "LicenseRef-scancode-agtpl",
  "faq_url": "https://www.mcs.anl.gov/research/projects/accessgrid/about/faq.html",
  "ignorable_copyrights": [
    "Copyright (c) 2000-2003 University of Chicago"
  ],
  "ignorable_holders": [
    "University of Chicago"
  ],
  "ignorable_urls": [
    "http://www.accessgrid.org/"
  ],
  "text": "License\n\nAccess Grid Toolkit Public License (AGTPL)\n\nCopyright (c) 2000-2003 University of Chicago. All Rights Reserved.\n\n1) The \"Software\", below, refers to the Access Grid Toolkit (in either source-\ncode, or binary form and related documentation) and a \"work based on the\nSoftware\" means a work based on either the Software, on part of the Software, or\non any derivative work of the Software under copyright law: that is, a work\ncontaining all or a portion of the Software either verbatim or with\nmodifications. Each licensee is addressed as \"you\" or \"Licensee.\"\n\n2) The University of Chicago as Operator of Argonne National Laboratory is the\ncopyright holder in the Software. The holder reserves all rights except those\nexpressly granted to the Licensee herein and license rights held by the U.S.\nGovernment.\n\n3) A copy or copies of the Software may be given to others, if you meet the\nfollowing conditions:\n\na) Copies in source code form must include the copyright notice and this\nlicense.\n\nb) Copies in binary form must include the copyright notice and this license in\nthe documentation.\n\n4) All advertising materials, journal articles and documentation mentioning\nfeatures derived from or use of the Software must display the following\nacknowledgement:\n\n\"This product includes software developed by and/or derived from the Access\nGrid project (http://www.accessgrid.org).\"\n\nIn the event that the product being advertised includes an intact Access Grid\nToolkit distribution (with copyright and license included) then this clause is\nwaived.\n\n5) You may make modifications to the Software, however, if you modify a copy or\ncopies of the Software or any portion of it, thus forming a work based on the\nSoftware, and give a copy or copies of such work to others, either in source\ncode or binary form, you must meet the following conditions:\n\na) The Software must carry prominent notices stating that you changed portions\nof the Software.\n\nb) The Software must display the following acknowledgement:\n\n\"This product includes software developed by and/or derived from the Access\nGrid Project (http://www.accessgrid.org) to which the U.S. Government retains\ncertain rights.\"\n\n6) LICENSEE AGREES THAT THE EXPORT OF GOODS AND/OR TECHNICAL DATA FROM THE\nUNITED STATES MAY REQUIRE SOME FORM OF EXPORT CONTROL LICENSE FROM THE U.S.\nGOVERNMENT AND THAT FAILURE TO OBTAIN SUCH EXPORT CONTROL LICENSE MAY RESULT IN\nCRIMINAL LIABILITY UNDER U.S. LAWS.\n\n7) Portions of the Software resulted from work developed under a U.S. Government\ncontract and are subject to the following license: the Government is granted for\nitself and others acting on its behalf a paid-up, nonexclusive, irrevocable\nworldwide license in this computer software to reproduce, prepare derivative\nworks, and perform publicly and display publicly.\n\n8) The Software was prepared, in part, as an account of work sponsored by an\nagency of the United States Government. Neither the United States, nor the\nUniversity of Chicago, nor any contributors to the Access Grid Project or Access\nGrid Toolkit, nor any of their employees, makes any warranty express or implied,\nor assumes any legal liability or responsibility for the accuracy, completeness,\nor usefulness of any information, apparatus, product, or process disclosed, or\nrepresents that its use would not infringe privately owned rights.\n\n9) IN NO EVENT WILL THE UNITED STATES, THE UNIVERSITY OF CHICAGO OR ANY\nCONTRIBUTORS TO THE ACCESS GRID PROJECT OR ACCESS GRID TOOLKIT BE LIABLE FOR ANY\nDAMAGES, INCLUDING DIRECT, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES\nRESULTING FROM EXERCISE OF THIS LICENSE AGREEMENT OR THE USE OF THE SOFTWARE.\n\nEND OF LICENSE"
}