{
  "key": "alasir",
  "short_name": "Alasir Licence",
  "name": "The Alasir Licence",
  "category": "Proprietary Free",
  "owner": "Alasir",
  "homepage_url": "http://alasir.com/licence/TAL.txt",
  "spdx_license_key": "LicenseRef-scancode-alasir",
  "text": "The Alasir Licence\n\n    This is a free software. It's provided as-is and carries absolutely no\nwarranty or responsibility by the author and the contributors, neither in\ngeneral nor in particular. No matter if this software is able or unable to\ncause any damage to your or third party's computer hardware, software, or any\nother asset available, neither the author nor a separate contributor may be\nfound liable for any harm or its consequences resulting from either proper or\nimproper use of the software, even if advised of the possibility of certain\ninjury as such and so forth.\n\n    The software isn't a public domain, it's a copyrighted one. In no event\nshall the author's or a separate contributor's copyright be denied or violated\notherwise. No copyright may be removed unless together with the code\ncontributed to the software by a holder of the respective copyright. A\ncopyright itself indicates the rights of ownership over the code contributed.\nBack and forth, the author is defined as the one who holds the oldest\ncopyright over the software. Furthermore, the software is defined as either\nsource or binary computer code, which is organised in the form of a single\ncomputer file usually.\n\n    The software, the whole or a part of it, is prohibited from being sold or\nleased in any form or manner with the only possible exceptions:\n\na) money may be charged for a physical medium used to transfer the software;\nb) money may be charged for optional warranty or support services related to\n   the software.\n\n    Nevertheless, if the software, the whole or a part of it, is expected to\nbecome an object of sale or lease, the whole or a part of it, then a separate\nnon-exclusive licence agreement must be negotiated from the author. Benefits\naccrued should be distributed between the contributors or likewise at the\nauthor's discretion.\n\n    Whenever and wherever the software is distributed, in either source or\nbinary form, either in whole or in part, it must include the complete\nunchanged text of this licence agreement unless different conditions have been\nnegotiated. In case of a binary only distribution, the names of the copyright\nholders must be mentioned in the documentation supplied with the software.\nThis is supposed to protect rights and freedom of those who have contributed\ntheir time and labour to free software development, because otherwise the\ndevelopment itself and this licence agreement are of a very little sense.\n\n    Nothing else but this licence agreement grants you rights to use, modify\nand distribute the software. Any violation of this licence agreement is\nrecognised as an action prohibited by an applicable legislation."
}