{
  "key": "allen-institute-software-2018",
  "short_name": "Allen Institute Software License 2018",
  "name": "Allen Institute Software License 2018",
  "category": "Free Restricted",
  "owner": "Allen Institute",
  "homepage_url": "https://raw.githubusercontent.com/AllenInstitute/human_neuron_Ih/master/LICENSE.txt",
  "spdx_license_key": "LicenseRef-scancode-allen-institute-software-2018",
  "other_urls": [
    "https://github.com/AllenInstitute"
  ],
  "standard_notice": "Allen Institute Software License – This software license is the 2-clause\nBSD license plus clause a third clause that\nprohibits redistribution for commercial purposes without further\npermission.\nCopyright © 2018. Allen Institute. All rights reserved.\n",
  "ignorable_emails": [
    "terms@alleninstitute.org"
  ],
  "text": "Redistribution and use in source and binary forms, with or without modification, are permitted provided that the\nfollowing conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following\ndisclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following\ndisclaimer in the documentation and/or other materials provided with the distribution.\n\n3. Redistributions for commercial purposes are not permitted without the Allen Institute’s written permission. For\npurposes of this license, commercial purposes is the incorporation of the Allen Institute's software into anything for\nwhich you will charge fees or other compensation. Contact terms@alleninstitute.org for commercial licensing\nopportunities.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}