{
  "key": "alliance-open-media-patent-1.0",
  "short_name": "Open Media Patent 1.0",
  "name": "Alliance for Open Media Patent License 1.0",
  "category": "Patent License",
  "owner": "Alliance for Open Media",
  "homepage_url": "https://aomedia.org/license/patent-license/",
  "spdx_license_key": "LicenseRef-scancode-alliance-open-media-patent-1.0",
  "other_urls": [
    "https://aomedia.org/docs/AOM_W3C_Mode_and_the_AOM_Patent_License_1.0.pdf"
  ],
  "ignorable_urls": [
    "https://www.w3.org/Consortium/Patent-Policy-20040205/#def-essential"
  ],
  "text": "Alliance for Open Media Patent License 1.0\n\n1. License Terms.\n\n1.1. Patent License. Subject to the terms and conditions of this License, each\n     Licensor, on behalf of itself and successors in interest and assigns,\n     grants Licensee a non-sublicensable, perpetual, worldwide, non-exclusive,\n     no-charge, royalty-free, irrevocable (except as expressly stated in this\n     License) patent license to its Necessary Claims to make, use, sell, offer\n     for sale, import or distribute any Implementation.\n\n1.2. Conditions.\n\n1.2.1. Availability. As a condition to the grant of rights to Licensee to make,\n       sell, offer for sale, import or distribute an Implementation under\n       Section 1.1, Licensee must make its Necessary Claims available under\n       this License, and must reproduce this License with any Implementation\n       as follows:\n\n       a. For distribution in source code, by including this License in the\n          root directory of the source code with its Implementation.\n\n       b. For distribution in any other form (including binary, object form,\n          and/or hardware description code (e.g., HDL, RTL, Gate Level Netlist,\n          GDSII, etc.)), by including this License in the documentation, legal\n          notices, and/or other written materials provided with the\n          Implementation.\n\n1.2.2. Additional Conditions. This license is directly from Licensor to\n       Licensee.  Licensee acknowledges as a condition of benefiting from it\n       that no rights from Licensor are received from suppliers, distributors,\n       or otherwise in connection with this License.\n\n1.3. Defensive Termination. If any Licensee, its Affiliates, or its agents\n     initiates patent litigation or files, maintains, or voluntarily\n     participates in a lawsuit against another entity or any person asserting\n     that any Implementation infringes Necessary Claims, any patent licenses\n     granted under this License directly to the Licensee are immediately\n     terminated as of the date of the initiation of action unless 1) that suit\n     was in response to a corresponding suit regarding an Implementation first\n     brought against an initiating entity, or 2) that suit was brought to\n     enforce the terms of this License (including intervention in a third-party\n     action by a Licensee).\n\n1.4. Disclaimers. The Reference Implementation and Specification are provided\n     \"AS IS\" and without warranty. The entire risk as to implementing or\n     otherwise using the Reference Implementation or Specification is assumed\n     by the implementer and user. Licensor expressly disclaims any warranties\n     (express, implied, or otherwise), including implied warranties of\n     merchantability, non-infringement, fitness for a particular purpose, or\n     title, related to the material. IN NO EVENT WILL LICENSOR BE LIABLE TO\n     ANY OTHER PARTY FOR LOST PROFITS OR ANY FORM OF INDIRECT, SPECIAL,\n     INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER FROM ANY CAUSES OF\n     ACTION OF ANY KIND WITH RESPECT TO THIS LICENSE, WHETHER BASED ON BREACH\n     OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, AND WHETHER OR\n     NOT THE OTHER PARTRY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n2. Definitions.\n\n2.1. Affiliate.  \"Affiliate\" means an entity that directly or indirectly\n     Controls, is Controlled by, or is under common Control of that party.\n\n2.2. Control. \"Control\" means direct or indirect control of more than 50% of\n     the voting power to elect directors of that corporation, or for any other\n     entity, the power to direct management of such entity.\n\n2.3. Decoder.  \"Decoder\" means any decoder that conforms fully with all\n     non-optional portions of the Specification.\n\n2.4. Encoder.  \"Encoder\" means any encoder that produces a bitstream that can\n     be decoded by a Decoder only to the extent it produces such a bitstream.\n\n2.5. Final Deliverable.  \"Final Deliverable\" means the final version of a\n     deliverable approved by the Alliance for Open Media as a Final\n     Deliverable.\n\n2.6. Implementation.  \"Implementation\" means any implementation, including the\n     Reference Implementation, that is an Encoder and/or a Decoder. An\n     Implementation also includes components of an Implementation only to the\n     extent they are used as part of an Implementation.\n\n2.7. License. \"License\" means this license.\n\n2.8. Licensee. \"Licensee\" means any person or entity who exercises patent\n     rights granted under this License.\n\n2.9. Licensor.  \"Licensor\" means (i) any Licensee that makes, sells, offers\n     for sale, imports or distributes any Implementation, or (ii) a person\n     or entity that has a licensing obligation to the Implementation as a\n     result of its membership and/or participation in the Alliance for Open\n     Media working group that developed the Specification.\n\n2.10. Necessary Claims.  \"Necessary Claims\" means all claims of patents or\n      patent applications, (a) that currently or at any time in the future,\n      are owned or controlled by the Licensor, and (b) (i) would be an\n      Essential Claim as defined by the W3C Policy as of February 5, 2004\n      (https://www.w3.org/Consortium/Patent-Policy-20040205/#def-essential)\n      as if the Specification was a W3C Recommendation; or (ii) are infringed\n      by the Reference Implementation.\n\n2.11. Reference Implementation. \"Reference Implementation\" means an Encoder\n      and/or Decoder released by the Alliance for Open Media as a Final\n      Deliverable.\n\n2.12. Specification. \"Specification\" means the specification designated by\n      the Alliance for Open Media as a Final Deliverable for which this\n      License was issued."
}