{
  "key": "amd-linux-firmware-export",
  "short_name": "AMD Linux Firmware Export License",
  "name": "AMD Linux Firmware Export License",
  "category": "Proprietary Free",
  "owner": "Advanced Micro Devices",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENSE.amd-ucode",
  "spdx_license_key": "LicenseRef-scancode-amd-linux-firmware-export",
  "text_urls": [
    "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENSE.amd-sev"
  ],
  "ignorable_urls": [
    "http://www.bis.doc.gov/"
  ],
  "text": "Permission is hereby granted by Advanced Micro Devices, Inc. (\"AMD\"),\nfree of any license fees, to any person obtaining a copy of this\nmicrocode in binary form (the \"Software\") (\"You\"), to install,\nreproduce, copy and distribute copies of the Software and to permit\npersons to whom the Software is provided to do the same, subject to\nthe following terms and conditions.  Your use of any portion of the\nSoftware shall constitute Your acceptance of the following terms and\nconditions. If You do not agree to the following terms and conditions,\ndo not use, retain or redistribute any portion of the Software.\n\nIf You redistribute this Software, You must reproduce the above\ncopyright notice and this license with the Software.\nWithout specific, prior, written permission from AMD, You may not\nreference AMD or AMD products in the promotion of any product derived\nfrom or incorporating this Software in any manner that implies that\nAMD endorses or has certified such product derived from or\nincorporating this Software.\n\nYou may not reverse engineer, decompile, or disassemble this Software\nor any portion thereof.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY EXPRESS OR IMPLIED\nWARRANTY OF ANY KIND, INCLUDING BUT NOT LIMITED TO WARRANTIES OF\nMERCHANTABILITY, NONINFRINGEMENT, TITLE, FITNESS FOR ANY PARTICULAR\nPURPOSE, OR WARRANTIES ARISING FROM CONDUCT, COURSE OF DEALING, OR\nUSAGE OF TRADE. IN NO EVENT SHALL AMD OR ITS LICENSORS BE LIABLE FOR\nANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR\nLOSS OF PROFITS, BUSINESS INTERRUPTION, OR LOSS OF DATA OR\nINFORMATION) ARISING OUT OF AMD'S NEGLIGENCE, GROSS NEGLIGENCE, THE\nUSE OF OR INABILITY TO USE THE SOFTWARE, EVEN IF AMD HAS BEEN ADVISED\nOF THE POSSIBILITY OF SUCH DAMAGES. BECAUSE SOME JURISDICTIONS\nPROHIBIT THE EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR\nINCIDENTAL DAMAGES OR THE EXCLUSION OF IMPLIED WARRANTIES, THE ABOVE\nLIMITATION MAY NOT APPLY TO YOU.\n\nWithout limiting the foregoing, the Software may implement third party\ntechnologies for which You must obtain licenses from parties other\nthan AMD. You agree that AMD has not obtained or conveyed to You, and\nthat You shall be responsible for obtaining the rights to use and/or\ndistribute the applicable underlying intellectual property rights\nrelated to the third party technologies. These third party\ntechnologies are not licensed hereunder.\n\nIf You use the Software (in whole or in part), You shall adhere to all\napplicable U.S., European, and other export laws, including but not\nlimited to the U.S. Export Administration Regulations (\"EAR\"), (15\nC.F.R. Sections 730 through 774), and E.U. Council Regulation (EC) No\n1334/2000 of 22 June 2000. Further, pursuant to Section 740.6  of the\nEAR, You hereby certify that, except pursuant to a license granted by\nthe United States Department of Commerce Bureau of Industry and\nSecurity or as otherwise permitted pursuant to a License Exception\nunder the U.S. Export Administration Regulations (\"EAR\"), You will not\n(1) export, re-export or release to a national of a country in Country\nGroups D:1, E:1 or E:2 any restricted technology, software, or source\ncode You receive hereunder, or (2) export to Country Groups D:1, E:1\nor E:2 the direct product of such technology or software, if such\nforeign produced direct product is subject to national security\ncontrols as identified on the Commerce Control List (currently found\nin Supplement 1 to Part 774 of EAR). For the most current Country\nGroup listings, or for additional information about the EAR or Your\nobligations under those regulations, please refer to the U.S. Bureau\nof Industry and Security?s website at ttp://www.bis.doc.gov/."
}