{
  "key": "anepokis-1.0",
  "short_name": "Anepokis License 1.0",
  "name": "Anepokis License 1.0",
  "category": "Copyleft",
  "owner": "Salif Mehmed",
  "homepage_url": "https://github.com/salif/anepokis-license",
  "spdx_license_key": "LicenseRef-scancode-anepokis-1.0",
  "text_urls": [
    "https://salif.github.io/anepokis-license/LICENSE.txt"
  ],
  "other_urls": [
    "https://salif.github.io/anepokis-license/LICENSE.html"
  ],
  "ignorable_copyrights": [
    "Copyright 2005 Lawrence Rosen",
    "Copyright 2020 Salif Mehmed"
  ],
  "ignorable_holders": [
    "Lawrence Rosen",
    "Salif Mehmed"
  ],
  "text": "Anepokis License v. 1.0\n\nThis Anepokis License (the \"License\") applies to any original work of\nauthorship (the \"Original Work\") whose owner (the \"Licensor\") has placed\nthe following licensing notice adjacent to the copyright notice for the\nOriginal Work:\n\n        Licensed under the Anepokis License version 1.0\n\nor has expressed by any other means his willingness to license the\nOriginal Work under this License.\n\n1. Grant of Copyright License.\n\nLicensor grants You a worldwide, royalty-free, non-exclusive, sublicensable\nlicense, for the duration of the copyright, to do the following:\n\n  a) to reproduce the Original Work in copies, either alone or as part of a\n     collective work;\n\n  b) to translate, adapt, alter, transform, modify, or arrange the Original\n     Work, thereby creating derivative works (\"Derivative Works\") based upon\n     the Original Work;\n\n  c) to distribute or communicate copies of the Original Work and Derivative\n     Works to the public, with the proviso that copies of Original Work or\n     Derivative Works that You distribute or communicate shall be licensed\n     under this Anepokis License;\n\n  d) to perform the Original Work publicly; and\n\n  e) to display the Original Work publicly.\n\n2. Grant of Patent License.\n\nLicensor grants You a worldwide, royalty-free, non-exclusive, sublicensable\nlicense, under patent claims owned or controlled by the Licensor that are\nembodied in the Original Work as furnished by the Licensor, for the duration\nof the patents, to make, use, sell, offer for sale, have made, and import the\nOriginal Work and Derivative Works.\n\n3. Grant of Source Code License.\n\nThe term \"Source Code\" means the preferred form of the Original Work for making\nmodifications to it and all available documentation describing how to modify\nthe Original Work. Licensor agrees to provide a machine-readable copy of the\nSource Code of the Original Work along with each copy of the Original Work that\nLicensor distributes. Licensor reserves the right to satisfy this obligation by\nplacing a machine-readable copy of the Source Code in an information repository\nreasonably calculated to permit inexpensive and convenient access by You for as\nlong as Licensor continues to distribute the Original Work.\n\n4. Exclusions From License Grant.\n\nNeither the names of Licensor, nor the names of any contributors to the\nOriginal Work, nor any of their trademarks or service marks, may be used to\nendorse or promote products derived from this Original Work without express\nprior permission of the Licensor. Except as expressly stated herein, nothing in\nthis License grants any license to Licensor's trademarks, copyrights, patents,\ntrade secrets or any other intellectual property. No patent license is granted\nto make, use, sell, offer for sale, have made, or import embodiments of any\npatent claims other than the licensed claims defined in Section 2. No license\nis granted to the trademarks of Licensor even if such marks are included in the\nOriginal Work. Nothing in this License shall be interpreted to prohibit Licensor\nfrom licensing under terms different from this License any Original Work that\nLicensor otherwise would have a right to license.\n\n5. External Deployment.\n\nThe term \"External Deployment\" means the use, distribution, or communication of\nthe Original Work or Derivative Works in any way such that the Original Work or\nDerivative Works may be used by anyone other than You, whether those works are\ndistributed or communicated to those persons or made available as an application\nintended for use over a network. As an express condition for the grants of\nlicense hereunder, You must treat any External Deployment by You of the Original\nWork or a Derivative Work as a distribution under Section 1(c).\n\n6. Attribution Rights.\n\nYou must retain, in the Source Code of any Derivative Works that You create,\nall copyright, patent, or trademark notices from the Source Code of the\nOriginal Work, as well as any notices of licensing and any descriptive text\nidentified therein as an \"Attribution Notice.\" You must cause the Source Code\nfor any Derivative Works that You create to carry a prominent Attribution\nNotice reasonably calculated to inform recipients that You have modified the\nOriginal Work.\n\n7. Warranty of Provenance and Disclaimer of Warranty.\n\nLicensor warrants that the copyright in and to the Original Work and the\npatent rights granted herein by Licensor are owned by the Licensor or are\nsublicensed to You under the terms of this License with the permission of\nthe contributor(s) of those copyrights and patent rights. Except as expressly\nstated in the immediately preceding sentence, the Original Work is provided\nunder this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or\nimplied, including, without limitation, the warranties of non-infringement,\nmerchantability or fitness for a particular purpose. THE ENTIRE RISK AS TO THE\nQUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY\nconstitutes an essential part of this License. No license to the Original Work\nis granted by this License except under this disclaimer.\n\n8. Limitation of Liability.\n\nUnder no circumstances and under no legal theory, whether in tort (including\nnegligence), contract, or otherwise, shall the Licensor be liable to anyone for\nany indirect, special, incidental, or consequential damages of any character\narising as a result of this License or the use of the Original Work including,\nwithout limitation, damages for loss of goodwill, work stoppage, computer\nfailure or malfunction, or any and all other commercial damages or losses.\nThis limitation of liability shall not apply to the extent applicable law\nprohibits such limitation.\n\n9. Acceptance and Termination.\n\nIf, at any time, You exercise any rights granted to You by Section 1 of this\nLicense, that exercising indicates your irrevocable acceptance of this License\nand all of its terms and conditions. Nothing in this License is intended to\naffect copyright exceptions and limitations (including \"fair use\" or \"fair\ndealing\"). This License shall terminate immediately and You may no longer\nexercise any of the rights granted to You by this License upon your failure to\nhonor the conditions in Section 1(c).\n\n10. Termination for Patent Action.\n\nThis License shall terminate automatically and You may no longer exercise any\nof the rights granted to You by this License as of the date You commence an\naction, including a cross-claim or counterclaim, against Licensor or any\nlicensee alleging that the Original Work infringes a patent. This termination\nprovision shall not apply for an action alleging patent infringement by\ncombinations of the Original Work with other software or hardware.\n\n11. Jurisdiction, Venue and Governing Law.\n\nAny action or suit relating to this License may be brought only in the courts\nof a jurisdiction wherein the Licensor resides or in which Licensor conducts\nits primary business, and under the laws of that jurisdiction excluding its\nconflict-of-law provisions. The application of the United Nations Convention on\nContracts for the International Sale of Goods is expressly excluded. Any use of\nthe Original Work outside the scope of this License or after its termination\nshall be subject to the requirements and penalties of copyright or patent law\nin the appropriate jurisdiction. This section shall survive the termination of\nthis License.\n\n12. Attorneys' Fees.\n\nIn any action to enforce the terms of this License or seeking damages relating\nthereto, the prevailing party shall be entitled to recover its costs and\nexpenses, including, without limitation, reasonable attorneys' fees and costs\nincurred in connection with such action, including any appeal of such action.\nThis section shall survive the termination of this License.\n\n13. Miscellaneous.\n\nIf any provision of this License is held to be unenforceable, such provision\nshall be reformed only to the extent necessary to make it enforceable.\n\n14. Definition of \"You\" in This License.\n\n\"You\" throughout this License, whether in upper or lower case, means an\nindividual or a legal entity exercising rights under, and complying with all of\nthe terms of, this License. For legal entities, \"You\" includes any entity that\ncontrols, is controlled by, or is under common control with you. For purposes\nof this definition, \"control\" means (i) the power, direct or indirect, to cause\nthe direction or management of such entity, whether by contract or otherwise,\nor (ii) ownership of fifty percent (50%) or more of the outstanding shares,\nor (iii) beneficial ownership of such entity.\n\n15. Right to Use.\n\nYou may use the Original Work in all ways not otherwise restricted or\nconditioned by this License or by law, and Licensor promises not to interfere\nwith or be responsible for such uses by You.\n\n16. Modification of This License.\n\nThis License is Copyright 2005 Lawrence Rosen, Copyright 2020 Salif Mehmed.\nPermission is granted to copy, distribute, or communicate this License without\nmodification. Nothing in this License permits You to modify this License as\napplied to the Original Work or to Derivative Works. However, You may modify\nthe text of this License and copy, distribute or communicate your modified\nversion (the \"Modified License\") and apply it to other original works of\nauthorship subject to the following conditions: (i) You may not indicate in\nany way that your Modified License is the \"Anepokis License\" and you may not\nuse this name in the name of your Modified License; (ii) You must replace\nthe notice specified in the first paragraph above with the notice \"Licensed\nunder <insert your license name here>\" or with a notice of your own that is not\nconfusingly similar to the notice in this License; and (iii) You may not claim\nthat your original works are open source software unless your Modified License\nhas been approved by Open Source Initiative (OSI) and You comply with its\nlicense review and certification process."
}