{
  "key": "apache-due-credit",
  "is_deprecated": true,
  "short_name": "Apache Due Credit Variant",
  "name": "Apache Due Credit Variant",
  "category": "Permissive",
  "owner": "Codehaus",
  "notes": "replaced by dom4j",
  "other_urls": [
    "http://openorb.sourceforge.net/license.txt",
    "http://opensource.dell.com/releases/Dell_Active_System_Manager/1.0.0/license_text/DOM4J-2005-BSD-Style.pdf",
    "http://www.oracle.com/technetwork/java/javaee/portalpack2-149804.txt",
    "https://confluence.sakaiproject.org/plugins/viewsource/viewpagesrc.action?pageId=28442642",
    "https://fedoraproject.org/wiki/Licensing:BSD?rd=Licensing/BSD#jCharts_Variant"
  ],
  "text": "Redistribution and use of this software and associated documentation\n(\"Software\"), with or without modification, are permitted provided that the\nfollowing conditions are met:\n\n1. Redistributions of source code must retain copyright statements and\nnotices. Redistributions must also contain a copy of this document.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation\nand/or other materials provided with the distribution.\n\n3. The name \"Author\" must not be used to endorse or promote products derived\nfrom this Software without prior written permission of Author. For\nwritten permission, please contact Author.\n\n4. Products derived from this Software may not be called \"Product\" nor may\n\"Author\" appear in their names without prior written permission of Author.\nProduct is a registered trademark of Author.\n\n5. Due credit should be given to Author.\n\nTHIS SOFTWARE IS PROVIDED BY AUTHOR AND CONTRIBUTORS ''AS IS'' AND\nANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED.\n\nIN NO EVENT SHALL AUTHOR OR ITS CONTRIBUTORS BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}