{
  "key": "apple-excl",
  "short_name": "Apple Example Code License",
  "name": "Apple Example Code License",
  "category": "Permissive",
  "owner": "Apple",
  "spdx_license_key": "LicenseRef-scancode-apple-excl",
  "text": "Disclaimer: IMPORTANT:  This Apple software is supplied to you by Apple Inc.\n(\"Apple\") in consideration of your agreement to the following terms, and your\nuse, installation, modification or redistribution of this Apple software\nconstitutes acceptance of these terms.  If you do not agree with these terms,\nplease do not use, install, modify or redistribute this Apple software.\n\nIn consideration of your agreement to abide by the following terms, and subject\nto these terms, Apple grants you a personal, non-exclusive license, under\nApple's copyrights in this original Apple software (the \"Apple Software\"), to\nuse, reproduce, modify and redistribute the Apple Software, with or without\nmodifications, in source and/or binary forms; provided that if you redistribute\nthe Apple Software in its entirety and without modifications, you must retain\nthis notice and the following text and disclaimers in all such redistributions\nof the Apple Software.\n\nNeither the name, trademarks, service marks or logos of Apple Inc. may be used\nto endorse or promote products derived from the Apple Software without specific\nprior written permission from Apple.  Except as expressly stated in this notice,\nno other rights or licenses, express or implied, are granted by Apple herein,\nincluding but not limited to any patent rights that may be infringed by your\nderivative works or by other works in which the Apple Software may be\nincorporated.\n\nThe Apple Software is provided by Apple on an \"AS IS\" basis.  APPLE MAKES NO\nWARRANTIES, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION THE IMPLIED\nWARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE, REGARDING THE APPLE SOFTWARE OR ITS USE AND OPERATION ALONE OR IN\nCOMBINATION WITH YOUR PRODUCTS.\n\nIN NO EVENT SHALL APPLE BE LIABLE FOR ANY SPECIAL, INDIRECT, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nARISING IN ANY WAY OUT OF THE USE, REPRODUCTION, MODIFICATION AND/OR\nDISTRIBUTION OF THE APPLE SOFTWARE, HOWEVER CAUSED AND WHETHER UNDER THEORY OF\nCONTRACT, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, EVEN IF\nAPPLE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}