{
  "key": "apsl-1.0",
  "short_name": "APSL 1.0",
  "name": "Apple Public Source License 1.0",
  "category": "Copyleft Limited",
  "owner": "Apple",
  "homepage_url": "http://www.opensource.apple.com/source/architecture/architecture-229/APPLE_LICENSE?f=text",
  "notes": "Per SPDX.org, this license was released 16 March 1999.",
  "spdx_license_key": "APSL-1.0",
  "text_urls": [
    "http://www.opensource.apple.com/source/architecture/architecture-229/APPLE_LICENSE?f=text"
  ],
  "other_urls": [
    "https://fedoraproject.org/wiki/Licensing/Apple_Public_Source_License_1.0"
  ],
  "ignorable_copyrights": [
    "Portions Copyright (c) 1999 Apple Computer, Inc."
  ],
  "ignorable_holders": [
    "Apple Computer, Inc."
  ],
  "ignorable_urls": [
    "http://www.apple.com/legal/guidelinesfor3rdparties.html",
    "http://www.apple.com/publicsource",
    "http://www.apple.com/publicsource/modifications.html"
  ],
  "text": "APPLE PUBLIC SOURCE LICENSE\n\t\t     Version 1.0 - March 16, 1999\n\nPlease read this License carefully before downloading this software.\nBy downloading and using this software, you are agreeing to be bound\nby the terms of this License.  If you do not or cannot agree to the\nterms of this License, please do not download or use the software.\n\n1. General; Definitions.  This License applies to any program or other\n  work which Apple Computer, Inc. (\"Apple\") publicly announces as\n  subject to this Apple Public Source License and which contains a\n  notice placed by Apple identifying such program or work as \"Original\n  Code\" and stating that it is subject to the terms of this Apple\n  Public Source License version 1.0 (or subsequent version thereof),\n  as it may be revised from time to time by Apple (\"License\").  As\n  used in this License:\n\n1.1 \"Applicable Patents\" mean: (a) in the case where Apple is the\n  grantor of rights, (i) patents or patent applications that are now\n  or hereafter acquired, owned by or assigned to Apple and (ii) whose\n  claims cover subject matter contained in the Original Code, but only\n  to the extent necessary to use, reproduce and/or distribute the\n  Original Code without infringement; and (b) in the case where You\n  are the grantor of rights, (i) patents and patent applications that\n  are now or hereafter acquired, owned by or assigned to You and (ii)\n  whose claims cover subject matter in Your Modifications, taken alone\n  or in combination with Original Code.\n\n1.2 \"Covered Code\" means the Original Code, Modifications, the\n  combination of Original Code and any Modifications, and/or any\n  respective portions thereof.\n\n1.3 \"Deploy\" means to use, sublicense or distribute Covered Code other\n  than for Your internal research and development (R&D), and includes\n  without limitation, any and all internal use or distribution of\n  Covered Code within Your business or organization except for R&D\n  use, as well as direct or indirect sublicensing or distribution of\n  Covered Code by You to any third party in any form or manner.\n\n1.4 \"Larger Work\" means a work which combines Covered Code or portions\n  thereof with code not governed by the terms of this License.\n\n1.5 \"Modifications\" mean any addition to, deletion from, and/or change\n  to, the substance and/or structure of Covered Code.  When code is\n  released as a series of files, a Modification is: (a) any addition\n  to or deletion from the contents of a file containing Covered Code;\n  and/or (b) any new file or other representation of computer program\n  statements that contains any part of Covered Code.\n\n1.6 \"Original Code\" means the Source Code of a program or other work\n  as originally made available by Apple under this License, including\n  the Source Code of any updates or upgrades to such programs or works\n  made available by Apple under this License, and that has been\n  expressly identified by Apple as such in the header file(s) of such\n  work.\n\n1.7 \"Source Code\" means the human readable form of a program or other\n  work that is suitable for making modifications to it, including all\n  modules it contains, plus any associated interface definition files,\n  scripts used to control compilation and installation of an\n  executable (object code).\n\n1.8 \"You\" or \"Your\" means an individual or a legal entity exercising\n  rights under this License.  For legal entities, \"You\" or \"Your\"\n  includes any entity which controls, is controlled by, or is under\n  common control with, You, where \"control\" means (a) the power,\n  direct or indirect, to cause the direction or management of such\n  entity, whether by contract or otherwise, or (b) ownership of fifty\n  percent (50%) or more of the outstanding shares or beneficial\n  ownership of such entity.\n\n2. Permitted Uses; Conditions & Restrictions.  Subject to the terms\n  and conditions of this License, Apple hereby grants You, effective\n  on the date You accept this License and download the Original Code,\n  a world-wide, royalty-free, non-exclusive license, to the extent of\n  Apple's Applicable Patents and copyrights covering the Original\n  Code, to do the following:\n\n2.1 You may use, copy, modify and distribute Original Code, with or\n  without Modifications, solely for Your internal research and\n  development, provided that You must in each instance:\n\n(a) retain and reproduce in all copies of Original Code the copyright\nand other proprietary notices and disclaimers of Apple as they appear\nin the Original Code, and keep intact all notices in the Original Code\nthat refer to this License;\n\n(b) include a copy of this License with every copy of Source Code of\nCovered Code and documentation You distribute, and You may not offer\nor impose any terms on such Source Code that alter or restrict this\nLicense or the recipients' rights hereunder, except as permitted under\nSection 6; and\n\n(c) completely and accurately document all Modifications that you have\nmade and the date of each such Modification, designate the version of\nthe Original Code you used, prominently include a file carrying such\ninformation with the Modifications, and duplicate the notice in\nExhibit A in each file of the Source Code of all such Modifications.\n\n2.2 You may Deploy Covered Code, provided that You must in each\n  instance:\n\n(a) satisfy all the conditions of Section 2.1 with respect to the\nSource Code of the Covered Code;\n\n(b) make all Your Deployed Modifications publicly available in Source\nCode form via electronic distribution (e.g. download from a web site)\nunder the terms of this License and subject to the license grants set\nforth in Section 3 below, and any additional terms You may choose to\noffer under Section 6.  You must continue to make the Source Code of\nYour Deployed Modifications available for as long as you Deploy the\nCovered Code or twelve (12) months from the date of initial\nDeployment, whichever is longer;\n\n(c) must notify Apple and other third parties of how to obtain Your\nDeployed Modifications by filling out and submitting the required\ninformation found at\nhttp://www.apple.com/publicsource/modifications.html; and\n\n(d) if you Deploy Covered Code in object code, executable form only,\ninclude a prominent notice, in the code itself as well as in related\ndocumentation, stating that Source Code of the Covered Code is\navailable under the terms of this License with information on how and\nwhere to obtain such Source Code.\n\n3. Your Grants.  In consideration of, and as a condition to, the\n  licenses granted to You under this License:\n\n(a) You hereby grant to Apple and all third parties a non-exclusive,\nroyalty-free license, under Your Applicable Patents and other\nintellectual property rights owned or controlled by You, to use,\nreproduce, modify, distribute and Deploy Your Modifications of the\nsame scope and extent as Apple's licenses under Sections 2.1 and 2.2;\nand\n\n(b) You hereby grant to Apple and its subsidiaries a non-exclusive,\nworldwide, royalty-free, perpetual and irrevocable license, under Your\nApplicable Patents and other intellectual property rights owned or\ncontrolled by You, to use, reproduce, execute, compile, display,\nperform, modify or have modified (for Apple and/or its subsidiaries),\nsublicense and distribute Your Modifications, in any form, through\nmultiple tiers of distribution.\n\n4. Larger Works.  You may create a Larger Work by combining Covered\n  Code with other code not governed by the terms of this License and\n  distribute the Larger Work as a single product.  In each such\n  instance, You must make sure the requirements of this License are\n  fulfilled for the Covered Code or any portion thereof.\n\n5. Limitations on Patent License.  Except as expressly stated in\n  Section 2, no other patent rights, express or implied, are granted\n  by Apple herein.  Modifications and/or Larger Works may require\n  additional patent licenses from Apple which Apple may grant in its\n  sole discretion.\n\n6. Additional Terms.  You may choose to offer, and to charge a fee\n  for, warranty, support, indemnity or liability obligations and/or\n  other rights consistent with the scope of the license granted herein\n  (\"Additional Terms\") to one or more recipients of Covered\n  Code. However, You may do so only on Your own behalf and as Your\n  sole responsibility, and not on behalf of Apple. You must obtain the\n  recipient's agreement that any such Additional Terms are offered by\n  You alone, and You hereby agree to indemnify, defend and hold Apple\n  harmless for any liability incurred by or claims asserted against\n  Apple by reason of any such Additional Terms.\n\n7. Versions of the License.  Apple may publish revised and/or new\n  versions of this License from time to time.  Each version will be\n  given a distinguishing version number.  Once Original Code has been\n  published under a particular version of this License, You may\n  continue to use it under the terms of that version. You may also\n  choose to use such Original Code under the terms of any subsequent\n  version of this License published by Apple.  No one other than Apple\n  has the right to modify the terms applicable to Covered Code created\n  under this License.\n\n8. NO WARRANTY OR SUPPORT.  The Original Code may contain in whole or\n  in part pre-release, untested, or not fully tested works.  The\n  Original Code may contain errors that could cause failures or loss\n  of data, and may be incomplete or contain inaccuracies.  You\n  expressly acknowledge and agree that use of the Original Code, or\n  any portion thereof, is at Your sole and entire risk.  THE ORIGINAL\n  CODE IS PROVIDED \"AS IS\" AND WITHOUT WARRANTY, UPGRADES OR SUPPORT\n  OF ANY KIND AND APPLE AND APPLE'S LICENSOR(S) (FOR THE PURPOSES OF\n  SECTIONS 8 AND 9, APPLE AND APPLE'S LICENSOR(S) ARE COLLECTIVELY\n  REFERRED TO AS \"APPLE\") EXPRESSLY DISCLAIM ALL WARRANTIES AND/OR\n  CONDITIONS, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE\n  IMPLIED WARRANTIES AND/OR CONDITIONS OF MERCHANTABILITY OR\n  SATISFACTORY QUALITY AND FITNESS FOR A PARTICULAR PURPOSE AND\n  NONINFRINGEMENT OF THIRD PARTY RIGHTS.  APPLE DOES NOT WARRANT THAT\n  THE FUNCTIONS CONTAINED IN THE ORIGINAL CODE WILL MEET YOUR\n  REQUIREMENTS, OR THAT THE OPERATION OF THE ORIGINAL CODE WILL BE\n  UNINTERRUPTED OR ERROR-FREE, OR THAT DEFECTS IN THE ORIGINAL CODE\n  WILL BE CORRECTED.  NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN\n  BY APPLE OR AN APPLE AUTHORIZED REPRESENTATIVE SHALL CREATE A\n  WARRANTY OR IN ANY WAY INCREASE THE SCOPE OF THIS WARRANTY.  You\n  acknowledge that the Original Code is not intended for use in the\n  operation of nuclear facilities, aircraft navigation, communication\n  systems, or air traffic control machines in which case the failure\n  of the Original Code could lead to death, personal injury, or severe\n  physical or environmental damage.\n\n9. Liability.\n\n9.1 Infringement.  If any of the Original Code becomes the subject of\n  a claim of infringement (\"Affected Original Code\"), Apple may, at\n  its sole discretion and option: (a) attempt to procure the rights\n  necessary for You to continue using the Affected Original Code; (b)\n  modify the Affected Original Code so that it is no longer\n  infringing; or (c) terminate Your rights to use the Affected\n  Original Code, effective immediately upon Apple's posting of a\n  notice to such effect on the Apple web site that is used for\n  implementation of this License.\n\n9.2 LIMITATION OF LIABILITY.  UNDER NO CIRCUMSTANCES SHALL APPLE BE\n  LIABLE FOR ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL\n  DAMAGES ARISING OUT OF OR RELATING TO THIS LICENSE OR YOUR USE OR\n  INABILITY TO USE THE ORIGINAL CODE, OR ANY PORTION THEREOF, WHETHER\n  UNDER A THEORY OF CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE),\n  PRODUCTS LIABILITY OR OTHERWISE, EVEN IF APPLE HAS BEEN ADVISED OF\n  THE POSSIBILITY OF SUCH DAMAGES AND NOTWITHSTANDING THE FAILURE OF\n  ESSENTIAL PURPOSE OF ANY REMEDY.  In no event shall Apple's total\n  liability to You for all damages under this License exceed the\n  amount of fifty dollars ($50.00).\n\n10. Trademarks.  This License does not grant any rights to use the\n   trademarks or trade names \"Apple\", \"Apple Computer\", \"Mac OS X\",\n   \"Mac OS X Server\" or any other trademarks or trade names belonging\n   to Apple (collectively \"Apple Marks\") and no Apple Marks may be\n   used to endorse or promote products derived from the Original Code\n   other than as permitted by and in strict compliance at all times\n   with Apple's third party trademark usage guidelines which are\n   posted at http://www.apple.com/legal/guidelinesfor3rdparties.html.\n\n11. Ownership.  Apple retains all rights, title and interest in and to\n   the Original Code and any Modifications made by or on behalf of\n   Apple (\"Apple Modifications\"), and such Apple Modifications will\n   not be automatically subject to this License.  Apple may, at its\n   sole discretion, choose to license such Apple Modifications under\n   this License, or on different terms from those contained in this\n   License or may choose not to license them at all.  Apple's\n   development, use, reproduction, modification, sublicensing and\n   distribution of Covered Code will not be subject to this License.\n\n12. Termination.\n\n12.1 Termination.  This License and the rights granted hereunder will\n   terminate:\n\n(a) automatically without notice from Apple if You fail to comply with\nany term(s) of this License and fail to cure such breach within 30\ndays of becoming aware of such breach; (b) immediately in the event of\nthe circumstances described in Sections 9.1 and/or 13.6(b); or (c)\nautomatically without notice from Apple if You, at any time during the\nterm of this License, commence an action for patent infringement\nagainst Apple.\n\n12.2 Effect of Termination.  Upon termination, You agree to\n   immediately stop any further use, reproduction, modification and\n   distribution of the Covered Code, or Affected Original Code in the\n   case of termination under Section 9.1, and to destroy all copies of\n   the Covered Code or Affected Original Code (in the case of\n   termination under Section 9.1) that are in your possession or\n   control.  All sublicenses to the Covered Code which have been\n   properly granted prior to termination shall survive any termination\n   of this License.  Provisions which, by their nature, should remain\n   in effect beyond the termination of this License shall survive,\n   including but not limited to Sections 3, 5, 8, 9, 10, 11, 12.2 and\n   13.  Neither party will be liable to the other for compensation,\n   indemnity or damages of any sort solely as a result of terminating\n   this License in accordance with its terms, and termination of this\n   License will be without prejudice to any other right or remedy of\n   either party.\n\n13.  Miscellaneous.\n\n13.1 Export Law Assurances.  You may not use or otherwise export or\n   re-export the Original Code except as authorized by United States\n   law and the laws of the jurisdiction in which the Original Code was\n   obtained.  In particular, but without limitation, the Original Code\n   may not be exported or re-exported (a) into (or to a national or\n   resident of) any U.S. embargoed country or (b) to anyone on the\n   U.S. Treasury Department's list of Specially Designated Nationals\n   or the U.S. Department of Commerce's Table of Denial Orders.  By\n   using the Original Code, You represent and warrant that You are not\n   located in, under control of, or a national or resident of any such\n   country or on any such list.\n\n13.2 Government End Users.  The Covered Code is a \"commercial item\" as\n   defined in FAR 2.101.  Government software and technical data\n   rights in the Covered Code include only those rights customarily\n   provided to the public as defined in this License. This customary\n   commercial license in technical data and software is provided in\n   accordance with FAR 12.211 (Technical Data) and 12.212 (Computer\n   Software) and, for Department of Defense purchases, DFAR\n   252.227-7015 (Technical Data -- Commercial Items) and 227.7202-3\n   (Rights in Commercial Computer Software or Computer Software\n   Documentation).  Accordingly, all U.S. Government End Users acquire\n   Covered Code with only those rights set forth herein.\n\n13.3 Relationship of Parties.  This License will not be construed as\n   creating an agency, partnership, joint venture or any other form of\n   legal association between You and Apple, and You will not represent\n   to the contrary, whether expressly, by implication, appearance or\n   otherwise.\n\n13.4 Independent Development.  Nothing in this License will impair\n   Apple's right to acquire, license, develop, have others develop for\n   it, market and/or distribute technology or products that perform\n   the same or similar functions as, or otherwise compete with,\n   Modifications, Larger Works, technology or products that You may\n   develop, produce, market or distribute.\n\n13.5 Waiver; Construction.  Failure by Apple to enforce any provision\n   of this License will not be deemed a waiver of future enforcement\n   of that or any other provision.  Any law or regulation which\n   provides that the language of a contract shall be construed against\n   the drafter will not apply to this License.\n\n13.6 Severability.  (a) If for any reason a court of competent\n   jurisdiction finds any provision of this License, or portion\n   thereof, to be unenforceable, that provision of the License will be\n   enforced to the maximum extent permissible so as to effect the\n   economic benefits and intent of the parties, and the remainder of\n   this License will continue in full force and effect.  (b)\n   Notwithstanding the foregoing, if applicable law prohibits or\n   restricts You from fully and/or specifically complying with\n   Sections 2 and/or 3 or prevents the enforceability of either of\n   those Sections, this License will immediately terminate and You\n   must immediately discontinue any use of the Covered Code and\n   destroy all copies of it that are in your possession or control.\n\n13.7 Dispute Resolution.  Any litigation or other dispute resolution\n   between You and Apple relating to this License shall take place in\n   the Northern District of California, and You and Apple hereby\n   consent to the personal jurisdiction of, and venue in, the state\n   and federal courts within that District with respect to this\n   License. The application of the United Nations Convention on\n   Contracts for the International Sale of Goods is expressly\n   excluded.\n\n13.8 Entire Agreement; Governing Law.  This License constitutes the\n   entire agreement between the parties with respect to the subject\n   matter hereof.  This License shall be governed by the laws of the\n   United States and the State of California, except that body of\n   California law concerning conflicts of law.\n\nWhere You are located in the province of Quebec, Canada, the following\nclause applies: The parties hereby confirm that they have requested\nthat this License and all related documents be drafted in English. Les\nparties ont exige que le present contrat et tous les documents\nconnexes soient rediges en anglais.\n\nEXHIBIT A. \n\n\"Portions Copyright (c) 1999 Apple Computer, Inc.  All Rights\nReserved.  This file contains Original Code and/or Modifications of\nOriginal Code as defined in and that are subject to the Apple Public\nSource License Version 1.0 (the 'License').  You may not use this file\nexcept in compliance with the License.  Please obtain a copy of the\nLicense at http://www.apple.com/publicsource and read it before using\nthis file.\n\nThe Original Code and all software distributed under the License are\ndistributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER\nEXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,\nINCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the\nLicense for the specific language governing rights and limitations\nunder the License.\""
}