{
  "key": "array-input-method-pl",
  "short_name": "Array Input Method Public License",
  "name": "Array Input Method Public License",
  "category": "Permissive",
  "owner": "Ming-Te Liao",
  "homepage_url": "https://fedoraproject.org/wiki/Licensing/Array",
  "spdx_license_key": "LicenseRef-scancode-array-input-method-pl",
  "faq_url": "https://fedoraproject.org/wiki/Licensing/Array#License_Notes",
  "ignorable_copyrights": [
    "copyright holder of Array Input Method"
  ],
  "ignorable_holders": [
    "Array Input Method"
  ],
  "ignorable_authors": [
    "Array Input"
  ],
  "text": "Array Input Method Public License\n\n1. OBJECTS\n\n Specification, design, and user interaction behavior designed for Array\n Input Method.\n All mapping tables and related information for Array Input Method.\n\n2. GRANTING\n\n License is granted, free of charge, to everyone if the conditions described\n in PERMISSION AND RESPONSIBILITY are met.\n\n3. PERMISSION AND RESPONSIBILITY\n\n A. Permission:\n\n 1. Grant of copyright license\n\n Subject to the terms and conditions of this License, every one is\n granted a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\n irrevocable copyright license to reproduce, prepare Derivative Works\n of, publicly display, publicly perform, sub-license, and distribute the\n Work and such Derivative Works\n\n 2. Grant of patent license\n\n No patent is issued for Array Input Method.\n And the inventor will never claim patents for Array Input Method.\n\n B. Responsibility:\n\n 1. While distributing the Array Input Method or derivative works\n thereof, Licensee may choose to offer, and charge a fee for, acceptance\n of support, warranty, indemnity, or other liability obligations and/or\n rights consistent with this License. However, in accepting such\n obligations, Licensee may act only on his own behalf and on his sole\n responsibility, not on behalf of the licensor, and only if Licensee\n agrees to indemnify, defend, and hold the licensor harmless for any\n liability incurred by, or claims asserted against, the licensor by\n reason of Licensee's accepting any such warranty or additional liability.\n\n4. CLAIM FROM LICENSOR\n\n This license is issued by the original inventor and copyright holder of\n Array Input Method, who owns the full and original rights to the Array\n Input Method.\n\n This license is the formal license for Array Input Method. A licensee does\n not need to request additional license documentation from the licensor.\n\nISSUED DATE: 2010/11/24\nBY LICENSOR: Inventor of Array Input Method, Ming-Te Liao, 廖明德\n\nREVISE DATE: 2011/12/20\nDelete clause 3-B-2. “…the licensee must inform the original author of Array Input Method…”\n\nREVISE DATE: 2013/07/05\nReplaced B-1, Due to some vague wording problem in this section, replace \"hold\neveryone else harmless”with “hold the licensor harmless” etc. , the original text was :\n“1. Licensee may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity,\nor other liability obligations and/or rights consistent with this License. However, in accepting such\nobligations, licensee may act only on his own behalf and on his sole responsibility, not on behalf of\nanyone else, and only if the licensee agrees toindemnify, defend, and hold everyone else harmless\nfor any liability incurred by, or claims asserted against, such everyone else by reason of licensee's\naccepting any such warranty or additional liability."
}