{
  "key": "asn1cc-exception-gpl-2.0",
  "short_name": "ASN1SCC Exception to GPL-2.0",
  "name": "ASN1SCC Exception to GPL-2.0",
  "category": "Copyleft Limited",
  "owner": "ESA",
  "homepage_url": "https://github.com/esa/asn1scc/blob/master/LICENSE.txt",
  "is_exception": true,
  "spdx_license_key": "LicenseRef-scancode-asn1cc-exception-gpl-2.0",
  "text": "ASN1SCC LICENCE\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\nThis tool (ASN1SCC) is free software; you can redistribute it and/or modify it\nunder the terms of the GNU General Public Licence as published by\nthe Free Software Foundation; either version 2 of the License, or (at your\noption) any later version.\n\nThis tool is distributed in the hope that it will be useful, but WITHOUT\nANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\nFITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public\nLicence for more details.\n\nYou should have received a copy of the GNU General Public Licence\nalong with this software.  If not,\nwrite to the Free Software Foundation, Inc., 51 Franklin Street, Fifth\nFloor, Boston, MA 02110-1301 USA.\n\nEXCEPTION NOTICE\n\n1. As a special exception, the copyright holders of this tool give\npermission for additional uses of the text contained in this release of the\ntool as licensed under the ASN1SCC License.\n\n2. The exception is that you may use, copy, link, modify and distribute\nunder your own terms, binary object code versions of works based on the\ntool Run-time Libraries as well as code automatically generated by the tool.\n\n3. If you copy code from files distributed under the terms of the GNU\nGeneral Public License into a copy of this tool, as this license permits,\nthe exception does not apply to the code that you add in this way.\nTo avoid misleading anyone as to the status of such modified files,\nyou must delete this exception notice from such code and/or adjust the\nlicensing conditions notice accordingly.\n\n4. If you write modifications of your own for this library, it is your\nchoice whether to permit this exception to apply to your modifications.  If\nyou do not wish that, you must delete the exception notice from such code\nand/or adjust the licensing conditions notice accordingly."
}