{
  "key": "ati-eula",
  "short_name": "ATI Software EULA",
  "name": "ATI Software End User License Agreement",
  "category": "Proprietary Free",
  "owner": "Advanced Micro Devices",
  "homepage_url": "http://www.amd.com/us/pages/amdhomepage.aspx",
  "spdx_license_key": "LicenseRef-scancode-ati-eula",
  "text_urls": [
    "http://www.amd.com/us/pages/amdhomepage.aspx"
  ],
  "text": "ATI Software End User License Agreement\n\nPLEASE  READ  THIS  LICENSE  CAREFULLY  BEFORE  USING   THE   SOFTWARE.   BY\nDOWNLOADING, INSTALLING, COPYING OR USING THE SOFTWARE, YOU ARE AGREEING  TO\nBE BOUND BY THE TERMS OF THIS LICENSE.  IF YOU ARE  ACCESSING  THE  SOFTWARE\nELECTRONICALLY,  SIGNIFY  YOUR  AGREEMENT  BY  CLICKING  THE  \"AGREE/ACCEPT\"\nBUTTON.  IF YOU DO NOT AGREE TO THE TERMS OF THIS LICENSE,  PROMPTLY  RETURN\nTHE SOFTWARE TO THE PLACE WHERE YOU OBTAINED IT  AND  (IF  APPLICABLE)  YOUR\nMONEY WILL BE REFUNDED OR IF THE SOFTWARE WAS ACCESSED ELECTRONICALLY  CLICK\n\"DISAGREE/DECLINE\".\n\n1. License.  ATI Technologies Inc., on behalf of  itself,  its  subsidiaries\nand licensors (referred collectively as \"ATI\") grants to you  the  following\nnon-exclusive,  right  to  use  the  software  accompanying   this   License\n(hereinafter \"Software\") subject to the following terms and limitations:\n\n(a)   Regardless of the media upon which it is distributed, the Software  is\nlicensed to you for use solely in conjunction with ATI hardware products  to\nwhich the Software relates (\"ATI Hardware\").\n\n(b)   You own the medium on which the Software is recorded, but ATI and,  if\napplicable,  its  licensors  retain  title  to  the  Software  and   related\ndocumentation.\n\n(c)   You may:\n\n  i) use the Software solely in  connection  with  the  ATI  Hardware  on  a\n   single computer;\n\n  ii) make one copy of the Software  in  machine-readable  form  for  backup\n   purposes only. You must reproduce on such copy ATI's copyright notice and\n   any other proprietary legends that were  on  the  original  copy  of  the\n   Software;\n\n  iii) transfer all your license rights in the Software  provided  you  must\n   also transfer a copy of this License, the backup copy  of  the  Software,\n   the ATI Hardware and the related documentation  and  provided  the  other\n   party reads and agrees  to  accept  the  terms  and  conditions  of  this\n   License.  Upon such transfer your license rights are then terminated.\n\n(d)   In addition to the license terms above, with respect  to  portions  of\nthe Software in source code or binary  form  designed  exclusively  for  use\nwith the Linux operating system (\"ATI Linux Code\"), you  may  use,  display,\nmodify, copy, distribute, allow others to  re-distribute,  package  and  re-\npackage such ATI Linux Code  for  commercial  and  non-commercial  purposes,\nprovided that:\n\n   i) all binary components of the ATI Linux Code are not  modified  in  any\n   way;\n\n   ii) the ATI Linux Code is only used  as  part  of  the  Software  and  in\n   connection with ATI Hardware;\n\n   iii) all copyright notices of ATI are reproduced and you refer  to  these\n   license terms;\n\n   iv) you  may  not  offer  or  impose any terms on the use  of  ATI  Linux\n   Code that alter or restrict this License; and\n\n   v) if you have modified the ATI Linux Code, such  modifications  will  be\n   made publicly available and are licensed under the  same  terms  provided\n   herein to ATI or any  other  third  party  without  further  restriction,\n   royalty or any other license requirement;\n\n   vi) to  the  extent  there  is  any ATI sample or  control  panel  source\n   code included in the ATI Linux Code, no rights are granted to modify such\n   code except for portions thereof that  may  be  subject  to  third  party\n   license terms that grant such rights; and\n\n   vii) ATI is not obligated to provide any maintenance or technical support\n   for any code resulting from ATI Linux Code.\n\n2.  Restrictions.  The Software contains copyrighted and patented  material,\ntrade secrets and other proprietary material.  In  order  to  protect  them,\nand except as permitted by this license or applicable legislation,  you  may\nnot:\n\n  a) decompile,  reverse  engineer,  disassemble  or  otherwise  reduce  the\n   Software to a human-perceivable form;\n\n  b) modify, network, rent, lend,  loan,  distribute  or  create  derivative\n   works based upon the Software in whole or in part; or\n\n  c) electronically transmit the Software from one computer  to  another  or\n   over a network or otherwise transfer the Software except as permitted  by\n   this License.\n\n3.  Termination.  This License  is  effective  until  terminated.   You  may\nterminate this License at any  time  by  destroying  the  Software,  related\ndocumentation  and  all  copies  thereof.   This  License   will   terminate\nimmediately without  notice  from  ATI  if  you  fail  to  comply  with  any\nprovision of this License.  Upon termination you must destroy the  Software,\nrelated documentation and all copies thereof.\n\n4.  Government End Users. If you are acquiring the  Software  on  behalf  of\nany  unit  or  agency  of  the  United  States  Government,  the   following\nprovisions apply.  The Government  agrees  the  Software  and  documentation\nwere  developed  at  private  expense  and  are  provided  with  \"RESTRICTED\nRIGHTS\".  Use, duplication, or disclosure by the Government  is  subject  to\nrestrictions as set forth in DFARS 227.7202-1(a) and  227.7202-3(a)  (1995),\nDFARS 252.227-7013(c)(1)(ii) (Oct 1988), FAR  12.212(a)(1995),  FAR  52.227-\n19, (June 1987) or FAR 52.227-14(ALT III) (June 1987),as amended  from  time\nto time.  In the event that this License, or any  part  thereof,  is  deemed\ninconsistent with the minimum rights identified  in  the  Restricted  Rights\nprovisions, the minimum rights shall prevail.\n\n5.  No Other License.  No rights or licenses are granted by ATI  under  this\nLicense, expressly or  by  implication,  with  respect  to  any  proprietary\ninformation  or  patent,  copyright,  trade  secret  or  other  intellectual\nproperty right owned or controlled by ATI, except as expressly  provided  in\nthis License.\n\n6.  Additional Licenses.  DISTRIBUTION  OR  USE  OF  THE  SOFTWARE  WITH  AN\nOPERATING SYSTEM MAY REQUIRE ADDITIONAL LICENSES FROM THE  OPERATING  SYSTEM\nVENDOR.\n\n7.  Disclaimer of Warranty  on  Software.   You  expressly  acknowledge  and\nagree that use of the Software is at  your  sole  risk.   The  Software  and\nrelated documentation are provided \"AS IS\" and without warranty of any  kind\nand ATI EXPRESSLY DISCLAIMS ALL WARRANTIES, EXPRESS AND IMPLIED,  INCLUDING,\nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF  MERCHANTABILITY  AND  FITNESS\nFORA PARTICULAR  PURPOSE,  OF  QUALITY,  OF  QUIET  ENJOYMENT  AND  OF  NON-\nINFRINGEMENT  OF  THIRD  PARTY  RIGHTS.   ATI  DOES  NOT  WARRANT  THAT  THE\nFUNCTIONS CONTAINED IN THE SOFTWARE WILL MEET  YOUR  REQUIREMENTS,  OR  THAT\nTHE OPERATION OF THE SOFTWARE WILL BE UNINTERRUPTED OR ERROR-FREE,  OR  THAT\nDEFECTS IN THE SOFTWARE WILL BE  CORRECTED.   THE  ENTIRE  RISK  AS  TO  THE\nRESULTS AND PERFORMANCE OF THE SOFTWARE IS  ASSUMED  BY  YOU.   FURTHERMORE,\nATI DOES NOT WARRANT OR MAKE ANY REPRESENTATIONS  REGARDING  THE  USE  ORTHE\nRESULTS OF THE USE OF THE SOFTWARE OR  RELATED  DOCUMENTATION  IN  TERMS  OF\nTHEIR CORRECTNESS, ACCURACY,  RELIABILITY,  CURRENTNESS,  OR  OTHERWISE.  NO\nORAL OR WRITTEN INFORMATION OR ADVICE  GIVEN  BY  ATI  OR  ATI'S  AUTHORIZED\nREPRESENTATIVE SHALL CREATE A WARRANTY OR IN ANY WAY INCREASE THE  SCOPE  OF\nTHIS WARRANTY.  SHOULD THE SOFTWARE PROVE DEFECTIVE, YOU  (AND  NOT  ATI  OR\nATI'S AUTHORIZED REPRESENTATIVE) ASSUME THE ENTIRE  COST  OF  ALL  NECESSARY\nSERVICING, REPAIR OR CORRECTION.  THE SOFTWARE IS NOT INTENDED  FOR  USE  IN\nMEDICAL, LIFE SAVING OR LIFE SUSTAINING  APPLICATIONS.   SOME  JURISDICTIONS\nDO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES,  SO  THE  ABOVE  EXCLUSION\nMAY NOT APPLY TO YOU.\n\n8.  Limitation of Liability. TO THE MAXIMUM EXTENT PERMITTED BY  LAW,  UNDER\nNO  CIRCUMSTANCES  INCLUDING  NEGLIGENCE,  SHALL  ATI,  OR  ITS   DIRECTORS,\nOFFICERS, EMPLOYEES  OR  AGENTS,  BE  LIABLE  TO  YOU  FOR  ANY  INCIDENTAL,\nINDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES (INCLUDING DAMAGES  FOR  LOSS  OF\nBUSINESS PROFITS, BUSINESS INTERRUPTION, LOSS  OF  BUSINESSINFORMATION,  AND\nTHE LIKE) ARISING OUT OF THE USE, MISUSE OR INABILITY TO  USE  THE  SOFTWARE\nOR RELATED DOCUMENTATION, BREACH OR DEFAULT, INCLUDING  THOSE  ARISING  FROM\nINFRINGEMENT OR ALLEGED INFRINGEMENT OF ANY PATENT, TRADEMARK, COPYRIGHT  OR\nOTHER INTELLECTUAL PROPERTY RIGHT, BY ATI, EVEN IF ATI OR  ATI'S  AUTHORIZED\nREPRESENTATIVE HAS BEEN ADVISED OF THE POSSIBILITY OF  SUCH  DAMAGES.   SOME\nJURISDICTIONS DO NOT ALLOW THE LIMITATION  OR  EXCLUSION  OF  LIABILITY  FOR\nINCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE  LIMITATION  OR  EXCLUSION\nMAY NOT APPLY TO YOU.  ATI will not be liable for 1) loss of, or damage  to,\nyour records or data or 2) any damages claimed by you  based  on  any  third\nparty claim.   In no event shall  ATI's  total  liability  to  you  for  all\ndamages, losses, and causes of action (whether in contract, tort  (including\nnegligence) or otherwise) exceed the amount paid by you  for  the  Software.\nThe foregoing limitations will apply even if  the  above  stated  limitation\nfails of its essential purpose.\n\n9.  Controlling Law and Severability.  This License  shall  be  governed  by\nand construed under the laws of the  Province  of  Ontario,  Canada  without\nreference to its conflict of law principles.   Any  dispute  related  hereto\nwill be brought only in the courts in  Toronto,  Ontario,  Canada  and  such\ncourts are agreed  to  be  the  convenient  forum.   In  the  event  of  any\nconflicts between foreign law, rules, and  regulations,  and  Canadian  law,\nrules, and regulations, Canadian law, rules and  regulations  shall  prevail\nand  govern.   The  United  Nations  Convention   on   Contracts   for   the\nInternational Sale of Goods shall not apply to this  License.   If  for  any\nreason a court  of  competent  jurisdiction  finds  any  provision  of  this\nLicense or portion thereof, to  be  unenforceable,  that  provision  of  the\nLicense shall be enforced to the maximum extent permissible so as to  effect\nthe intent of the parties, and the remainder of this License shall  continue\nin full force and effect.\n\n10.  Complete Agreement.  This  License  constitutes  the  entire  agreement\nbetween the parties with respect to the use of the Software and the  related\ndocumentation, and supersedes all prior  or  contemporaneous  understandings\nor  agreements,  written  or  oral,  regarding  such  subject  matter.    No\namendment to or modification of this  License  will  be  binding  unless  in\nwriting and signed by a duly authorized representative of ATI."
}