{
  "key": "atkinson-hyperlegible-font",
  "short_name": "Atkinson Hyperlegible Font License",
  "name": "Atkinson Hyperlegible Font License",
  "category": "Permissive",
  "owner": "Braille Institute",
  "homepage_url": "https://www.brailleinstitute.org/wp-content/uploads/2020/11/Atkinson-Hyperlegible-Font-License-2020-1104.pdf",
  "spdx_license_key": "LicenseRef-scancode-atkinson-hyperlegible-font",
  "ignorable_copyrights": [
    "Copyright Holder. Font Software"
  ],
  "ignorable_holders": [
    "Font Software"
  ],
  "text": "Atkinson Hyperlegible Font License\n\nGENERAL\nCopyright Holder allows the Font to be used, studied, modified and redistributed freely as long as it\nis not sold by itself. The Font, including any derivative works, may be bundled, embedded,\nredistributed and/or sold with any software or other work provided that the Reserved Typeface Name\nis not used on, in or by any derivative work. The Font and derivatives, however, cannot be released\nunder any other type of license. The requirement for the Font to remain under this license does not\napply to any document created using the Font or any of its derivatives.\n\nDEFINITIONS\n\"Author\" refers to any designer, engineer, programmer, technical writer or other person who\ncontributed to the Font Software.\n“Copyright Holder” refers to Braille Institute of America, Inc.\n“Font” refers to the Atkinson Hyperlegible Font developed by Copyright Holder.\n\"Font Software\" refers to the set of files released by Copyright Holder under this license. This may\ninclude source files, build scripts and documentation.\n\"Modified Version\" refers to any derivative made by adding to, deleting, or substituting -- in part or\nin whole -- any of the components of the Original Version, by changing formats or by porting the\nFont Software to a new environment.\n\"Original Version\" refers to the collection of the Font Software components as distributed by\nCopyright Holder.\n\"Reserved Typeface Name\" refers to the name Atkinson Hyperlegible Font.\n\nPERMISSION & CONDITIONS\nPermission is hereby granted, free of charge, to any person obtaining a copy of the Font Software,\nto use, study, copy, merge, embed, modify, redistribute, and sell modified and unmodified copies of\nthe Font Software, subject to the following conditions:\n\n1) Neither the Font Software nor any of its individual components, in Original Version or Modified\nVersion, may be sold by itself.\n\n2) The Original Version or Modified Version of the Font Software may be bundled, redistributed\nand/or sold with any other software, provided that each copy contains the above copyright notice\nand this license. These can be included either as stand-alone text files, human-readable headers\nor in the appropriate machine-readable metadata fields within text or binary files as long as those\nfields can be easily viewed by the user.\n\n3) No Modified Version of the Font Software may use the Reserved Typeface Name unless explicit\nwritten permission is granted by Copyright Holder. This restriction only applies to the primary font\nname as presented to the users.\n\n4) The name of Copyright Holder or the Author(s) of the Font Software shall not be used to promote,\nendorse or advertise any Modified Version or any related software or other product, except:\n(a) to acknowledge the contribution(s) of Copyright Holder and the Author(s); or\n(b) with the prior written permission of Copyright Holder.\n\n5) The Font Software, modified or unmodified, in part or in whole, must be distributed entirely under\nthis license, and must not be distributed under any other license.\n\nTERMINATION\nThis license shall immediately terminate and become null and void if any of the above conditions\nare not met.\n\nDISCLAIMER\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF COPYRIGHT, PATENT,\nTRADEMARK OR OTHER RIGHT. IN NO EVENT SHALL COPYRIGHT HOLDER BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, INCLUDING ANY GENERAL, SPECIAL, INDIRECT,\nINCIDENTAL, OR CONSEQUENTIAL DAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT\nOR OTHERWISE, ARISING FROM, OUT OF THE USE OF OR INABILITY TO USE THE FONT\nSOFTWARE OR FROM OTHER DEALINGS IN THE FONT SOFTWARE."
}