{
  "key": "attribution",
  "short_name": "AAL",
  "name": "Attribution Assurance License",
  "category": "Permissive",
  "owner": "Unspecified",
  "homepage_url": "http://opensource.org/licenses/attribution.php",
  "notes": "Per SPDX.org, this version was released 2002 This license is OSI\ncertifified.\n",
  "spdx_license_key": "AAL",
  "text_urls": [
    "http://opensource.org/licenses/attribution.php"
  ],
  "osi_url": "http://opensource.org/licenses/attribution.php",
  "other_urls": [
    "http://www.opensource.org/licenses/attribution",
    "https://opensource.org/licenses/attribution"
  ],
  "text": "PROFESSIONAL IDENTIFICATION * URL\n\"PROMOTIONAL SLOGAN FOR AUTHOR'S PROFESSIONAL PRACTICE\"\n\nAll Rights Reserved\nATTRIBUTION ASSURANCE LICENSE (adapted from the original BSD license)\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the conditions below are met.\nThese conditions require a modest attribution to <AUTHOR> (the\n\"Author\"), who hopes that its promotional value may help justify the\nthousands of dollars in otherwise billable time invested in writing\nthis and other freely available, open-source software.\n\n1. Redistributions of source code, in whole or part and with or without\nmodification (the \"Code\"), must prominently display this GPG-signed\ntext in verifiable form.\n2. Redistributions of the Code in binary form must be accompanied by\nthis GPG-signed text in any documentation and, each time the resulting\nexecutable program or a program dependent thereon is launched, a\nprominent display (e.g., splash screen or banner text) of the Author's\nattribution information, which includes:\n(a) Name (\"AUTHOR\"),\n(b) Professional identification (\"PROFESSIONAL IDENTIFICATION\"), and\n(c) URL (\"URL\").\n3. Neither the name nor any trademark of the Author may be used to\nendorse or promote products derived from this software without specific\nprior written permission.\n4. Users are entirely responsible, to the exclusion of the Author and\nany other persons, for compliance with (1) regulations set by owners or\nadministrators of employed equipment, (2) licensing terms of any other\nsoftware, and (3) local regulations regarding use, including those\nregarding import, export, and use of encryption software.\n\nTHIS FREE SOFTWARE IS PROVIDED BY THE AUTHOR \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO\nEVENT SHALL THE AUTHOR OR ANY CONTRIBUTOR BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nEFFECTS OF UNAUTHORIZED OR MALICIOUS NETWORK ACCESS;\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED\nAND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN\nIF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n--End of License"
}