{
  "key": "bacula-exception",
  "short_name": "Bacula exception to AGPL 3.0",
  "name": "Bacula exception to AGPL 3.0",
  "category": "Copyleft Limited",
  "owner": "Bacula",
  "notes": "composite",
  "is_exception": true,
  "spdx_license_key": "LicenseRef-scancode-bacula-exception",
  "other_urls": [
    "http://www.gnu.org/licenses/"
  ],
  "minimum_coverage": 70,
  "ignorable_copyrights": [
    "Copyright (c) 2000-2017 Kern Sibbald"
  ],
  "ignorable_holders": [
    "Kern Sibbald"
  ],
  "text": "Last revision: 21 May 2017\n\nBacula is licensed under the GNU Affero General Public License, version\n3.0 as published by the Free Software Foundation, Inc. (\"AGPLv3\").\n\nAdditional Terms on the work licensed herein, pursuant to Section 7 of\nAffero General Public License are as follows:\n\n  1. The name Bacula is a registered trademark of Kern Sibbald, and Kern\n     Sibbald hereby declines to grant a trademark license to \"Bacula\"\n     pursuant to AGPLv3, Section 7(e) without a separate agreement with Kern\n     Sibbald.\n\n  2. Pursuant to AGPLv3, Section 7(a), in addition to the warranty and\n     liability disclaimers already found in AGPLv3, the copyright holders\n     specifically disclaim any liability for accusations of patent\n     infringement by any third party.\n\n  3. Pursuant to AGPLv3, Section 7(b), the portions of the file AUTHORS that\n     are deemed to be specified reasonable legal notices and/or author\n     attributions shall be preserved in redistribution of source code and/or\n     modifications thereof. Furthermore, when the following notice appears in\n     a source code file, it must be preserved when source code is conveyed\n     and/or propagated:\n\n   Bacula(R) - The Network Backup Solution\n\n   Copyright (C) 2000-2017 Kern Sibbald\n\n   The original author of Bacula is Kern Sibbald, with contributions\n   from many others, a complete list can be found in the file AUTHORS.\n\n   You may use this file and others of this release according to the\n   license defined in the LICENSE file, which includes the Affero General\n   Public License, v3.0 (\"AGPLv3\") and some additional permissions and\n   terms pursuant to its AGPLv3 Section 7.\n\n   This notice must be preserved when any source code is conveyed\n   and/or propagated.\n\n   Bacula(R) is a registered trademark of Kern Sibbald.\n\nAdditional Permissions on the work licensed herein, pursuant to Section 7 of\nAGPLv3 are as follows:\n\n1. As a special exception to the AGPLv3, the copyright holders give\n   permission to link the code of its release of Bacula with the OpenSSL\n   project's \"OpenSSL\" library (or with modified versions of it that use the\n   same license as the \"OpenSSL\" library), and distribute the linked\n   executables.  You must follow the requirements of AGPLv3 in all respects\n   for all of the code used other than \"OpenSSL\".\n\n2. As a special exception to the AGPLv3, the copyright holders give\n   permission to link the code of its release of the Bacula Win32 File daemon\n   with the Microsoft supplied Volume Shadow Copy (VSS) libraries and\n   distribute the linked executables.  You must follow the requirements of\n   the AGPLv3 in all respects for all of the code used other than for the\n   Microsoft VSS code.\n\nIf you want to fork Bacula, please read the file LICENSE-FAQ."
}