{
  "key": "baserow-ee-2019",
  "short_name": "Baserow EE License 2019",
  "name": "Baserow Enterprise Edition License (the \"EE License\") 2019",
  "category": "Commercial",
  "owner": "Baserow",
  "homepage_url": "https://github.com/bram2w/baserow/blob/master/enterprise/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-baserow-ee-2019",
  "ignorable_urls": [
    "https://baserow.io/terms/subscription"
  ],
  "text": "The Baserow Enterprise Edition license (the \"EE License\")\n\nThe Baserow software and associated documentation files (the \"Software\") may only be\nused in production, if you (and any entity that you represent) have a valid Baserow\nEnterprise Edition subscription for the correct number of users, you adhere to the\napplicable Baserow Subscription Terms of Service, available at\nhttps://baserow.io/terms/subscription (the \"EE Terms\") and you adhere to any other\nagreement or terms applicable to the use of the Software. Only under the conditions as\nset out in this section, and the applicable terms and conditions, Baserow grants you\nthe right to modify the Software and publish patches to the Software. You agree that\nBaserow and/or its licensors (as applicable) retain all right, title and interest in\nand to all such modifications and/or patches, and all such modifications and/or patches\nmay only be used, copied, modified, displayed, distributed, or otherwise exploited with\na valid Baserow Enterprise Edition subscription for the correct number of users.\nNotwithstanding the foregoing, you may copy and modify the Software for development and\ntesting purposes without requiring a Baserow Enterprise Edition subscription. You agree\nthat Baserow and/or its licensors (as applicable) retain all right, title and interest\nin and to all such modifications. You are not granted any other rights beyond what is\nexpressly stated herein.  Subject to the foregoing, it is forbidden to copy, merge,\npublish, distribute, sublicense, and/or sell the Software.\n\nThe Software is provided \"AS IS\", without warranty of any kind, express or implied,\nincluding but not limited to the warranties of merchantability, fitness for a\nparticular purpose and non-infringement. In no event shall the authors or copyright\nholders be liable for any claim, damages or other liability, whether in an action of\ncontract, tort or otherwise, arising from, out of or in connection with the Software\nor the use or other dealings in the Software.\n\nThe full text of this EE License shall be included in all copies or substantial\nparts of the Software. The EE License applies only to the part of the Software that\nis not distributed as part of Baserow Open Source Edition (Baserow OSE). Any part of\nthe Software distributed as part of Baserow OSE or is served client-side as an image,\nfont, cascading stylesheet (CSS), file which produces or is compiled, arranged,\naugmented, or combined into client-side JavaScript, in whole or in part, is copyrighted\nunder the MIT Expat license.\n\nFor all third party components incorporated into the Baserow Software, those components\nare licensed under the original license provided by the owner of the applicable\ncomponent."
}