{
  "key": "beegfs-eula-2024",
  "short_name": "BeeGFS EULA 2024",
  "name": "BeeGFS End User License Agreement 2024",
  "category": "Source-available",
  "owner": "ThinkParQ",
  "homepage_url": "https://github.com/ThinkParQ/beegfs/blob/master/LICENSE.txt",
  "spdx_license_key": "LicenseRef-scancode-beegfs-eula-2024",
  "text_urls": [
    "https://www.beegfs.io/docs/BeeGFS_EULA.txt"
  ],
  "text": "BeeGFS END USER LICENSE AGREEMENT\nDecember 18, 2024\n\nPLEASE READ THIS LICENSE AGREEMENT CAREFULLY. BY USING THE SOFTWARE BEEGFS YOU\nACCEPT ALL TERMS OF THE LICENSE AGREEMENT. IF YOU DO NOT AGREE TO THE TERMS OF\nTHIS LICENSE, DO NOT INSTALL, COPY, OR USE THE SOFTWARE.\n\n1.) DEFINITIONS\n\n1.1) LICENSOR: ThinkParQ GmbH, Trippstadter Strasse 113, 67663 Kaiserslautern,\nGermany.\n\n1.2) LICENSEE: The user of BEEGFS under this License Agreement.\n\n1.3) LICENSED SOFTWARE: The Software BEEGFS in source code and object code form\nincluding all executable programs.\n\n1.4) DOCUMENTATION: The BEEGFS user's guide, e-mails and other explanatory\nmaterials accompanying the LICENSED SOFTWARE in printed or electronic form.\n\n\n2.) OWNERSHIP / INTELLECTUAL PROPERTY RIGHTS\n\nLICENSEE acknowledges that ownership and all intellectual property rights\nrelated to the LICENSED SOFTWARE and to the DOCUMENTATION, including patents,\ncopyright, company or trade secrets remain with the LICENSOR.\n\nLICENSEE promises to keep and not to modify the copyright notices of the\nLICENSOR.\n\n\n3.) SCOPE OF LICENSE\n\n3.1) Provided LICENSEE accepts all terms of this License Agreement, LICENSEE\nis granted a non-exclusive, non-assignable right to use the LICENSED SOFTWARE,\nwhich means LICENSEE may use the software for an unrestricted number of users,\nas well as use the accompanying DOCUMENTATION by the actual number of users.\n\n3.2) Without prior written consent of LICENSOR or an authorized partner,\nLICENSEE may modify the source code and use the modified version of the LICENSED\nSOFTWARE for internal use only.\n\n3.2.1) LICENSEE must inform users of modified versions about the fact that the\nsoftware differs from the original version.\n\n3.2.2) The LICENSED SOFTWARE and the modifications generated by LICENSEE shall\nremain the property of LICENSOR and no rights, including but not limited to the\nright to apply for industrial property rights, are granted to LICENSEE.\n\n3.3) Without prior written consent of LICENSOR or an authorized partner,\nLICENSEE may not:\n- use, copy or distribute the LICENSED SOFTWARE except as provided for under\n  sections 3.1 and 3.2.\n- provide commercial turn-key solutions based on the LICENSED SOFTWARE or\n  commercial services for the LICENSED SOFTWARE to any third party.\n- rent or lease the LICENSED SOFTWARE and DOCUMENTATION to any third party.\n- modify, adapt, or translate the LICENSED SOFTWARE for any third party.\n\n3.4) The following optional functionalities and features of the LICENSED\nSOFTWARE are declared as enterprise features:\n  - Resiliency: (a) Mirroring; (b) High Availability\n  - User management: Quota Enforcement\n  - Data management: (a) Storage Pool; (b) Remote Storage Targets (RST);\n    (c) Copy; (d) Watch; (e) Index; (f) Balance\n\nAll enterprise features are disabled by default. LICENSEE may not modify or\ndelete mechanisms for licensing enforcement of enterprise features from\nLICENSED SOFTWARE.\n\n3.4.1) LICENSEE may enable and use the enterprise features for a trial period of\n60 (sixty) days solely for the purpose of testing.\n\n3.4.2) Except for the trial period in section 3.4.1, the enterprise features may\nonly be enabled and used for the duration of a separate \"Enterprise Support\nContract\" between LICENSEE and LICENSOR or an authorized partner of LICENSOR.\n\n3.4.3) If the trial period (section 3.4.1) or the enterprise support contract\n(section 3.4.2) expires and LICENSEE continues to use the LICENSED SOFTWARE,\nLICENSEE must disable all enterprise features.\n\n3.5) The license under this License Agreement relates to the LICENSED SOFTWARE.\n\n\n4.) LIMITED WARRANTY AND LIABILITY\n\n4.1) LICENSOR confirms that the LICENSED SOFTWARE has been developed without\ninfringement of any rights of third parties, in particular patents, copyrights\nor other intellectual property rights of third parties. Nevertheless LICENSOR\ndoes not warrant that the use of the LICENSED SOFTWARE by LICENSEE does not\ninfringe any third party intellectual property rights.\n\n4.2) LICENSEE is aware that there is a risk that the LICENSED SOFTWARE might\ndamage the data or the computer of the LICENSEE or even other computers on the\nnetwork in unpredictable ways. The use of the LICENSED SOFTWARE is at the\nexclusive risk of the LICENSEE. LICENSOR does not offer any warranty either\nexpressed or implied and is not liable for any damages resulting from the use of\nthe LICENSED SOFTWARE or DOCUMENTATION such as, but not limited to, data loss.\n\n4.3) Notwithstanding sections 4.1 and 4.2, the liability of the LICENSOR, its\nlegal representatives and employees resulting from breach of duty or tort is\nrestricted to damages caused intentionally or by gross negligence. In any case,\nthe liability under this section is limited by typical, foreseeable, direct\ndamages. The liability is unrestricted for damages of the body, life or health.\n\n\n5.) MISCELLANEOUS\n\nThis License Agreement in English is the original one. The terms of this\nAgreement can only be modified or amended in writing. In case of interpretation\ncontroversies the terms of this Agreement shall prevail over the respective\nterms of any other agreements.\n\nThis Agreement is construed under the Law of the Federal Republic of Germany.\nTherefore, any and all controversies resulting out of this Agreement shall be\nresolved under the Law of the Federal Republic of Germany excluding the German\nInternational Private Law Rules. The application of the UN-Convention of the\nInternational Sales of Goods (CISG) is explicitly excluded. Exclusive venue of\njurisdiction for both parties shall be Munich, Germany.\n\nIn case that one or several of the terms of this Agreement should be or become\ninvalid or unenforceable, the validity of the other terms shall remain\nunaffected. In such a case, the parties shall replace the invalid or\nunenforceable condition by another legally effective provision meeting the\npurpose of the abolished provision to the greatest extent. The same applies in\ncase of a gap of regulation."
}