{
  "key": "bitstream",
  "short_name": "Bitstream Vera Font License",
  "name": "Bitstream Vera Font License",
  "category": "Permissive",
  "owner": "Bitstream",
  "homepage_url": "http://www.gnome.org/fonts/#Final_Bitstream_Vera_Fonts",
  "spdx_license_key": "Bitstream-Vera",
  "other_spdx_license_keys": [
    "LicenseRef-scancode-bitstream"
  ],
  "text_urls": [
    "http://www.gnome.org/fonts/#Final_Bitstream_Vera_Fonts"
  ],
  "other_urls": [
    "https://docubrain.com/sites/default/files/licenses/bitstream-vera.html",
    "https://web.archive.org/web/20080207013128/http://www.gnome.org/fonts/"
  ],
  "minimum_coverage": 50,
  "text": "Permission is hereby granted, free of charge, to any person obtaining\na copy of the fonts accompanying this license (\"Fonts\") and associated\ndocumentation files (the \"Font Software\"), to reproduce and distribute\nthe Font Software, including without limitation the rights to use,\ncopy, merge, publish, distribute, and/or sell copies of the Font\nSoftware, and to permit persons to whom the Font Software is furnished\nto do so, subject to the following conditions:\n\nThe above copyright and trademark notices and this permission notice\nshall be included in all copies of one or more of the Font Software\ntypefaces.\n\nThe Font Software may be modified, altered, or added to, and in\nparticular the designs of glyphs or characters in the Fonts may be\nmodified and additional glyphs or characters may be added to the\nFonts, only if the fonts are renamed to names not containing either\nthe words \"Bitstream\" or the word \"Vera\".\n\nThis License becomes null and void to the extent applicable to Fonts\nor Font Software that has been modified and is distributed under the\n\"Bitstream Vera\" names.\n\nThe Font Software may be sold as part of a larger software package but\nno copy of one or more of the Font Software typefaces may be sold by\nitself.\n\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL\nBITSTREAM OR THE GNOME FOUNDATION BE LIABLE FOR ANY CLAIM, DAMAGES OR\nOTHER LIABILITY, INCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL,\nOR CONSEQUENTIAL DAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF THE USE OR INABILITY TO USE THE FONT\nSOFTWARE OR FROM OTHER DEALINGS IN THE FONT SOFTWARE.\n\nExcept as contained in this notice, the names of Gnome, the Gnome\nFoundation, and Bitstream Inc., shall not be used in advertising or\notherwise to promote the sale, use or other dealings in this Font\nSoftware without prior written authorization from the Gnome Foundation\nor Bitstream Inc., respectively. For further information, contact:\nfonts at gnome dot org."
}