{
  "key": "bitwarden-1.0",
  "short_name": "Bitwarden License Agreement v1",
  "name": "Bitwarden License Agreement v1",
  "category": "Source-available",
  "owner": "Bitwarden",
  "homepage_url": "https://github.com/bitwarden/server/blob/v1.38.1/LICENSE_BITWARDEN.txt",
  "spdx_license_key": "LicenseRef-scancode-bitwarden-1.0",
  "faq_url": "https://github.com/bitwarden/server/blob/v1.38.1/LICENSE_FAQ.md",
  "text": "BITWARDEN LICENSE AGREEMENT\nVersion 1, 4 September 2020\n\nPLEASE CAREFULLY READ THIS BITWARDEN LICENSE AGREEMENT (\"AGREEMENT\"). THIS\nAGREEMENT CONSTITUTES A LEGALLY BINDING AGREEMENT BETWEEN YOU AND BITWARDEN,\nINC. (\"BITWARDEN\") AND GOVERNS YOUR USE OF THE COMMERCIAL MODULES (DEFINED\nBELOW). BY COPYING OR USING THE COMMERCIAL MODULES, YOU AGREE TO THIS AGREEMENT.\nIF YOU DO NOT AGREE WITH THIS AGREEMENT, YOU MAY NOT COPY OR USE THE COMMERCIAL\nMODULES. IF YOU ARE COPYING OR USING THE COMMERCIAL MODULES ON BEHALF OF A LEGAL\nENTITY, YOU REPRESENT AND WARRANT THAT YOU HAVE AUTHORITY TO AGREE TO THIS\nAGREEMENT ON BEHALF OF SUCH ENTITY. IF YOU DO NOT HAVE SUCH AUTHORITY, DO NOT\nCOPY OR USE THE COMMERCIAL MODULES IN ANY MANNER.\n\nThis Agreement is entered into by and between Bitwarden and you, or the legal\nentity on behalf of whom you are acting (as applicable, \"You\" or \"Your\").\n\n1. DEFINITIONS\n\n\"Bitwarden Software\" means the Bitwarden server software, libraries, and\nCommercial Modules.\n\n\"Commercial Modules\" means the modules designed to work with and enhance the\nBitwarden Software to which this Agreement is linked, referenced, or appended.\n\n2. LICENSES, RESTRICTIONS AND THIRD PARTY CODE\n\n2.1   Commercial Module License. Subject to Your compliance with this Agreement,\nBitwarden hereby grants to You a limited, non-exclusive, non-transferable,\nroyalty-free license to use the Commercial Modules for the sole purposes of\ninternal development and internal testing, and only in a non-production\nenvironment.\n\n2.2   Reservation of Rights. As between Bitwarden and You, Bitwarden owns all\nright, title and interest in and to the Bitwarden Software, and except as\nexpressly set forth in Sections 2.1, no other license to the Bitwarden Software\nis granted to You under this Agreement, by implication, estoppel, or otherwise.\n\n2.3   Restrictions. You agree not to: (i) except as expressly permitted in\nSection 2.1, sell, rent, lease, distribute, sublicense, loan or otherwise\ntransfer the Commercial Modules to any third party; (ii) alter or remove any\ntrademarks, service mark, and logo included with the Commercial Modules, or\n(iii) use the Commercial Modules to create a competing product or service.\nBitwarden is not obligated to provide maintenance and support services for the\nBitwarden Software licensed under this Agreement.\n\n2.4   Third Party Software. The Commercial Modules may contain or be provided\nwith third party open source libraries, components, utilities and other open\nsource software (collectively, \"Open Source Software\"). Notwithstanding anything\nto the contrary herein, use of the Open Source Software will be subject to the\nlicense terms and conditions applicable to such Open Source Software. To the\nextent any condition of this Agreement conflicts with any license to the Open\nSource Software, the Open Source Software license will govern with respect to\nsuch Open Source Software only.\n\n3. TERMINATION\n\n3.1   Termination. This Agreement will automatically terminate upon notice from\nBitwarden, which notice may be by email or posting in the location where the\nCommercial Modules are made available.\n\n3.2   Effect of Termination. Upon any termination of this Agreement, for any\nreason, You will promptly cease use of the Commercial Modules and destroy any\ncopies thereof. For the avoidance of doubt, termination of this Agreement will\nnot affect Your right to Bitwarden Software, other than the Commercial Modules,\nmade available pursuant to an Open Source Software license.\n\n3.3   Survival. Sections 1, 2.2 -2.4, 3.2, 3.3, 4, and 5 will survive any\ntermination of this Agreement.\n\n4. DISCLAIMER AND LIMITATION OF LIABILITY\n\n4.1   Disclaimer of Warranties. TO THE MAXIMUM EXTENT PERMITTED UNDER APPLICABLE\nLAW, THE BITWARDEN SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED REGARDING OR RELATING TO THE BITWARDEN SOFTWARE, INCLUDING\nANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\nTITLE, AND NON-INFRINGEMENT. FURTHER, BITWARDEN DOES NOT WARRANT RESULTS OF USE\nOR THAT THE BITWARDEN SOFTWARE WILL BE ERROR FREE OR THAT THE USE OF THE\nBITWARDEN SOFTWARE WILL BE UNINTERRUPTED.\n\n4.2   Limitation of Liability. IN NO EVENT WILL BITWARDEN OR ITS LICENSORS BE\nLIABLE TO YOU OR ANY THIRD PARTY UNDER THIS AGREEMENT FOR (I) ANY AMOUNTS IN\nEXCESS OF US $25 OR (II) FOR ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES OF\nANY KIND, INCLUDING FOR ANY LOSS OF PROFITS, LOSS OF USE, BUSINESS INTERRUPTION,\nLOSS OF DATA, COST OF SUBSTITUTE GOODS OR SERVICES, WHETHER ALLEGED AS A BREACH\nOF CONTRACT OR TORTIOUS CONDUCT, INCLUDING NEGLIGENCE, EVEN IF BITWARDEN HAS\nBEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n5. MISCELLANEOUS\n\n5.1   Assignment. You may not assign or otherwise transfer this Agreement or any\nrights or obligations hereunder, in whole or in part, whether by operation of\nlaw or otherwise, to any third party without Bitwarden's prior written consent.\nAny purported transfer, assignment or delegation without such prior written\nconsent will be null and void and of no force or effect. Bitwarden may assign\nthis Agreement to any successor to its business or assets to which this\nAgreement relates, whether by merger, sale of assets, sale of stock,\nreorganization or otherwise. Subject to this Section 5.1, this Agreement will be\nbinding upon and inure to the benefit of the parties hereto, and their\nrespective successors and permitted assigns.\n\n5.2   Entire Agreement; Modification; Waiver. This Agreement represents the\nentire agreement between the parties, and supersedes all prior agreements and\nunderstandings, written or oral, with respect to the matters covered by this\nAgreement, and is not intended to confer upon any third party any rights or\nremedies hereunder. You acknowledge that You have not entered in this Agreement\nbased on any representations other than those contained herein. No modification\nof or amendment to this Agreement, nor any waiver of any rights under this\nAgreement, will be effective unless in writing and signed by both parties. The\nwaiver of one breach or default or any delay in exercising any rights will not\nconstitute a waiver of any subsequent breach or default.\n\n5.3   Governing Law. This Agreement will in all respects be governed by the laws\nof the State of California without reference to its principles of conflicts of\nlaws. The parties hereby agree that all disputes arising out of this Agreement\nwill be subject to the exclusive jurisdiction of and venue in the federal and\nstate courts within Los Angeles County, California. You hereby consent to the\npersonal and exclusive jurisdiction and venue of these courts. The parties\nhereby disclaim and exclude the application hereto of the United Nations\nConvention on Contracts for the International Sale of Goods.\n\n5.4   Severability. If any provision of this Agreement is held invalid or\nunenforceable under applicable law by a court of competent jurisdiction, it will\nbe replaced with the valid provision that most closely reflects the intent of\nthe parties and the remaining provisions of the Agreement will remain in full\nforce and effect.\n\n5.5   Relationship of the Parties. Nothing in this Agreement is to be construed\nas creating an agency, partnership, or joint venture relationship between the\nparties hereto. Neither party will have any right or authority to assume or\ncreate any obligations or to make any representations or warranties on behalf of\nany other party, whether express or implied, or to bind the other party in any\nrespect whatsoever.\n\n5.6   Notices. All notices permitted or required under this Agreement will be in\nwriting and will be deemed to have been given when delivered in person\n(including by overnight courier), or three (3) business days after being mailed\nby first class, registered or certified mail, postage prepaid, to the address of\nthe party specified in this Agreement or such other address as either party may\nspecify in writing.\n\n5.7   U.S. Government Restricted Rights. If Commercial Modules is being licensed\nby the U.S. Government, the Commercial Modules is deemed to be \"commercial\ncomputer software\" and \"commercial computer documentation\" developed exclusively\nat private expense, and (a) if acquired by or on behalf of a civilian agency,\nwill be subject solely to the terms of this computer software license as\nspecified in 48 C.F.R. 12.212 of the Federal Acquisition Regulations and its\nsuccessors; and (b) if acquired by or on behalf of units of the Department of\nDefense (\"DOD\") will be subject to the terms of this commercial computer\nsoftware license as specified in 48 C.F.R. 227.7202-2, DOD FAR Supplement and\nits successors.\n\n5.8   Injunctive Relief. A breach or threatened breach by You of Section 2 may\ncause irreparable harm for which damages at law may not provide adequate relief,\nand therefore Bitwarden will be entitled to seek injunctive relief in any\napplicable jurisdiction without being required to post a bond.\n\n5.9   Export Law Assurances. You understand that the Commercial Modules is\nsubject to export control laws and regulations. You may not download or\notherwise export or re-export the Commercial Modules or any underlying\ninformation or technology except in full compliance with all applicable laws and\nregulations, in particular, but without limitation, United States export control\nlaws. None of the Commercial Modules or any underlying information or technology\nmay be downloaded or otherwise exported or re- exported: (a) into (or to a\nnational or resident of) any country to which the United States has embargoed\ngoods; or (b) to anyone on the U.S. Treasury Department's list of specially\ndesignated nationals or the U.S. Commerce Department's list of prohibited\ncountries or debarred or denied persons or entities. You hereby agree to the\nforegoing and represents and warrants that You are not located in, under control\nof, or a national or resident of any such country or on any such list.\n\n5.10  Construction. The titles and section headings used in this Agreement are\nfor ease of reference only and will not be used in the interpretation or\nconstruction of this Agreement. No rule of construction resolving any ambiguity\nin favor of the non-drafting party will be applied hereto. The word \"including\",\nwhen used herein, is illustrative rather than exclusive and means \"including,\nwithout limitation.\""
}