{
  "key": "blitz-artistic",
  "short_name": "Blitz++ Artistic",
  "name": "Blitz++ Artistic License",
  "category": "Copyleft Limited",
  "owner": "Blitz++",
  "homepage_url": "https://github.com/blitzpp/blitz/blob/master/COPYRIGHT",
  "notes": "This is a modified artistic license, no longer in use.",
  "spdx_license_key": "LicenseRef-scancode-blitz-artistic",
  "text_urls": [
    "https://raw.githubusercontent.com/blitzpp/blitz/e3c973d68e5ee17aec779bf9711b38fd4afc355f/LICENSE"
  ],
  "text": "The `Blitz++ Artistic License'\n(with thanks and apologies to authors of the Perl Artistic License)\n\nPreamble\n\nThe intent of this document is to state the conditions under which \nBlitz++ may be copied, such that the authors maintains some\nsemblance of artistic control over the development of the package,\nwhile giving the users of the package the right to use and\ndistribute Blitz++ in a more-or-less customary fashion, plus the\nright to make reasonable modifications.\n\nDefinitions\n\n`Library' refers to the collection of files distributed by the\nCopyright Holder, and derivatives of that collection of files\ncreated through textual modification.\n\n`Standard Version' refers to such a Library if it has not been\nmodified, or has been modified in accordance with the wishes of the\nCopyright Holder as specified below.\n\nCopyright Holder' is whoever is named in the copyright or\ncopyrights for the package.\n\n`You' is you, if you're thinking about copying, modifying or\ndistributing this Library.\n\n`Freely Available' means that no fee is charged for the item.\nIt also means that recipients of the item may redistribute it \nunder the same conditions they received it.\n\n``Reasonable copying fee'' is whatever you can justify on the basis\nof media cost, duplication charges, time of people involved, and so\non. (You will not be required to justify it to the Copyright Holder,\nbut only to the computing community at large as a market that must\nbear the fee.)\n\n1. You may make and give away verbatim copies of the \nStandard Version of this Library without restriction, provided that\nyou duplicate all of the original copyright notices, this license,\nand associated disclaimers. \n\n2. The Standard Version of the Library may be distributed as part\nof a collection of software, provided no more than a reasonable\ncopying fee is charged for the software collection.\n\n3. You may apply bug fixes, portability fixes and other modifications\nderived from the Public Domain or from the Copyright Holder. A\nLibrary modified in such a way shall still be considered the\nStandard Version.\n\n4. You may otherwise modify your copy of this Library in any way,\nprovided that you insert a prominent notice in each changed file\nstating how and when you changed that file, and provided that you do\nat least ONE of the following:\n\na. place your modifications in the Public Domain or otherwise\nmake them Freely Available, such as by posting said\nmodifications to the Blitz++ development list, \nand allowing the Copyright Holder to include\nyour modifications in the Standard Version of the Library.\n\nb. use the modified Library only within your corporation or\norganization. \n\nc. make other distribution arrangements with the Copyright\nHolder.\n\n5. You may distribute programs which use this Library\nin object code or executable form without restriction.\n\n6. Any object code generated as a result of using this Library \ndoes not fall under the copyright of this Library, but\nbelongs to whomever generated it, and may be sold commercially.\n\n7. The name of the Copyright Holder or the Library may not be used to \nendorse or promote products derived from this software without \nspecific prior written permission.\n\n8. THIS PACKAGE IS PROVIDED `AS IS' AND WITHOUT ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE."
}