{
  "key": "bpel4ws-spec",
  "short_name": "BPEL4WS Specification license",
  "name": "BPEL4WS Specification license",
  "category": "Proprietary Free",
  "owner": "Microsoft",
  "homepage_url": "http://xml.coverpages.org/BPELv11-May052003Final.pdf",
  "notes": "BPEL4WS Specification Version 1,1 Dated May 5, 2003, Copyright statement",
  "spdx_license_key": "LicenseRef-scancode-bpel4ws-spec",
  "ignorable_copyrights": [
    "Copyright (c) 2002, 2003 BEA Systems, International Business Machines Corporation, Microsoft Corporation, SAP AG, Siebel Systems"
  ],
  "ignorable_holders": [
    "BEA Systems, International Business Machines Corporation, Microsoft Corporation, SAP AG, Siebel Systems"
  ],
  "ignorable_urls": [
    "http://dev2dev.bea.com/technologies/webservices/BPEL4WS.jsp",
    "http://ifr.sap.com/bpel4ws/",
    "http://msdn.microsoft.com/library/default.asp?url=/library/en-us/dnbiz2k2/html/bpel1-1.asp",
    "http://www-106.ibm.com/developerworks/webservices/library/ws-bpel/",
    "http://www.siebel.com/bpel"
  ],
  "text": "[BPEL4WS Specification Version 1,1 Dated May 5, 2003, Copyright statement]\n\nCopyright (c) 2002, 2003 BEA Systems, International Business Machines\nCorporation, Microsoft Corporation, SAP AG, Siebel Systems. All rights\nreserved.\n\nPermission to copy and display the \"Business Process Execution Language for\nWeb Services Specification, version 1.1 dated May 5, 2003\" (hereafter \"the\nBPEL4WS Specification\"), in any medium without fee or royalty is hereby\ngranted, provided that you include the following on ALL copies of the\nBPEL4WS Specification, or portions thereof, that you make:\n\n    A link to the BPEL4WS Specification at these locations:\n        http://dev2dev.bea.com/technologies/webservices/BPEL4WS.jsp\n        http://www-106.ibm.com/developerworks/webservices/library/ws-bpel/\n        http://msdn.microsoft.com/library/default.asp?url=/library/en-us/dnbiz2k2/html/bpel1-1.asp\n        http://ifr.sap.com/bpel4ws/\n        http://www.siebel.com/bpel\n\n    The copyright notice as shown in the BPEL4WS Specification:\n\n    BEA, IBM, Microsoft, SAP AG and Siebel Systems (collectively, the\n    \"Authors\") agree to grant you a royalty-free license, under reasonable,\n    non-discriminatory terms and conditions, to patents that they deem\n    necessary to implement the Business Process Execution Language for Web\n    Services Specification.\n\n    THE Business Process Execution Language for Web Services SPECIFICATION\n    IS PROVIDED \"AS IS,\" AND THE AUTHORS MAKE NO REPRESENTATIONS OR\n    WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\n    WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-\n    INFRINGEMENT, OR TITLE; THAT THE CONTENTS OF THE BPEL4WS SPECIFICATION\n    ARE SUITABLE FOR ANY PURPOSE; NOR THAT THE IMPLEMENTATION OF SUCH\n    CONTENTS WILL NOT INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS,\n    TRADEMARKS OR OTHER RIGHTS.\n\n    THE AUTHORS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL,\n    INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR RELATING TO ANY\n    USE OR DISTRIBUTION OF THE BPEL4WS SPECIFICATION.\n\n    The name and trademarks of the Authors may NOT be used in any manner,\n    including advertising or publicity pertaining to the BPEL4WS\n    Specification or its contents without specific, written prior\n    permission. Title to copyright in the BPEL4WS Specification will at all\n    times remain with the Authors.\n\n    No other rights are granted by implication, estoppel or otherwise."
}