{
  "key": "broadcom-opus-patent",
  "short_name": "Broadcom Opus Patent License",
  "name": "Broadcom Opus Patent License",
  "category": "Patent License",
  "owner": "Broadcom",
  "homepage_url": "https://datatracker.ietf.org/ipr/1526/",
  "spdx_license_key": "LicenseRef-scancode-broadcom-opus-patent",
  "text": "License Grant. Broadcom Corporation (“Broadcom”) hereby grants to you a\nperpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable (except as stated in this license) license under Licensed\nPatents to make, have made, use, offer to sell, sell, import, transfer,\nand otherwise run, modify (in a way that still complies with the\nSpecification), and reproduce any Implementation.\n\nDefinitions. Specification means, and includes the following, both\nindividually and collectively, (a) any standard specification of the\nOpus codec adopted by the IETF Codec Working Group (“Standard”) and (b)\nany reference implementation (each, a “Reference Implementation”)\npublished by the IETF Codec Working Group in the request for comments\n(“RFC”) issued by the IETF for the Specification draft for which this\nLicense is issued, or any RFC that is issued as an update or new version\nthereof. An Implementation means any Reference Implementation, or\nanother implementation that complies with the Specification. Licensed\nPatents means all patents currently owned by Broadcom or acquired hereafter\nthat Broadcom has the right to license as set forth above and that are\nnecessarily infringed by the Specification, where “necessarily\ninfringed” means: in the case of (a) above, there is no commercially\nviable means of implementing the Specification without infringing such\npatent; in the case of (b) above, use of the reference implementation to\nthe extent it infringes such patent.\n\nTermination. If you, directly or indirectly via controlled affiliate or\nsubsidiary, agent, or exclusive licensee, file a Claim for patent\ninfringement against any entity alleging that an Implementation in whole\nor in part constitutes direct or contributory patent infringement, or\ninducement of patent infringement (a “Claim”), provided that a Reference\nImplementation also infringes the patents asserted in the Claim, then\nany patent rights granted to you under this License shall automatically\nterminate retroactively as of the date you first received the grant.\nClaims made against an Implementation in part will only trigger\ntermination if the Implementation in part was done for the purpose of\ncombining it with other technology that complies with the Specification\nso that the technology’s ultimate use will be consistent with the\nStandard as a whole."
}