{
  "key": "broadcom-standard-terms",
  "short_name": "Broadcom Standard Terms",
  "name": "Broadcom Standard Terms",
  "category": "Commercial",
  "owner": "Broadcom",
  "spdx_license_key": "LicenseRef-scancode-broadcom-standard-terms",
  "text": "This program is the proprietary software of Broadcom Corporation and/or\nits licensors, and may only be used, duplicated, modified or distributed\npursuant to the terms and conditions of a separate, written license\nagreement executed between you and Broadcom (an \"Authorized License\").\nExcept as set forth in an Authorized License, Broadcom grants no license\n(express or implied), right to use, or waiver of any kind with respect to\nthe Software, and Broadcom expressly reserves all rights in and to the\nSoftware and all intellectual property rights therein.  IF YOU HAVE NO\nAUTHORIZED LICENSE, THEN YOU HAVE NO RIGHT TO USE THIS SOFTWARE IN ANY WAY,\nAND SHOULD IMMEDIATELY NOTIFY BROADCOM AND DISCONTINUE ALL USE OF THE\nSOFTWARE.  \n\nExcept as expressly set forth in the Authorized License,\n\n1.     This program, including its structure, sequence and organization,\nconstitutes the valuable trade secrets of Broadcom, and you shall use all\nreasonable efforts to protect the confidentiality thereof, and to use this\ninformation only in connection with your use of Broadcom integrated circuit\nproducts.\n\n2.     TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE SOFTWARE IS PROVIDED\n\"AS IS\" AND WITH ALL FAULTS AND BROADCOM MAKES NO PROMISES, REPRESENTATIONS\nOR WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH\nRESPECT TO THE SOFTWARE.  BROADCOM SPECIFICALLY DISCLAIMS ANY AND ALL\nIMPLIED WARRANTIES OF TITLE, MERCHANTABILITY, NONINFRINGEMENT, FITNESS FOR\nA PARTICULAR PURPOSE, LACK OF VIRUSES, ACCURACY OR COMPLETENESS, QUIET\nENJOYMENT, QUIET POSSESSION OR CORRESPONDENCE TO DESCRIPTION. YOU ASSUME\nTHE ENTIRE RISK ARISING OUT OF USE OR PERFORMANCE OF THE SOFTWARE.\n\n3.     TO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL BROADCOM\nOR ITS LICENSORS BE LIABLE FOR (i) CONSEQUENTIAL, INCIDENTAL, SPECIAL,\nINDIRECT, OR EXEMPLARY DAMAGES WHATSOEVER ARISING OUT OF OR IN ANY WAY\nRELATING TO YOUR USE OF OR INABILITY TO USE THE SOFTWARE EVEN IF BROADCOM\nHAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES; OR (ii) ANY AMOUNT IN\nEXCESS OF THE AMOUNT ACTUALLY PAID FOR THE SOFTWARE ITSELF OR U.S. $1,\nWHICHEVER IS GREATER. THESE LIMITATIONS SHALL APPLY NOTWITHSTANDING ANY\nFAILURE OF ESSENTIAL PURPOSE OF ANY LIMITED REMEDY."
}