{
  "key": "bsd-plus-patent",
  "short_name": "BSD-2-Clause Plus Patent",
  "name": "BSD-2-Clause Plus Patent",
  "category": "Permissive",
  "owner": "OSI - Open Source Initiative",
  "homepage_url": "https://opensource.org/licenses/BSDplusPatent",
  "notes": "Per the OSI, this license is designed to provide a) a simple permissive\nlicense; b) that is compatible with the GNU General Public License (GPL),\nversion 2; and c) which also has an express patent grant included.\n",
  "spdx_license_key": "BSD-2-Clause-Patent",
  "text_urls": [
    "https://opensource.org/licenses/BSDplusPatent"
  ],
  "osi_url": "https://opensource.org/licenses/BSDplusPatent",
  "text": "Redistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n1. Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in the\ndocumentation and/or other materials provided with the distribution.\n\nSubject to the terms and conditions of this license, each copyright\nholder and contributor hereby grants to those receiving rights under\nthis license a perpetual, worldwide, non-exclusive, no-charge, royalty-\nfree, irrevocable (except for failure to satisfy the conditions of this\nlicense) patent license to make, have made, use, offer to sell, sell,\nimport, and otherwise transfer this software, where such license applies\nonly to those patent claims, already acquired or hereafter acquired,\nlicensable by such copyright holder or contributor that are necessarily\ninfringed by:\n\n(a) their Contribution(s) (the licensed copyrights of copyright holders\nand non-copyrightable additions of contributors, in source or binary\nform) alone; or\n\n(b) combination of their Contribution(s) with the work of authorship to\nwhich such Contribution(s) was added by such copyright holder or\ncontributor, if, at the time the Contribution is added, such addition\ncauses such combination to be necessarily infringed. The patent license\nshall not apply to any other combinations which include the\nContribution.\n\nExcept as expressly stated above, no rights or licenses from any\ncopyright holder or contributor is granted under this license, whether\nexpressly, by implication, estoppel or otherwise.\n\nDISCLAIMER\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\nIS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nHOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}