{
  "key": "bsd-export",
  "short_name": "BSD-Export",
  "name": "BSD-Export",
  "category": "Permissive",
  "owner": "Cavium",
  "spdx_license_key": "LicenseRef-scancode-bsd-export",
  "text_urls": [
    "https://download.juniper.net/disclosure/attributions/junos/10.4R1.9/disclosures.txt"
  ],
  "text": "Redistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n1. Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in the\ndocumentation and/or other materials provided with the distribution.\n3. {Copyright holder} name may not be used to endorse or promote products\nderived from this software without specific prior written permission.\n\nThis Software, including technical data, may be subject to U.S. export\ncontrol laws, including the U.S. Export Administration Act and its\nassociated regulations, and may be subject to export or import\nregulations in other countries. You warrant that You will comply\nstrictly in all respects with all such regulations and acknowledge that\nyou have the responsibility to obtain licenses to export, re-export or\nimport the Software.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, THE SOFTWARE IS PROVIDED \"AS IS\"\nAND WITH ALL FAULTS AND {Copyright holder} MAKES NO PROMISES, REPRESENTATIONS OR\nWARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE, WITH\nRESPECT TO THE SOFTWARE, INCLUDING ITS CONDITION, ITS CONFORMITY TO ANY\nREPRESENTATION OR DESCRIPTION, OR THE EXISTENCE OF ANY LATENT OR PATENT\nDEFECTS, AND {Copyright holder} SPECIFICALLY DISCLAIMS ALL IMPLIED (IF ANY)\nWARRANTIES OF TITLE, MERCHANTABILITY, NONINFRINGEMENT, FITNESS FOR A\nPARTICULAR PURPOSE, LACK OF VIRUSES, ACCURACY OR COMPLETENESS, QUIET\nENJOYMENT, QUIET POSSESSION OR CORRESPONDENCE TO DESCRIPTION. THE ENTIRE\nRISK ARISING OUT OF USE OR PERFORMANCE OF THE SOFTWARE LIES WITH YOU."
}