{
  "key": "bsd-protection",
  "short_name": "BSD Protection License",
  "name": "BSD Protection License",
  "category": "Copyleft",
  "owner": "FreeBSD",
  "homepage_url": "https://fedoraproject.org/wiki/Licensing/BSD_Protection_License",
  "spdx_license_key": "BSD-Protection",
  "text_urls": [
    "https://fedoraproject.org/wiki/Licensing/BSD_Protection_License"
  ],
  "text": "BSD Protection License\nFebruary 2002\n\nPreamble\n--------\n\nThe Berkeley Software Distribution (\"BSD\") license has proven very effective\nover the years at allowing for a wide spread of work throughout both\ncommercial and non-commercial products.  For programmers whose primary\nintention is to improve the general quality of available software, it is\narguable that there is no better license than the BSD license, as it\npermits improvements to be used wherever they will help, without\nidealogical or metallic constraint.\n\nThis is of particular value to those who produce reference\nimplementations of proposed standards: The case of TCP/IP clearly\nillustrates that freely and universally available implementations leads\nthe rapid acceptance of standards -- often even being used instead of a\nde jure standard (eg, OSI network models).\n\nWith the rapid proliferation of software licensed under the GNU General\nPublic License, however, the continued success of this role is called\ninto question.  Given that the inclusion of a few lines of \"GPL-tainted\"\nwork into a larger body of work will result in restricted distribution\n-- and given that further work will likely build upon the \"tainted\"\nportions, making them difficult to remove at a future date -- there are\ninevitable circumstances where authors would, in order to protect their\ngoal of providing for the widespread usage of their work, wish to guard\nagainst such \"GPL-taint\".\n\nIn addition, one can imagine that companies which operate by producing\nand selling (possibly closed-source) code would wish to protect\nthemselves against the rise of a GPL-licensed competitor.  While under\nexisting licenses this would mean not releasing their code under any\nform of open license, if a license existed under which they could\nincorporate any improvements back into their own (commercial) products\nthen they might be far more willing to provide for non-closed distribution.\n\nFor the above reasons, we put forth this \"BSD Protection License\": A\nlicense designed to retain the freedom granted by the BSD license to use\nlicensed works in a wide variety of settings, both non-commercial and\ncommercial, while protecting the work from having future contributors\nrestrict that freedom.\n\nThe precise terms and conditions for copying, distribution, and\nmodification follow.\n\nBSD PROTECTION LICENSE\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, AND MODIFICATION\n----------------------------------------------------------------\n\n0. Definitions.\n   a) \"Program\", below, refers to any program or work distributed under\n      the terms of this license.\n   b) A \"work based on the Program\", below, refers to either the Program\n      or any derivative work under copyright law.\n   c) \"Modification\", below, refers to the act of creating derivative\n      works.\n   d) \"You\", below, refers to each licensee.\n\n1. Scope.\n   This license governs the copying, distribution, and modification of\n   the Program.  Other activities are outside the scope of this\n   license; The act of running the Program is not restricted, and the\n   output from the Program is covered only if its contents constitute a\n   work based on the Program.\n\n2. Verbatim copies.\n   You may copy and distribute verbatim copies of the Program as you\n   receive it, in any medium, provided that you conspicuously and\n   appropriately publish on each copy an appropriate copyright notice;\n   keep intact all the notices that refer to this License and to the\n   absence of any warranty; and give any other recipients of the\n   Program a copy of this License along with the Program.\n\n3. Modification and redistribution under closed license.\n   You may modify your copy or copies of the Program, and distribute\n   the resulting derivative works, provided that you meet the\n   following conditions:\n   a) The copyright notice and disclaimer on the Program must be\n      reproduced and included in the source code, documentation, and/or\n      other materials provided in a manner in which such notices are\n      normally distributed.\n   b) The derivative work must be clearly identified as such, in order\n      that it may not be confused with the original work.\n   c) The license under which the derivative work is distributed must\n      expressly prohibit the distribution of further derivative works.\n\n4. Modification and redistribution under open license.\n   You may modify your copy or copies of the Program, and distribute\n   the resulting derivative works, provided that you meet the\n   following conditions:\n   a) The copyright notice and disclaimer on the Program must be\n      reproduced and included in the source code, documentation, and/or\n      other materials provided in a manner in which such notices are\n      normally distributed.\n   b) You must clearly indicate the nature and date of any changes made\n      to the Program.  The full details need not necessarily be\n      included in the individual modified files, provided that each\n      modified file is clearly marked as such and instructions are\n      included on where the full details of the modifications may be\n      found.\n   c) You must cause any work that you distribute or publish, that in\n      whole or in part contains or is derived from the Program or any\n      part thereof, to be licensed as a whole at no charge to all third\n      parties under the terms of this License.\n\n5. Implied acceptance.\n   You may not copy or distribute the Program or any derivative works\n   except as expressly provided under this license.  Consequently, any\n   such action will be taken as implied acceptance of the terms of this\n   license.\n\n6. NO WARRANTY.\n   THIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESS OR IMPLIED\n   WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n   MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n   DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER, OR ANY OTHER\n   PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED\n   ABOVE, BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n   EXEMPLARY, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR\n   INABILITY TO USE THE PROGRAM (INCLUDING, BUT NOT LIMITED TO,\n   PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n   PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\n   OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT, EVEN\n   IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\n   SUCH DAMAGES."
}