{
  "key": "bsd-original",
  "short_name": "BSD-Original",
  "name": "BSD-Original",
  "category": "Permissive",
  "owner": "Regents of the University of California",
  "homepage_url": "http://www.xfree86.org/3.3.6/COPYRIGHT2.html",
  "notes": "Per SPDX.org, this license was rescinded by the author on 22 July 1999.",
  "spdx_license_key": "BSD-4-Clause",
  "text_urls": [
    "http://www.xfree86.org/3.3.6/COPYRIGHT2.html#6"
  ],
  "osi_url": "http://www.opensource.org/licenses/bsd-license.php",
  "other_urls": [
    "http://directory.fsf.org/wiki/License:BSD_4Clause",
    "http://www.fsf.org/licensing/essays/bsd.html",
    "http://www.gnu.org/philosophy/bsd.html"
  ],
  "text": "Redistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice,\nthis list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation\nand/or other materials provided with the distribution.\n\n3. All advertising materials mentioning features or use of this software\nmust display the following acknowledgement: This product includes software\ndeveloped by the <organization>.\n\n4. Neither the name of the <organization> nor the names of its contributors\nmay be used to endorse or promote products derived from this software\nwithout specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY <COPYRIGHT HOLDER> ''AS IS'' AND ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO\nEVENT SHALL <COPYRIGHT HOLDER> BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,\nOR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}