{
  "key": "bsd-new",
  "short_name": "BSD-3-Clause",
  "name": "BSD-3-Clause",
  "category": "Permissive",
  "owner": "Regents of the University of California",
  "homepage_url": "http://www.opensource.org/licenses/BSD-3-Clause",
  "notes": "Per SPDX.org, this license is OSI certified.",
  "spdx_license_key": "BSD-3-Clause",
  "other_spdx_license_keys": [
    "LicenseRef-scancode-libzip"
  ],
  "osi_license_key": "BSD-3-Clause",
  "text_urls": [
    "http://www.opensource.org/licenses/BSD-3-Clause"
  ],
  "osi_url": "http://www.opensource.org/licenses/BSD-3-Clause",
  "other_urls": [
    "http://framework.zend.com/license/new-bsd",
    "https://opensource.org/licenses/BSD-3-Clause",
    "https://www.eclipse.org/org/documents/edl-v10.php"
  ],
  "text": "Redistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list\nof conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice, this\nlist of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n\nNeither the name of the ORGANIZATION nor the names of its contributors may be\nused to endorse or promote products derived from this software without specific\nprior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS\nBE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\nTHE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}