{
  "key": "cavium-linux-firmware",
  "short_name": "Cavium Linux Firmware License",
  "name": "Cavium Linux Firmware License",
  "category": "Proprietary Free",
  "owner": "Cavium",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.cavium",
  "spdx_license_key": "LicenseRef-scancode-cavium-linux-firmware",
  "other_urls": [
    "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.cavium_liquidio"
  ],
  "text": "Software License Agreement\n\nANY USE, REPRODUCTION, OR DISTRIBUTION OF THE ACCOMPANYING BINARY SOFTWARE\nCONSTITUTES LICENSEEE'S ACCEPTANCE OF THE TERMS AND CONDITIONS OF THIS AGREEMENT.\n\nLicensed Software. Subject to the terms and conditions of this Agreement,\nCavium, Inc. (\"Cavium\") grants to Licensee a worldwide, non-exclusive, and\nroyalty-free license to use, reproduce, and distribute the binary software in\nits complete and unmodified form as provided by Cavium.\n\nRestrictions. Licensee must reproduce the Cavium copyright notice above with\neach binary software copy. Licensee must not reverse engineer, decompile,\ndisassemble or modify in any way the binary software. Licensee must not use\nthe binary software in violation of any applicable law or regulation. This\nAgreement shall automatically terminate upon Licensee's breach of any term or\ncondition of this Agreement in which case, Licensee shall destroy all copies of\nthe binary software.\n\nWarranty Disclaimer.  THE LICENSED SOFTWARE IS OFFERED \"AS IS,\" AND CAVIUM\nGRANTS AND LICENSEE RECEIVES NO WARRANTIES OF ANY KIND, WHETHER EXPRESS,\nIMPLIED, STATUTORY, OR BY COURSE OF COMMUNICATION OR DEALING WITH LICENSEE, OR\nOTHERWISE.  CAVIUM AND ITS LICENSORS SPECIFICALLY DISCLAIM ANY IMPLIED\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, OR\nNONINFRINGEMENT OF THIRD PARTY RIGHTS, CONCERNING THE LICENSED SOFTWARE,\nDERIVATIVE WORKS, OR ANY DOCUMENTATION PROVIDED WITH THE FOREGOING.  WITHOUT\nLIMITING THE GENERALITY OF THE FOREGOING, CAVIUM DOES NOT WARRANT THAT THE\nLICENSED SOFTWARE IS ERROR-FREE OR WILL OPERATE WITHOUT INTERRUPTION, AND\nCAVIUM GRANTS NO WARRANTY REGARDING ITS USE OR THE RESULTS THEREFROM, INCLUDING\nITS CORRECTNESS, ACCURACY, OR RELIABILITY.\n\nLimitation of Liability. IN NO EVENT WILL LICENSEE, CAVIUM, OR ANY OF CAVIUM'S\nLICENSORS HAVE ANY LIABILITY HEREUNDER FOR ANY INDIRECT, SPECIAL, OR\nCONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\nFOR BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, ARISING OUT\nOF THIS AGREEMENT, INCLUDING DAMAGES FOR LOSS OF PROFITS, OR THE COST OF\nPROCUREMENT OF SUBSTITUTE GOODS, EVEN IF SUCH PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\nExport and Import Laws.  Licensee acknowledges and agrees that the Licensed\nSoftware (including technical data and related technology) may be controlled by\nthe export control laws, rules, regulations, restrictions and national security\ncontrols of the United States and other applicable foreign agencies (the\n\"Export Controls\"), and agrees not export or re-export, or allow the export or\nre-export of export-controlled the Licensed Software (including technical data\nand related technology) or any copy, portion or direct product of the foregoing\nin violation of the Export Controls. Licensee hereby represents that\n(i) Licensee is not an entity or person to whom provision of the Licensed\nSoftware (including technical data and related technology) is restricted or\nprohibited by the Export Controls; and (ii) Licensee will not export, re-export\nor otherwise transfer the export-controlled Licensed Software (including\ntechnical data and related technology) in violation of U.S. sanction programs\nor export control regulations to (a) any country, or  national or resident of\nany country, subject to a United States trade embargo, (b) any person or entity\nto whom shipment is restricted or prohibited by the Export Controls, or\n(c) anyone who is engaged in activities related to the design, development,\nproduction, or use of nuclear materials, nuclear facilities, nuclear weapons,\nmissiles or chemical or biological weapons."
}