{
  "key": "cc-by-nc-nd-2.0-au",
  "short_name": "CC-BY-NC-ND-2.0-AU",
  "name": "Creative Commons Attribution Non-Commercial No Derivatives License 2.0 Austrialis",
  "category": "Source-available",
  "owner": "Creative Commons",
  "homepage_url": "https://creativecommons.org/licenses/by-nc-nd/2.0/au/",
  "spdx_license_key": "LicenseRef-scancode-cc-by-nc-nd-2.0-au",
  "text_urls": [
    "https://creativecommons.org/licenses/by-nc-nd/2.0/legalcode.au"
  ],
  "text": "Attribution-NonCommercial-NoDerivs 2.0 Australia\n\n\nCREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\nLEGAL SERVICES. DISTRIBUTION OF THIS LICENCE DOES NOT CREATE AN\nATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION\nON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE\nINFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\nITS USE.\n\nLicence \n\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE\nCOMMONS PUBLIC LICENCE (\"CCPL\" OR \"LICENCE\"). THE WORK IS PROTECTED BY\nCOPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS\nAUTHORISED UNDER THIS LICENCE AND/OR APPLICABLE LAW IS PROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE\nTO BE BOUND BY THE TERMS OF THIS LICENCE. THE LICENSOR GRANTS YOU THE\nRIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS\nAND CONDITIONS.\n\n1. Definitions \n\n\"Collective Work\" means a work, such as a periodical issue, anthology or\nencyclopaedia, in which the Work in its entirety in unmodified form,\nalong with a number of other contributions, constituting separate and\nindependent works in themselves, are assembled into a collective whole.\nA work that constitutes a Collective Work will not be considered a\nDerivative Work (as defined below) for the purposes of this Licence.\n\n\"Derivative Work\" means a work that reproduces a substantial part of the\nWork, or of the Work and other pre-existing works protected by\ncopyright, or that is an adaptation of a Work that is a literary,\ndramatic, musical or artistic work. Derivative Works include a\ntranslation, musical arrangement, dramatisation, motion picture version,\nsound recording, art reproduction, abridgment, condensation, or any\nother form in which a work may be adapted, except that a work that\nconstitutes a Collective Work will not be considered a Derivative Work\nfor the purpose of this Licence. For the avoidance of doubt, where the\nWork is a musical composition or sound recording, the synchronization of\nthe Work in timed-relation with a moving image (\"synching\") will be\nconsidered a Derivative Work for the purpose of this Licence.\n\n\"Licensor\" means the individual or entity that offers the Work under the\nterms of this Licence. \n\n\"Moral rights law\" means laws under which an individual who creates a\nwork protected by copyright has rights of integrity of authorship of the\nwork, rights of attribution of authorship of the work, rights not to\nhave authorship of the work falsely attributed, or rights of a similar\nor analogous nature in the work anywhere in the world.\n\n\"Original Author\" means the individual or entity who created the Work. \n\n\"Work\" means the work or other subject-matter protected by copyright\nthat is offered under the terms of this Licence, which may include\n(without limitation) a literary, dramatic, musical or artistic work, a\nsound recording, cinematograph film, a published edition of a literary,\ndramatic, musical or artistic work or a television or sound broadcast.\n\n\"You\" means an individual or entity exercising rights under this Licence\nwho has not previously violated the terms of this Licence with respect\nto the Work, or who has received express permission from the Licensor to\nexercise rights under this Licence despite a previous violation.\n\n\"Licence Elements\" means the following high-level licence attributes as\nselected by Licensor and indicated in the title of this Licence:\nAttribution, NonCommercial, NoDerivatives, ShareAlike.\n\n2. Fair Dealing and Other Rights.\n\nNothing in this Licence excludes or modifies, or is intended to exclude\nor modify, (including by reducing, limiting, or restricting) the rights\nof You or others to use the Work arising from fair dealings or other\nlimitations on the rights of the copyright owner or the Original Author\nunder copyright law, moral rights law or other applicable laws.\n\n3. Licence Grant. \n\nSubject to the terms and conditions of this Licence, Licensor hereby\ngrants You a worldwide, royalty-free, non-exclusive, perpetual (for the\nduration of the applicable copyright) licence to exercise the rights in\nthe Work as stated below:\n\nto reproduce the Work, to incorporate the Work into one or more\nCollective Works, and to reproduce the Work as incorporated in the\nCollective Works;\n\nto publish, communicate to the public, distribute copies or records of,\nexhibit or display publicly, perform publicly and perform publicly by\nmeans of a digital audio transmission the Work including as incorporated\nin Collective Works;\n\nThe above rights may be exercised in all media and formats whether now\nknown or hereafter devised. The above rights include the right to make\nsuch modifications as are technically necessary to exercise the rights\nin other media and formats. All rights not expressly granted by Licensor\nunder this Licence are hereby reserved, including but not limited to the\nrights set forth in Sections 4(d) and 4(e).\n\n4. Restrictions. \n\nThe licence granted in Section 3 above is expressly made subject to and\nlimited by the following restrictions:\n\nYou may publish, communicate to the public, distribute, publicly exhibit\nor display, publicly perform, or publicly digitally perform the Work\nonly under the terms of this Licence, and You must include a copy of, or\nthe Uniform Resource Identifier for, this Licence with every copy or\nrecord of the Work You publish, communicate to the public, distribute,\npublicly exhibit or display, publicly perform or publicly digitally\nperform. You may not offer or impose any terms on the Work that exclude,\nalter or restrict the terms of this Licence or the recipients' exercise\nof the rights granted hereunder. You may not sublicense the Work. You\nmust keep intact all notices that refer to this Licence and to the\ndisclaimer of representations and warranties. You may not publish,\ncommunicate to the public, distribute, publicly exhibit or display,\npublicly perform, or publicly digitally perform the Work with any\ntechnological measures that control access or use of the Work in a\nmanner inconsistent with the terms of this Licence. The above applies to\nthe Work as incorporated in a Collective Work, but this does not require\nthe Collective Work apart from the Work itself to be made subject to the\nterms of this Licence. If You create a Collective Work, upon notice from\nany Licensor You must, to the extent practicable, remove from the\nCollective Work any reference to such Licensor or the Original Author,\nas requested.\n\nYou may not exercise any of the rights granted to You in Section 3 above\nin any manner that is primarily intended for or directed toward\ncommercial advantage or private monetary compensation. The exchange of\nthe Work for other copyrighted works by means of digital file-sharing or\notherwise shall not be considered to be intended for or directed toward\ncommercial advantage or private monetary compensation, provided there is\nno payment of any monetary compensation in connection with the exchange\nof copyrighted works.\n\nIf you publish, communicate to the public, distribute, publicly exhibit\nor display, publicly perform, or publicly digitally perform the Work or\nany Collective Works, You must keep intact all copyright notices for the\nWork. You must also give the Original Author clear and reasonably\nprominent credit, and (if applicable) that credit must be given in the\nparticular way made known by the Original Author and otherwise as\nreasonable to the medium or means You are utilizing, by conveying the\nidentity (such as by name or pseudonym if applicable) of the Original\nAuthor if supplied; the title of the Work if supplied; to the extent\nreasonably practicable, the Uniform Resource Identifier, if any, that\nLicensor specifies to be associated with the Work, unless such URI does\nnot refer to the copyright notice or licensing information for the Work.\nSuch credit may be implemented in any reasonable manner; provided,\nhowever, that in the case of a Collective Work, at a minimum such credit\nwill appear where any other comparable authorship credit appears and in\na manner at least as prominent as such other comparable authorship\ncredit.\n\nFor the avoidance of doubt, where the Work is a musical composition: \n\nPerformance Royalties Under Blanket Licences. Licensor reserves the\nexclusive right to collect, whether individually or via a performance\nrights society (e.g. ASCAP, BMI, SESAC), royalties for the communication\nto the public, broadcast, public performance or public digital\nperformance (e.g. webcast) of the Work if that performance is primarily\nintended for or directed toward commercial advantage or private monetary\ncompensation.\n\nMechanical Rights and Statutory Royalties. Licensor reserves the\nexclusive right to collect, whether individually or via a music rights\nagency, designated agent (e.g. Harry Fox Agency) or a music publisher,\nroyalties for any record You create from the Work (\"cover version\") and\ndistribute, subject to the compulsory licence created by 17 USC Section\n115 of the US Copyright Act (or an equivalent statutory licence under\nthe Australian Copyright Act or in other jurisdictions), if Your\ndistribution of such cover version is primarily intended for or directed\ntoward commercial advantage or private monetary compensation.\n\nWebcasting Rights and Statutory Royalties. For the avoidance of doubt,\nwhere the Work is a sound recording, Licensor reserves the exclusive\nright to collect, whether individually or via a performance-rights\nsociety (e.g. SoundExchange), royalties for the public digital\nperformance (e.g. webcast) of the Work, subject to the compulsory\nlicence created by 17 USC Section 114 of the US Copyright Act (or the\nequivalent in other jurisdictions), if Your public digital performance\nis primarily intended for or directed toward commercial advantage or\nprivate monetary compensation.\n\nFalse attribution prohibited. Except as otherwise agreed in writing by\nthe Licensor, if You publish, communicate to the public, distribute,\npublicly exhibit or display, publicly perform, or publicly digitally\nperform the Work or any Collective Works in accordance with this\nLicence, You must not falsely attribute the Work to someone other than\nthe Original Author.\n\nPrejudice to honour or reputation prohibited. Except as otherwise agreed\nin writing by the Licensor, if you publish, communicate to the public,\ndistribute, publicly exhibit or display, publicly perform, or publicly\ndigitally perform the Work or any Collective Works, You must not do\nanything that results in a material distortion of, the mutilation of, or\na material alteration to, the Work that is prejudicial to the Original\nAuthor's honour or reputation, and You must not do anything else in\nrelation to the Work that is prejudicial to the Original Author's honour\nor reputation.\n\n5. Disclaimer.\n\nEXCEPT AS EXPRESSLY STATED IN THIS LICENCE OR OTHERWISE MUTUALLY AGREED\nTO BY THE PARTIES IN WRITING, AND TO THE FULL EXTENT PERMITTED BY\nAPPLICABLE LAW, LICENSOR OFFERS THE WORK \"AS-IS\" AND MAKES NO\nREPRESENTATIONS, WARRANTIES OR CONDITIONS OF ANY KIND CONCERNING THE\nWORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT\nLIMITATION, ANY REPRESENTATIONS, WARRANTIES OR CONDITIONS REGARDING THE\nCONTENTS OR ACCURACY OF THE WORK, OR OF TITLE, MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE, NONINFRINGEMENT, THE ABSENCE OF LATENT OR\nOTHER DEFECTS, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT\nDISCOVERABLE.\n\n6. Limitation on Liability.\n\nTO THE FULL EXTENT PERMITTED BY APPLICABLE LAW, AND EXCEPT FOR ANY\nLIABILITY ARISING FROM CONTRARY MUTUAL AGREEMENT AS REFERRED TO IN\nSECTION 5, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL\nTHEORY (INCLUDING, WITHOUT LIMITATION, NEGLIGENCE) FOR ANY LOSS OR\nDAMAGE WHATSOEVER, INCLUDING (WITHOUT LIMITATION) LOSS OF PRODUCTION OR\nOPERATION TIME, LOSS, DAMAGE OR CORRUPTION OF DATA OR RECORDS; OR LOSS\nOF ANTICIPATED SAVINGS, OPPORTUNITY, REVENUE, PROFIT OR GOODWILL, OR\nOTHER ECONOMIC LOSS; OR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE\nOR EXEMPLARY DAMAGES ARISING OUT OF OR IN CONNECTION WITH THIS LICENCE\nOR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\nIf applicable legislation implies warranties or conditions, or imposes\nobligations or liability on the Licensor in respect of this Licence that\ncannot be wholly or partly excluded, restricted or modified, the\nLicensor's liability is limited, to the full extent permitted by the\napplicable legislation, at its option, to:\n\nin the case of goods, any one or more of the following:\n  \nthe replacement of the goods or the supply of equivalent goods;\nthe repair of the goods;\nthe payment of the cost of replacing the goods or of acquiring equivalent goods;\nthe payment of the cost of having the goods repaired; or\n\nin the case of services:\n\t\nthe supplying of the services again; or \nthe payment of the cost of having the services supplied again.\n\n\n7. Termination.\n\nThis Licence and the rights granted hereunder will terminate\nautomatically upon any breach by You of the terms of this Licence.\nIndividuals or entities who have received Collective Works from You\nunder this Licence, however, will not have their licences terminated\nprovided such individuals or entities remain in full compliance with\nthose licences. Sections 1, 2, 5, 6, 7, and 8 will survive any\ntermination of this Licence.\n\nSubject to the above terms and conditions, the licence granted here is\nperpetual (for the duration of the applicable copyright in the Work).\nNotwithstanding the above, Licensor reserves the right to release the\nWork under different licence terms or to stop distributing the Work at\nany time; provided, however that any such election will not serve to\nwithdraw this Licence (or any other licence that has been, or is\nrequired to be, granted under the terms of this Licence), and this\nLicence will continue in full force and effect unless terminated as\nstated above.\n\n8. Miscellaneous.\n\nEach time You publish, communicate to the public, distribute or publicly\ndigitally perform the Work or a Collective Work, the Licensor offers to\nthe recipient a licence to the Work on the same terms and conditions as\nthe licence granted to You under this Licence.\n\nIf any provision of this Licence is invalid or unenforceable under\napplicable law, it shall not affect the validity or enforceability of\nthe remainder of the terms of this Licence, and without further action\nby the parties to this agreement, such provision shall be reformed to\nthe minimum extent necessary to make such provision valid and\nenforceable.\n\nNo term or provision of this Licence shall be deemed waived and no\nbreach consented to unless such waiver or consent shall be in writing\nand signed by the party to be charged with such waiver or consent.\n\nThis Licence constitutes the entire agreement between the parties with\nrespect to the Work licensed here. To the full extent permitted by\napplicable law, there are no understandings, agreements or\nrepresentations with respect to the Work not specified here. Licensor\nshall not be bound by any additional provisions that may appear in any\ncommunication from You. This Licence may not be modified without the\nmutual written agreement of the Licensor and You.\n\nThe construction, validity and performance of this Licence shall be\ngoverned by the laws in force in New South Wales, Australia."
}