{
  "key": "cc-by-nc-nd-2.0-at",
  "language": "de",
  "short_name": "CC-BY-NC-ND-2.0-AT",
  "name": "Creative Commons Namensnennung - Nicht-kommerziell - Keine Bearbeitung 2.0",
  "category": "Free Restricted",
  "owner": "Creative Commons",
  "homepage_url": "https://creativecommons.org/licenses/by-nc-nd/2.0/",
  "spdx_license_key": "LicenseRef-scancode-cc-by-nc-nd-2.0-at",
  "text_urls": [
    "https://creativecommons.org/licenses/by-nc-nd/2.0/legalcode.at"
  ],
  "text": "Namensnennung - Nicht-kommerziell - Keine Bearbeitung 2.0\n\n\nCREATIVE COMMONS IST KEINE RECHTSANWALTSGESELLSCHAFT UND LEISTET KEINE RECHTSBERATUNG. DIE WEITERGABE DIESES LIZENZENTWURFES FÜHRT ZU KEINEM MANDATSVERHÄLTNIS. CREATIVE COMMONS ERBRINGT DIESE INFORMATIONEN OHNE GEWÄHR. CREATIVE COMMONS ÜBERNIMMT KEINE GEWÄHRLEISTUNG FÜR DIE GELIEFERTEN INFORMATIONEN UND SCHLIEßT DIE HAFTUNG FÜR SCHÄDEN AUS, DIE SICH AUS IHREM GEBRAUCH ERGEBEN.\n\nLizenzvertrag\nDAS URHEBERRECHTLICH GESCHÜTZTE WERK ODER DER SONSTIGE SCHUTZGEGENSTAND (WIE UNTEN BESCHRIEBEN) WIRD UNTER DEN BEDINGUNGEN DIESER CREATIVE COMMONS PUBLIC LICENSE (\"CCPL\" ODER \"LIZENZVERTRAG\") ZUR VERFÜGUNG GESTELLT. DER SCHUTZGEGENSTAND IST DURCH DAS URHEBERRECHT UND/ODER EINSCHLÄGIGE GESETZE GESCHÜTZT.\nDURCH DIE AUSÜBUNG EINER DURCH DIESEN LIZENZVERTRAG ERTEILTEN BEFUGNIS ERKLÄREN SIE SICH MIT DEN LIZENZBEDINGUNGEN RECHTSVERBINDLICH EINVERSTANDEN. DER LIZENZGEBER ERTEILT IHNEN DIE HIER BESCHRIEBENE NUTZUNGSBEWILLIGUNG UNTER DER VORAUSSETZUNG, DASS SIE SICH MIT DIESEN VERTRAGSBEDINGUNGEN EINVERSTANDEN ERKLÄREN.\n1. Definitionen\n\nUnter einer \"Bearbeitung\" wird eine Übersetzung oder andere Bearbeitung des Werkes verstanden, die eine eigentümliche geistige Schöpfung von Ihnen ist bzw eine Übersetzung oder andere Bearbeitung eines anderen urheberrechtlichen Schutzgegenstandes als einem Werk, wenn diese zu einem eigenen Schutzrecht führt. Eine freie Benutzung eines Werkes wird nicht als Bearbeitung angesehen.\n\nUnter den \"Lizenzelementen\" werden\ndie folgenden Lizenzcharakteristika verstanden, die vom Lizenzgeber ausgewählt und  in der Bezeichnung  der Lizenz genannt werden: \"Namensnennung\", \"Nicht-kommerziell\", \"Weitergabe unter gleichen Bedingungen\".\nUnter dem \"Lizenzgeber\" wird die natürliche oder juristische Person verstanden, die den Schutzgegenstand unter den Bedingungen dieser Lizenz anbietet.\nUnter einem  \"Sammelwerk\" wird eine Sammlung verstanden, die infolge der Zusammenstellung einzelner Beiträge zu einem einheitlichen Ganzen eine eigentümliche geistige Schöpfung darstellt. Darunter fallen auch Sammlungen von Werken, Daten oder anderen unabhängigen Elementen, die systematisch oder methodisch angeordnet und einzeln mit elektronischen Mitteln oder auf andere Weise zugänglich sind, wenn sie infolge der Auswahl oder Anordnung des Stoffes eine eigentümliche geistige Schöpfung sind (Datenbankwerke). Ein Sammelwerk wird im Zusammenhang mit dieser Lizenz nicht als Bearbeitung (wie oben beschrieben) angesehen.\n\n\nMit \"SIE\" und \"Ihnen\" ist die natürliche oder juristische Person gemeint, die die in dieser Lizenz erteilte Nutzungsbewilligung (Befugnisse) ausübt und die zuvor die Bedingungen dieser Lizenz im Hinblick auf das Werk nicht verletzt hat, oder die die ausdrückliche Erlaubnis des Lizenzgebers erhalten hat, die durch diese Lizenz erteilte Nutzungsbewilligung trotz einer vorherigen Verletzung auszuüben.\nUnter dem  \"Schutzgegenstand\" wird das Werk oder Sammelwerk oder das Schutzobjekt eines verwandten Schutzrechts verstanden, das Ihnen unter den Bedingungen dieser Lizenz angeboten wird.\n\nUnter dem \"Urheber\" wird die natürliche Person verstanden, die das Werk geschaffen hat.\n\n\n\nUnter einem \"verwandten Schutzrecht\" wird das Recht an einem anderen urheberrechtlichen Schutzgegenstand als einem Werk verstanden, zum Beispiel einem nachgelassenen Werk, einem Lichtbild, einer Datenbank, einem Schallträger, einer Rundfunksendung, einem Laufbild oder einer Darbietung eines ausübenden Künstlers.\nUnter dem \"Werk\" wird eine eigentümliche geistige Schöpfung verstanden, die Ihnen unter den Bedingungen dieser Lizenz angeboten wird.\n\n2. Schranken des Urheberrechts. Diese Lizenz lässt sämtliche Rechte unberührt, die sich aus den Beschränkungen der Verwertungsrechte, aus dem Erschöpfungsgrundsatz oder anderen Beschränkungen der Ausschließlichkeitsrechte des Rechtsinhabers durch die Anwendung findenden Gesetze ergeben.\n3. Lizenzierung. Unter den Bedingungen dieses Lizenzvertrages erteilt Ihnen der Lizenzgeber eine unentgeltliche, räumlich und zeitlich (für die Dauer des Urheberrechts oder verwandten Schutzrechts) unbeschränkte, nicht-ausschließliche Nutzungsbewilligung, den Schutzgegenstand in der folgenden Art und Weise zu nutzen:\n\nden Schutzgegenstand in körperlicher Form zu verwerten, insbesondere zu vervielfältigen und zu verbreiten;\nden Schutzgegenstand in unkörperlicher Form öffentlich wiederzugeben, insbesondere zu senden, weiterzusenden, vorzutragen, aufzuführen, vorzuführen und öffentlich zur Verfügung zu stellen;\nden Schutzgegenstand auf Bild- oder Schallträger festzuhalten und mit dem Bild- oder Schallträger auf die in 3 a. oder b. erlaubte Weise zu verfahren.\n\n\nDie in diesem Lizenzvertrag erteilte Nutzungsbewilligung kann für alle bekannten Nutzungsarten ausgeübt werden. Die genannte Nutzungsbewilligung beinhaltet die Befugnis, solche Veränderungen an dem Werk vorzunehmen, die technisch erforderlich sind, um die Nutzungsbewilligung für alle Nutzungsarten wahrzunehmen. Insbesondere sind davon die Anpassung an andere Medien und auf andere Dateiformate umfasst.\n4. Beschränkungen. Die Erteilung der Nutzungsbewilligung gemäß Ziffer 3 erfolgt ausdrücklich nur unter den folgenden Bedingungen:\n\nSie dürfen den Schutzgegenstand ausschließlich unter den Bedingungen dieser Lizenz vervielfältigen, verbreiten oder im Sinne von Ziffer 3.b. dieses Vertrags öffentlich wiedergeben und Sie müssen stets eine Kopie oder die vollständige Internetadresse in Form des Uniform-Resource-Identifier (URI) dieser Lizenz beifügen, wenn Sie den Schutzgegenstand vervielfältigen, verbreiten oder im Sinne von Ziffer 3.b. dieses Vertrags öffentlich wiedergeben. Sie dürfen keine Vertragsbedingungen anbieten oder fordern, die die Bedingungen dieser Lizenz oder die durch sie gewährten Befugnisse ändern oder beschränken. Sie dürfen den Schutzgegenstand nicht unterlizenzieren. Sie müssen alle Hinweise unverändert lassen, die auf diese Lizenz und den Haftungs- und/oder Gewährleistungsausschluss hinweisen. Sie dürfen den Schutzgegenstand mit keinen technischen Schutzmaßnahmen versehen, die den Zugang oder den Gebrauch des Schutzgegenstandes in einer Weise kontrollieren, die mit den Bedingungen dieser Lizenz im Widerspruch stehen. Die genannten Beschränkungen gelten auch für den Fall, dass der Schutzgegenstand einen Bestandteil eines Sammelwerkes bildet; sie verlangen aber nicht, dass das Sammelwerk insgesamt zum Gegenstand dieser Lizenz gemacht wird. Wenn Sie ein Sammelwerk erstellen, müssen Sie - soweit dies praktikabel ist - auf die Aufforderung eines Lizenzgebers oder Urhebers hin aus dem Sammelwerk jeglichen Hinweis auf diesen Lizenzgeber oder diesen Urheber entfernen.\n\nSie dürfen die in Ziffer 3 erteilten Befugnisse in keiner Weise verwenden, die überwiegend auf einen geschäftlichen Vorteil oder eine vertraglich geschuldete geldwerte Vergütung abzielt oder darauf gerichtet ist.\nWenn Sie den Schutzgegenstand oder ein Sammelwerk vervielfältigen, verbreiten oder im Sinne von Ziffer 3.b. dieses Vertrags öffentlich wiedergeben, müssen Sie alle Urhebervermerke für den Schutzgegenstand unverändert lassen und die Urheberschaft oder Rechtsinhaberschaft in einer der von Ihnen vorgenommenen Nutzung angemessenen Form anerkennen, indem Sie den Namen (oder das Pseudonym, falls ein solches verwendet wird) des Urhebers oder Rechtsinhabers nennen, wenn dieser angegeben ist. Dies gilt auch für den Titel des Schutzgegenstandes, wenn dieser angegeben ist, sowie - in einem vernünftigerweise durchführbaren Umfang - für die mit dem Schutzgegenstand zu verbindende vollständige Internetadresse in Form des Uniform-Resource-Identifier (URI), wie sie der Lizenzgeber angegeben hat, sofern dies geschehen ist, es sei denn, diese Internetadresse verweist nicht auf den Urhebervermerk oder die Lizenzinformationen zu dem Schutzgegenstand.\nObwohl die gemäß Ziffer 3 erteilten Befugnisse in umfassender Weise ausgeübt werden dürfen, findet diese Erlaubnis ihre gesetzliche Grenze in den Persönlichkeitsrechten sowie im Schutz der berechtigten geistigen Interessen der Urheber und ausübenden Künstler, die nicht dadurch gefährdet werden dürfen, dass ein Schutzgegenstand über das gesetzlich zulässige Maß hinaus beeinträchtigt wird.\n5. Gewährleistung.\nSofern dies von den Vertragsparteien nicht schriftlich anders vereinbart wurde, bietet der Lizenzgeber keine Gewährleistung für die in diesem Lizenzvertrag erteilte Nutzungsbewilligung. Für Mängel anderer Art, insbesondere bei der mangelhaften Lieferung von Verkörperungen des Schutzgegenstandes, richtet sich die Gewährleistung nach der Regelung, die die Person, die Ihnen den Schutzgegenstand zur Verfügung stellt, mit Ihnen außerhalb der Lizenz vereinbart, oder - wenn eine solche Regelung nicht getroffen wurde - nach den gesetzlichen Vorschriften.\n6. Haftung. Über die in Ziffer 5 genannte Gewährleistung hinaus haftet Ihnen der Lizenzgeber bezüglich Schäden, die in Verbindung mit der Erteilung der Nutzungsbewilligung entstehen, nur für Vorsatz. Für Geschäfte zwischen Unternehmern und Verbrauchern im Sinne des österreichischen Konsumentenschutzgesetzes gilt die Abweichung, dass nur die Haftung für leichte Fahrlässigkeit bei anderen Schäden als Personenschäden ausgeschlossen ist.\n7. Vertragsende\n\nDieser Lizenzvertrag und die durch diesen erteilten Befugnisse enden automatisch bei jeder Verletzung der Vertragsbedingungen durch Sie. Die Ziffern 1, 2, 5, 6, 7 und 8 gelten bei einer Vertragsbeendigung fort.\nUnter den oben genannten Bedingungen erfolgt die Lizenz dauerhaft (für die Dauer des Urheberrechts oder verwandten Schutzrechts). Dennoch behält sich der Lizenzgeber das Recht vor, den Schutzgegenstand unter anderen Lizenzbedingungen zu nutzen oder die eigene Weitergabe des Schutzgegenstandes jederzeit zu beenden, vorausgesetzt, dass solche Handlungen nicht dem Widerruf dieser Lizenz dienen (oder jeder anderen Lizenzierung, die auf Grundlage dieser Lizenz erfolgt ist oder erfolgen muss) und diese Lizenz wirksam bleibt, bis sie unter den oben genannten Voraussetzungen endet.\n8. Schlussbestimmungen\n\nJedes Mal, wenn Sie den Schutzgegenstand vervielfältigen, verbreiten oder im Sinne von Ziffer 3.b. dieses Vertrags öffentlich wiedergeben, bietet der Lizenzgeber dem Erwerber eine Lizenz für den Schutzgegenstand unter denselben Vertragsbedingungen an, unter denen er Ihnen die Lizenz erteilt hat.\nSollte eine Bestimmung dieses Lizenzvertrages unwirksam sein, so wird die Wirksamkeit der übrigen Lizenzbestimmungen dadurch nicht berührt und an die Stelle der unwirksamen Bestimmung tritt die wirksame Bestimmung, die dem mit der unwirksamen Bestimmung angestrebten Zweck am nächsten kommt.\nNichts soll dahingehend ausgelegt werden, dass auf eine Bestimmung dieses Lizenzvertrages verzichtet oder einer Vertragsverletzung zugestimmt wird, so lange ein solcher Verzicht oder eine solche Zustimmung nicht schriftlich vorliegt und von der verzichtenden oder zustimmenden Vertragspartei unterschrieben ist.\nDieser Lizenzvertrag stellt die vollständige Vereinbarung zwischen den Vertragsparteien hinsichtlich des Schutzgegenstandes dar. Es gibt keine weiteren ergänzenden Vereinbarungen oder mündlichen Abreden im Hinblick auf den Schutzgegenstand. Der Lizenzgeber ist an keine zusätzlichen Abreden gebunden, die aus irgendeiner Absprache mit Ihnen entstehen könnten. Der Lizenzvertrag kann nicht ohne eine übereinstimmende schriftliche Vereinbarung zwischen dem Lizenzgeber und Ihnen abgeändert werden.\nAuf diesen Lizenzvertrag findet das Recht der Bundesrepublik Österreich Anwendung.\n\n« Zurück zu Commons Deed"
}