{
  "key": "cecill-1.0",
  "language": "fr",
  "short_name": "CeCILL 1.0",
  "name": "CeCILL Free Software License Agreement v1.0",
  "category": "Copyleft",
  "owner": "CeCILL",
  "homepage_url": "http://www.cecill.info/licences/Licence_CeCILL_V1-fr.html",
  "spdx_license_key": "CECILL-1.0",
  "text_urls": [
    "http://www.cecill.info/licences/Licence_CeCILL_V1-fr.txt"
  ],
  "other_urls": [
    "http://www.cecill.info/licences/Licence_CeCILL_V1-US.html",
    "http://www.cecill.info/licences/Licence_CeCILL_V1.1-US.html"
  ],
  "text": "                CONTRAT DE LICENCE DE LOGICIEL LIBRE CeCILL\n                ===========================================\n\n\nAvertissement\n-------------\n\nCe contrat est une licence de logiciel libre issue d'une concertation  entre\nses auteurs afin que le respect  de  deux  grands  principes  préside  à  sa\nrédaction :\n   - d'une part, sa conformité au droit français, tant au regard du droit de\n     la responsabilité civile que du droit de la  propriété  intellectuelle\n     et de la protection qu'il offre aux auteurs et titulaires  des  droits\n     patrimoniaux sur un logiciel.\n   - d'autre part, le respect des principes de diffusion des logiciels\n     libres : accès au code  source, droits étendus conférés aux\n     utilisateurs.\n\nLes auteurs de la cette licence CeCILL (Ce : CEA, C : CNRS, I : INRIA, LL :\nLogiciel Libre) sont :\n\nCommissariat à l'Energie Atomique - CEA, établissement public  de  caractère\nscientifique technique et industriel, dont le siège est situé 31-33  rue  de\nla Fédération, 75752 PARIS cedex 15.\n\nCentre National de la Recherche Scientifique - CNRS, établissement public  à\ncaractère scientifique et technologique, dont  le  siège  est  situé  3  rue\nMichel-Ange 75794 Paris cedex 16.\n\nInstitut National de Recherche en Informatique  et  en  Automatique - INRIA,\nétablissement public à caractère  scientifique  et  technologique,  dont  le\nsiège est situé Domaine de Voluceau, Rocquencourt, BP 105, 78153 Le  Chesnay\ncedex.\n\n\nPREAMBULE\n---------\n\nCe contrat est  une  licence  de  logiciel  libre  dont  l'objectif  est  de\nconférer aux utilisateurs la liberté de modification  et  de  redistribution\ndu logiciel régi par cette licence dans le cadre d'un  modèle  de  diffusion\n« open source » fondée sur le droit français.\n\nL'exercice de ces libertés est assorti de certains devoirs à la  charge  des\nutilisateurs afin de  préserver  ce  statut  au  cours  des  redistributions\nultérieures.\n\nL'accessibilité au code source et les droits de copie,  de  modification  et\nde redistribution qui en découlent ont pour  contrepartie  de  n'offrir  aux\nutilisateurs qu'une garantie limitée et de ne faire peser  sur  l'auteur  du\nlogiciel, le titulaire des droits patrimoniaux et les concédants  successifs\nqu'une responsabilité restreinte.\n\nA cet égard  l'attention  de  l'utilisateur  est  attirée  sur  les  risques\nassociés  au  chargement,  à  l'utilisation,  à  la  modification  et/ou  au\ndéveloppement et à la  reproduction  du  logiciel  par  l'utilisateur  étant\ndonné sa spécificité de logiciel  libre,  qui  peut  le  rendre  complexe  à\nmanipuler et qui le réserve donc à des développeurs  et  des  professionnels\navertis  possédant  des  connaissances   informatiques   approfondies.   Les\nutilisateurs sont donc invités à charger et tester l'adéquation du  Logiciel\nà leurs besoins dans des conditions  permettant  d'assurer  la  sécurité  de\nleurs systèmes et ou de leurs données et, plus  généralement,  à  l'utiliser\net l'exploiter dans les même conditions de sécurité. Ce  contrat  peut  être\nreproduit et diffusé librement, sous réserve  de  le  conserver  en  l'état,\nsans ajout ni suppression de clauses.\n\nCe contrat est susceptible de s'appliquer à tout logiciel dont le  titulaire\ndes droits patrimoniaux décide de soumettre l'exploitation aux  dispositions\nqu'il  contient.\n\n\nArticle 1er - DEFINITIONS\n-------------------------\n\nDans ce contrat, les termes suivants,  lorsqu'ils  seront  écrits  avec  une\nlettre capitale, auront la signification suivante :\n\nContrat : désigne le présent contrat de licence,  ses  éventuelles  versions\npostérieures avenants et annexes.\n\nLogiciel : désigne le logiciel sous sa forme de Code  Objet  et/ou  de  Code\nSource et le cas échéant sa documentation,  dans  leur  état  au  moment  de\nl'acceptation du Contrat par le Licencié.\n\nLogiciel Initial : désigne  le Logiciel sous sa forme de Code Source  et  de\nCode Objet et le cas échéant sa documentation, dans leur état au  moment  de\nleur première diffusion sous les termes du Contrat.\n\nLogiciel  Modifié :  désigne  le  Logiciel  modifié   par   au   moins   une\nContribution.\n\nCode  Source :  désigne  l'ensemble  des  instructions  et  des  lignes   de\nprogramme du Logiciel et auquel l'accès est nécessaire en  vue  de  modifier\nle Logiciel.\n\nCode Objet : désigne les fichiers binaires issus de la compilation  du  Code\nSource.\n\nTitulaire : désigne le détenteur des droits  patrimoniaux  d'auteur  sur  le\nLogiciel Initial.\n\nLicencié(s) : désigne le ou les utilisateur(s) du Logiciel ayant accepté  le\nContrat.\n\nContributeur : désigne le Licencié auteur d'au moins une Contribution.\n\nConcédant : désigne le  Titulaire  ou  toute  personne  physique  ou  morale\ndistribuant le Logiciel sous le Contrat.\n\nContributions :   désigne   l'ensemble   des   modifications,   corrections,\ntraductions, adaptations et/ou nouvelles fonctionnalités intégrées  dans  le\nLogiciel par tout Contributeur, ainsi que les Modules Statiques.\n\nModule :  désigne  un  ensemble  de  fichiers   sources   y   compris   leur\ndocumentation qui,  une  fois  compilé  sous  forme  exécutable,  permet  de\nréaliser des fonctionnalités ou services supplémentaires à ceux fournis  par\nle Logiciel.\n\nModule  Dynamique :  désigne  tout  Module,  créé   par   le   Contributeur,\nindépendant du Logiciel, tel que ce Module et le Logiciel  sont  sous  forme\nde deux exécutables indépendants qui s'exécutent dans un espace  d'adressage\nindépendant, l'un appelant l'autre au moment de leur exécution.\n\nModule Statique : désigne tout Module créé par le  Contributeur  et  lié  au\nLogiciel par un lien statique rendant  leur code  objet  dépendant  l'un  de\nl'autre. Ce Module et le Logiciel auquel il est lié, sont  regroupés  en  un\nseul exécutable.\n\nParties : désigne collectivement le Licencié et le Concédant.\n\nCes termes s'entendent au singulier comme au pluriel.\n\n\nArticle 2 - OBJET\n-----------------\n\nLe Contrat a pour objet la concession par le  Concédant  au  Licencié  d'une\nLicence non exclusive,  transférable  et  mondiale  du  Logiciel  telle  que\ndéfinie ci-après à l'article 5 pour toute la durée de protection des  droits\nportant sur ce Logiciel.\n\n\nArticle 3 - ACCEPTATION\n-----------------------\n\n3.1. L'acceptation par  le  Licencié  des  termes  du  Contrat  est  réputée\nacquise du fait du premier des faits suivants :\n-  (i)  le  chargement  du  Logiciel  par  tout   moyen   notamment   par\n   téléchargement à partir d'un  serveur  distant  ou  par  chargement  à\n   partir d'un support physique ;\n- (ii) le premier exercice par le Licencié de l'un quelconque des  droits\n  concédés par le Contrat.\n\n3.2. Un exemplaire du Contrat, contenant notamment un avertissement  relatif\naux spécificités  du  Logiciel,  à  la  restriction  de  garantie  et  à  la\nlimitation à un  usage  par  des  utilisateurs  expérimentés  a  été  mis  à\ndisposition du Licencié préalablement à son acceptation telle que définie  à\nl'article  3.1  ci  dessus   et  le  Licencié  reconnaît   en   avoir   pris\nconnaissances.\n\n\nArticle 4 - ENTREE EN VIGUEUR ET DUREE\n--------------------------------------\n\n4.1. ENTREE EN VIGUEUR\n\nLe Contrat entre en vigueur à la date de son  acceptation  par  le  Licencié\ntelle que définie en 3.1.\n\n4.2. DUREE\n\nLe Contrat produira ses effets pendant toute la durée légale  de  protection\ndes droits patrimoniaux portant sur le Logiciel.\n\n\nArticle 5 - ETENDUE DES DROITS CONCEDES\n---------------------------------------\n\nLe Concédant concède au Licencié, qui accepte, les droits  suivants  sur  le\nLogiciel pour toutes destinations et pour  la  durée  du  Contrat  dans  les\nconditions ci-après détaillées.\n\nPar ailleurs, le Concédant concède au Licencié à titre gracieux  les  droits\nd'exploitation du ou des brevets qu'il  détient  sur  toute  ou  partie  des\ninventions implémentées dans le Logiciel.\n\n5.1. DROITS D'UTILISATION\n\nLe Licencié est autorisé à utiliser le Logiciel, sans restriction quant  aux\ndomaines d'application, étant ci-après précisé que cela comporte :\n- la reproduction permanente ou provisoire du Logiciel en tout ou partie\n  par tout moyen et sous toute forme.\n- le chargement, l'affichage, l'exécution, ou le stockage du Logiciel\n  sur tout support.\n- la  possibilité  d'en  observer,  d'en  étudier,  ou  d'en  tester  le\n  fonctionnement afin de déterminer les idées et principes qui sont à la\n  base de n'importe quel élément de ce Logiciel ; et  ceci,  lorsque  le\n  Licencié  effectue  toute  opération   de   chargement,   d'affichage,\n  d'exécution, de transmission ou de stockage du Logiciel qu'il  est  en\n  droit d'effectuer en vertu du Contrat.\n\n5.2. DROIT D'APPORTER DES CONTRIBUTIONS\n\nLe droit  d'apporter  des  Contributions  comporte  le  droit  de  traduire,\nd'adapter, d'arranger ou d'apporter toute autre modification du Logiciel  et\nle droit de reproduire le Logiciel en résultant.\n\nLe Licencié est autorisé à apporter  toute  Contribution  au  Logiciel  sous\nréserve de mentionner, de façon explicite, son  nom  en  tant  qu'auteur  de\ncette Contribution et la date de création de celle-ci.\n\n5.3. DROITS DE DISTRIBUTION ET DE DIFFUSION\n\nLe droit de distribution et de diffusion  comporte  notamment  le  droit  de\ntransmettre et de  communiquer le Logiciel au public  sur  tout  support  et\npar tout moyen ainsi que le droit de mettre sur le marché  à  titre  onéreux\nou gratuit, un ou des exemplaires du Logiciel par tout procédé.\nLe Licencié est autorisé à redistribuer des copies du Logiciel,  modifié  ou\nnon, à des tiers dans les conditions ci-après détaillées.\n\n5.3.1. REDISTRIBUTION DU LOGICIEL SANS MODIFICATION\n\nLe Licencié est autorisé à redistribuer des copies conformes du Logiciel,\nsous forme de Code Source ou de Code Objet, à condition que cette\nredistribution respecte les dispositions du Contrat dans leur totalité et\nsoit accompagnée :\n- d'un exemplaire du Contrat,\n- d'un  avertissement  relatif  à  la  restriction  de  garantie  et  de\n  responsabilité du Concédant telle que prévue aux articles 8 et 9,\net que, dans le cas où seul le Code Objet du Logiciel  est  redistribué,  le\nLicencié permette aux futurs Licenciés d'accéder facilement au  Code  Source\ncomplet du Logiciel en indiquant les modalités d'accès,  étant  entendu  que\nle coût additionnel d'acquisition du Code Source ne  devra  pas  excéder  le\nsimple coût de transfert des données.\n\n5.3.2. REDISTRIBUTION DU LOGICIEL MODIFIE\n\nLorsque le Licencié apporte une Contribution au Logiciel, les conditions  de\nredistribution du Logiciel Modifié sont alors soumises à  l'intégralité  des\ndispositions du Contrat.\n\nLe Licencié est autorisé à redistribuer le Logiciel Modifié, sous  forme  de\nCode Source ou de Code Objet, à condition que cette redistribution  respecte\nles dispositions du Contrat dans leur totalité et soit accompagnée :\n- d'un exemplaire du Contrat,\n- d'un  avertissement  relatif  à  la  restriction  de  garantie  et  de\n  responsabilité du  concédant telle que prévue aux articles 8 et 9,\net que, dans  le  cas  où  seul  le  Code  Objet  du  Logiciel  Modifié  est\nredistribué, le Licencié permette aux futurs Licenciés d'accéder  facilement\nau Code Source complet  du  Logiciel  Modifié  en  indiquant  les  modalités\nd'accès, étant entendu que le coût additionnel d'acquisition du Code  Source\nne devra pas excéder le simple coût de transfert des données.\n\n5.3.3. redistribution des MODULES DYNAMIQUES\n\nLorsque le Licencié a  développé  un  Module  Dynamique  les  conditions  du\nContrat ne s'appliquent pas à ce Module Dynamique, qui peut  être  distribué\nsous un contrat de licence différent.\n\n5.3.4. COMPATIBILITE AVEC LA LICENCE GPL\n\nDans le cas où le Logiciel, Modifié ou non, est intégré  à  un  code  soumis\naux dispositions de la licence GPL, le Licencié est autorisé à  redistribuer\nl'ensemble sous la licence GPL.\n\nDans le cas où le Logiciel Modifié intègre un code soumis  aux  dispositions\nde la licence GPL, le Licencié  est  autorisé  à  redistribuer  le  Logiciel\nModifié sous la licence GPL.\n\n\nArticle 6 - PROPRIETE INTELLECTUELLE\n------------------------------------\n\n6.1. SUR LE LOGICIEL INITIAL\n\nLe Titulaire est détenteur des droits patrimoniaux sur le Logiciel  Initial.\nToute utilisation du Logiciel Initial est soumise au respect des  conditions\ndans lesquelles le Titulaire a choisi de diffuser son oeuvre  et  nul  autre\nn'a la faculté de  modifier  les  conditions  de  diffusion  de  ce Logiciel \nInitial.\n\nLe  Titulaire  s'engage  à maintenir la diffusion du  Logiciel initial  sous\nles  conditions du Contrat et ce, pour la durée visée à l'article 4.2.\n\n6.2. SUR LES CONTRIBUTIONS\n\nLes droits de propriété intellectuelle sur les Contributions  sont  attachés\nau titulaire de droits patrimoniaux désignés par la législation applicable.\n\n6.3. SUR LES MODULES DYNAMIQUES\n\nLe Licencié ayant développé un Module Dynamique est titulaire des droits  de\npropriété intellectuelle sur ce Module Dynamique et reste libre du choix  du\ncontrat régissant sa diffusion.\n\n6.4. DISPOSITIONS COMMUNES\n\n6.4.1. Le Licencié s'engage expressément :\n- à ne pas supprimer ou modifier de quelque  manière  que  ce  soit  les\n  mentions de propriété intellectuelle apposées sur le Logiciel;\n- à  reproduire  à   l'identique   lesdites   mentions   de   propriété\n  intellectuelle sur les copies du Logiciel.\n\n6.4.2. Le Licencié  s'engage  à  ne  pas  porter  atteinte,  directement  ou\nindirectement, aux droits de propriété  intellectuelle  du  Titulaire  et/ou\ndes Contributeurs et à prendre, le cas échéant, à l'égard de  son  personnel\ntoutes les mesures nécessaires pour assurer le respect des  dits  droits  de\npropriété intellectuelle du Titulaire et/ou des Contributeurs.\n\n\nArticle 7 - SERVICES ASSOCIES\n-----------------------------\n\n7.1. Le Contrat n'oblige en aucun cas  le  Concédant  à  la  réalisation  de\nprestations d'assistance technique ou de maintenance du Logiciel.\n\nCependant le Concédant reste libre de proposer  ce  type  de  services.  Les\ntermes et conditions d'une telle  assistance  technique  et/ou  d'une  telle\nmaintenance seront alors déterminés  dans  un  acte  séparé.  Ces  actes  de\nmaintenance  et/ou  assistance   technique   n'engageront   que   la   seule\nresponsabilité du Concédant qui les propose.\n\n7.2. De  même,  tout  Concédant  est  libre  de  proposer,  sous  sa   seule\nresponsabilité, à ses licenciés une garantie, qui n'engagera que  lui,  lors\nde la redistribution du Logiciel et/ou du Logiciel Modifié et ce,  dans  les\nconditions qu'il souhaite. Cette garantie et les  modalités  financières  de\nson application feront l'objet d'un acte séparé entre  le  Concédant  et  le\nLicencié.\n\n\nArticle 8 - RESPONSABILITE\n--------------------------\n\n8.1. Sous réserve  des  dispositions  de  l'article  8.2,  si  le  Concédant\nn'exécute pas tout ou partie des  obligations  mises  à  sa  charge  par  le\nContrat, le Licencié a la faculté, sous  réserve  de  prouver  la  faute  du\nConcédant concerné, de solliciter la réparation du  préjudice  direct  qu'il\nsubit et dont il apportera la preuve.\n\n8.2. La responsabilité du Concédant est  limitée  aux  engagements  pris  en\napplication du Contrat et ne saurait être  engagée\nen raison  notamment :(i)  des  dommages  dus  à  l'inexécution,  totale  ou\npartielle, de ses obligations par le Licencié, (ii) des dommages directs  ou\nindirects découlant de l'utilisation ou des performances du  Logiciel  subis\npar le Licencié lorsqu'il s'agit d'un professionnel utilisant le Logiciel  à\ndes fins professionnelles et  (iii)  des  dommages  indirects  découlant  de\nl'utilisation ou des  performances  du  Logiciel.  Les  Parties  conviennent\nexpressément que tout préjudice financier ou commercial (par  exemple  perte\nde données, perte de bénéfices, perte d'exploitation, perte de clientèle  ou\nde commandes, manque à gagner,  trouble  commercial  quelconque)  ou   toute\naction dirigée contre  le  Licencié  par  un  tiers,  constitue  un  dommage\nindirect et n'ouvre pas droit à réparation par le Concédant.\n\n\nArticle 9 - GARANTIE\n--------------------\n\n9.1. Le   Licencié   reconnaît   que   l'état   actuel   des   connaissances\nscientifiques et techniques au moment de la mise en circulation du  Logiciel\nne permet pas d'en tester et d'en vérifier toutes  les  utilisations  ni  de\ndétecter l'existence d'éventuels défauts.  L'attention  du  Licencié  a  été\nattirée  sur  ce  point  sur  les  risques   associés   au   chargement,   à\nl'utilisation, la modification et/ou au développement et à  la  reproduction\ndu Logiciel qui sont réservés à des utilisateurs avertis.\n\nIl relève de la responsabilité du Licencié de contrôler,  par  tous  moyens,\nl'adéquation du  produit  à  ses  besoins,  son  bon  fonctionnement  et  de\ns'assurer qu'il ne causera pas de dommages aux personnes et aux biens.\n\n9.2. Le Concédant déclare de bonne foi être en droit de concéder  l'ensemble\ndes droits attachés au Logiciel (comprenant notamment  les  droits  visés  à\nl'article 5).\n\n9.3. Le Licencié reconnaît que le Logiciel est fourni  « en l'état » par  le\nConcédant sans autre garantie,  expresse  ou  tacite,  que  celle  prévue  à\nl'article 9.2 et notamment sans aucune garantie sur sa  valeur  commerciale,\nson caractère sécurisé, innovant ou pertinent.\n\nEn particulier, le Concédant ne garantit pas  que  le  Logiciel  est  exempt\nd'erreur, qu'il fonctionnera sans interruption, qu'il sera  compatible  avec\nl'équipement du Licencié et sa configuration logicielle  ni  qu'il  remplira\nles besoins du Licencié.\n\n9.4. Le Concédant ne garantit pas, de manière expresse  ou  tacite,  que  le\nLogiciel  ne  porte  pas  atteinte  à  un  quelconque  droit  de   propriété\nintellectuelle d'un tiers portant sur un brevet, un  logiciel  ou  sur  tout\nautre droit de propriété. Ainsi,  le  Concédant  exclut  toute  garantie  au\nprofit du Licencié contre les actions en  contrefaçon  qui  pourraient  être\ndiligentées au  titre  de  l'utilisation,  de  la  modification,  et  de  la\nredistribution du Logiciel. Néanmoins, si de telles  actions  sont  exercées\ncontre le Licencié,  le  Concédant  lui  apportera  son  aide  technique  et\njuridique pour sa défense. Cette aide technique et juridique est  déterminée\nau cas par cas entre le Concédant concerné et  le  Licencié  dans  le  cadre\nd'un protocole d'accord. Le Concédant dégage toute  responsabilité  quant  à\nl'utilisation de  la  dénomination  du  Logiciel  par  le  Licencié.  Aucune\ngarantie n'est apportée quant à l'existence de droits antérieurs sur le  nom\ndu Logiciel et sur l'existence d'une marque.\n\n\nArticle 10  - RESILIATION\n-------------------------\n\n10.1. En cas de manquement par  le  Licencié  aux  obligations  mises  à  sa\ncharge par le Contrat, le  Concédant  pourra  résilier  de  plein  droit  le\nContrat trente (30) jours après notification adressée au Licencié et  restée\nsans effet.\n\n10.2. Le Licencié  dont  le  Contrat  est  résilié  n'est  plus  autorisé  à\nutiliser,  modifier  ou  distribuer  le  Logiciel.  Cependant,  toutes   les\nLicences licences qu'il aura concédées antérieurement à  la  résiliation  du\nContrat resteront valides sous réserve  qu'elles  aient  été  effectuées  en\nconformité avec le Contrat.\n\n\nArticle 11 - DISPOSITIONS DIVERSES\n----------------------------------\n\n11.1. CAUSE EXTERIEURE\n\nAucune des Parties ne sera responsable  d'un  retard  ou  d'une  défaillance\nd'exécution du Contrat qui serait dû à un  cas  de  force  majeure,  un  cas\nfortuit  ou  une  cause  extérieure,  telle  que,  notamment,   le   mauvais\nfonctionnement  ou  les   interruptions   du   réseau   électrique   ou   de\ntélécommunication, la paralysie du réseau liée à une  attaque  informatique,\nl'intervention des autorités gouvernementales, les catastrophes  naturelles,\nles dégâts des eaux, les tremblements de terre, le feu, les explosions,  les\ngrèves et les conflits sociaux, l'état de guerre.\n\n11.2. Le fait, par l'une  ou  l'autre  des  Parties,  d'omettre  en  une  ou\nplusieurs occasions de se  prévaloir  d'une  ou  plusieurs  dispositions  du\nContrat, ne pourra  en  aucun  cas  impliquer  renonciation  par  la  Partie\nintéressée à s'en prévaloir ultérieurement.\n\n11.3. Le Contrat annule et remplace toute convention antérieure,  écrite  ou\norale, entre les Parties sur le même  objet  et  constitue  l'accord  entier\nentre les Parties sur cet objet. Aucune addition ou modification aux  termes\ndu Contrat n'aura d'effet à l'égard des Parties à  moins  d'être  faite  par\nécrit et signée par leurs représentants dûment habilités.\n\n11.4. Dans l'hypothèse où une  ou  plusieurs  des  dispositions  du  Contrat\ns'avèrerait contraire à une loi ou  à  un  texte  applicable,  existants  ou\nfuturs, cette loi ou ce texte  prévaudrait,  et  les  Parties  feraient  les\namendements nécessaires pour se conformer à cette loi ou à ce texte.  Toutes\nles autres dispositions resteront en vigueur.  De  même,  la  nullité,  pour\nquelque raison que ce soit, d'une des dispositions  du  Contrat  ne  saurait\nentraîner la nullité de l'ensemble du Contrat.\n\n11.5. LANGUE\n\nLe Contrat est rédigé en langue française et en langue anglaise. En  cas  de\ndivergence d'interprétation, seule la version française fait foi.\n\n\nArticle 12 - NOUVELLES VERSIONS DU CONTRAT\n------------------------------------------\n\n12.1. Toute personne est autorisée à copier et distribuer des copies  de  ce\nContrat.\n\n12.2. Afin d'en préserver la cohérence, le texte du Contrat est  protégé  et\nne peut être modifié  que  par  les  auteurs  de  la  licence,  lesquels  se\nréservent le droit  de  publier  périodiquement  des  mises  à  jour  ou  de\nnouvelles versions du Contrat, qui possèderont chacune un  numéro  distinct.\nCes versions  ultérieures  seront  susceptibles  de  prendre  en  compte  de\nnouvelles problématiques rencontrées par les logiciels libres.\n\n12.3. Tout Logiciel diffusé sous une version donnée  du  Contrat  ne  pourra\nfaire l'objet d'une  diffusion  ultérieure  que  sous  la  même  version  du\nContrat ou  une  version  postérieure,  sous  réserve  des  dispositions  de\nl'article 5.3.4.\n\n\nArticle 13 - LOI APPLICABLE ET COMPETENCE TERRITORIALE\n------------------------------------------------------\n\n13.1. Le Contrat est régi par la loi française. Les Parties  conviennent  de\ntenter de régler à l'amiable les différends ou litiges qui viendraient à  se\nproduire par suite ou à l'occasion du Contrat.\n\n13.2. A défaut d'accord amiable dans un délai de deux (2) mois à compter  de\nleur survenance et sauf situation relevant d'une  procédure  d'urgence,  les\ndifférends ou litiges seront portés par la Partie la plus  diligente  devant\nles Tribunaux compétents de Paris.\n\n\n\n                                                      Version 1 du 21/06/2004"
}