{
  "key": "charmpp-2019",
  "short_name": "Charm++ Software License 2019",
  "name": "Charm++ Software License 2019",
  "category": "Proprietary Free",
  "owner": "NCSA - University of Illinois",
  "homepage_url": "https://github.com/charmplusplus/charm/blob/046c0b5b4231a2e2c1dc20e55d7fe02668356b36/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-charmpp-2019",
  "ignorable_copyrights": [
    "Copyright 2019 The Board of Trustees of the University of Illinois"
  ],
  "ignorable_holders": [
    "The Board of Trustees of the University of Illinois"
  ],
  "ignorable_authors": [
    "the Parallel Programming Laboratory research group"
  ],
  "ignorable_urls": [
    "http://charm.cs.illinois.edu/research/charm"
  ],
  "ignorable_emails": [
    "info@hpccharm.com",
    "kale@illinois.edu",
    "otm@illinois.edu"
  ],
  "text": "Non-Commercial Non-Exclusive License for Charm++ Software\n\nThe Software (as defined below) will only be licensed to You (as\ndefined below) upon the condition that You accept all of the terms and\nconditions contained in this license agreement (\"License\").  Please\nread this License carefully. By downloading and using the Software,\nYou accept the terms and conditions of this License.\n\n1 Definitions.  \n\n  1.1 \"Illinois\" means The Board of Trustees of the University of\n      Illinois.\n \n  1.2 \"Software\" means the Charm++/Converse parallel programming \n      software source code and object code.\n\n  1.3 \"You\" (or \"Your\") means an individual or legal entity exercising\n      rights under, and complying with all of the terms of, this\n      License.  For legal entities, \"You\" includes any entity that\n      controls, is controlled by, or is under common control with\n      You. For purposes of this License, \"control\" means ownership,\n      directly or indirectly, of more than fifty percent (50%) of the\n      equity capital of the legal entity.\n\n2 License Grant.  Subject to Your compliance with the terms and\n  conditions of this License, Illinois on behalf of Prof. Sanjay\n  Kale's Parallel Programming Laboratory (PPL) group in the Department\n  of Computer Science, hereby grants You a non-commercial,\n  non-exclusive, non-transferable, royalty-free, restrictive license\n  to download, use, and create derivative works of the Software for\n  academic and research purposes only.\n\nLicense Restrictions.  Any uses of Software or Software derivative\nworks beyond those granted in Section 2 above require a separate for a\nfee license.  To negotiate a license with additional rights, You may\ncontact Illinois at the Office of Technology Management at\notm@illinois.edu or Charmworks, Inc. at info@hpccharm.com.\n\n3 The following are some of the restricted use cases:\n\n  3.1 Integration of all or part of the Software or Software\n      derivative works into a product for sale, lease or license by or\n      on behalf of You to third parties; or\n\n  3.2 Distribution of all or part of the Software or Software\n      derivative works to third parties for any reason, including for\n      commercializing products sold or licensed by or on behalf of\n      You, except for contributing changes to Software;\n\n  3.3 Use of Software or Software derivative works for internal\n      commercial purposes.  \n\n  3.4 For avoidance of doubt, You may at Your own expense, create and\n      freely distribute Your works that interoperate with the\n      Software, directing the users of such works to license and\n      download the Software itself from Illinois' site at\n      http://charm.cs.illinois.edu/research/charm.\n\n4 Derivative works: You may at Your own expense, modify the Software\n  to make derivative works as outlined in Section 2.  Any derivative\n  work should be clearly marked and renamed to notify users that it is\n  a modified version and not the original Software distributed by\n  Illinois.  You agree to reproduce the copyright notice per Section 7\n  and other proprietary markings on any derivative work and to include\n  in the documentation of such work the acknowledgement: \"This\n  software includes code developed by Parallel Programming Laboratory\n  research group in the Department of Computer Science, at the\n  University of Illinois at Urbana-Champaign.\"\n\n5 Contributing derivative works: Software is being freely distributed\n  as a research and teaching tool and as such, PPL research group\n  encourages feedback and contributions from users of the code that\n  might, at Illinois' sole discretion, be used or incorporated to make\n  the basic operating framework of the Software a more stable,\n  flexible, and/or useful product.  If You wish to contribute Your\n  code to become an internal portion of the Software:\n\n  5.1 You agree that such code may be distributed by Illinois under\n      the terms of this License; and\n\n  5.2 You may be required to sign an \"Agreement Regarding Contributory\n      Code for Charm++ Software\" (contact kale@illinois.edu), before\n      Illinois can accept it.\n\n6 Acknowledgment.  \n\n  6.1 You shall own the results obtained by using the outputs of\n      Software and Software derivative works. If You publish such\n      results, You shall acknowledge the use of Software and its\n      derivative works by the appropriate citation as follows:\n      \"Charm++ software was developed by the Parallel Programming\n      Laboratory research group in the Department of Computer Science\n      at the University of Illinois at Urbana-Champaign.\"\n\n 6.2 Any published work, which utilizes Software, shall include the\n     following the references listed in the file named CITATION.cff \n     in the distribution.\n\n 6.3 Electronic documents will include a direct link to the official\n\t Software page at http://charm.cs.illinois.edu/research/charm.\n\n7 Copyright Notices.  All copies of the Software or derivative works\n  shall include the following copyright notice: \"Copyright 2019 The\n  Board of Trustees of the University of Illinois. All rights\n  reserved.\"\n\n8 Confidential Information. You acknowledge that the Software is\n  proprietary to Illinois.  You agree to protect the Software from\n  unauthorized disclosure, use, or release and to treat the Software\n  with at least the same level of care as You use to protect Your own\n  proprietary software and/or confidential information, but in no\n  event less than a reasonable standard of care.  If You become aware\n  of any unauthorized licensing, copying or use of the Software, You\n  shall promptly notify Illinois in writing at otm@illinois.edu.\n\n9 Limitation of Warranties. Limitation of\n  Liability. Indemnification. THIS SOFTWARE IS PROVIDED \"AS IS\" AND\n  ILLINOIS MAKES NO REPRESENTATIONS AND EXTENDS NO WARRANTIES OF ANY\n  KIND, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO\n  WARRANTIES OR MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE,\n  OR THAT THE USE OF THE SOFTWARE AND DERIVATIVE WORKS WILL NOT\n  INFRINGE ANY PATENT, TRADEMARK, OR OTHER RIGHTS.  YOU ASSUME THE\n  ENTIRE RISK AS TO THE RESULTS AND PERFORMANCE OF THE SOFTWARE AND/OR\n  DERIVATIVE WORKS.  YOU AGREE THAT ILLINOIS SHALL NOT BE HELD LIABLE\n  FOR ANY DIRECT, INDIRECT, CONSEQUENTIAL, OR INCIDENTAL DAMAGES WITH\n  RESPECT TO ANY CLAIM BY YOU OR ANY THIRD PARTY ON ACCOUNT OF OR\n  ARISING FROM THIS LICENSE OR USE OF THE SOFTWARE AND/OR DERIVATIVE\n  WORKS.  YOU SHALL INDEMNIFY AND HOLD HARMLESS ILLINOIS (INCLUDING\n  ITS TRUSTEES, FELLOWS, OFFICERS, EMPLOYEES, STUDENTS, AND AGENTS)\n  AGAINST ANY AND ALL CLAIMS, LOSSES, DAMAGES, AND/OR LIABILITY, AS\n  WELL AS COSTS AND EXPENSES (INCLUDING LEGAL EXPENSES AND REASONABLE\n  ATTORNEYS' FEES) ARISING OUT OF OR RELATED TO YOUR USE, OR INABILITY\n  TO USE, THE SOFTWARE OR SOFTWARE DERIVATIVE WORKS, REGARDLESS OF\n  THEORY OF LIABILITY, WHETHER FOR BREACH OR IN TORT (INCLUDING\n  NEGLIGENCE).\n\n10 Termination.\n\n   10.1 This License is effective until terminated, as provided\n        herein, or until all intellectual property rights in the\n        Software expire.\n\n   10.2 You may terminate this License at any time by destroying all\n        copies of the Software and its derivative works.\n\n   10.3 This License, and the rights granted hereunder, will terminate\n        automatically, and without any further notice from or action\n        by Illinois, if You fail to comply with any obligation of this\n        License.\n\n   10.4 Upon termination, You must immediately cease use of and destroy\n     \tall copies of the Software and its derivative works and verify\n     \tsuch destruction in writing.\n\n   10.5 The provisions set forth in Sections 5, 9, 11, 12, 13, 14, 15\n        shall survive termination or expiration of this License.\n\n11 Governing Law. By using this Software, You agree to abide by the\n   laws of the State of Illinois and all other applicable laws of the\n   U.S, including, but not limited to, export control laws, copyright\n   law and the terms of this License.\n\n12 Severability.  If any provision of this License is held to be\n   invalid or unenforceable by a court of competent jurisdiction, such\n   invalidity or unenforceability shall not in any way affect the\n   validity or enforceability of the remaining provisions.\n\n13 Assignment.  You may not assign or otherwise transfer any of Your\n   rights or obligations under this License, without the prior written\n   consent of Illinois.\n\n14 Entire License.  This License represents the parties' entire\n   agreement relating to the Software.  Except as otherwise provided\n   herein, no modification of this License is binding unless in\n   writing and signed by an authorized representative of each party.\n\n15 Waiver.  The failure of either party to enforce any provision of\n   this License shall not constitute a waiver of that right or future\n   enforcement of that or any other provision.\n\nApproved for legal form Illinois Counsel SJA 10/18\n\nUniversity Technology No. TF08023 Commercial Non-Exclusive Software License"
}