{
  "key": "charmpp-converse-2017",
  "short_name": "Charm++/Converse License 2017",
  "name": "Charm++/Converse License 2017",
  "category": "Proprietary Free",
  "owner": "NCSA - University of Illinois",
  "homepage_url": "https://github.com/charmplusplus/charm4py/blob/fb67656fc0f39773c567fcc4181fbf76429fe5ab/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-charmpp-converse-2017",
  "ignorable_authors": [
    "the Parallel Programming Laboratory"
  ],
  "ignorable_urls": [
    "http://charm.cs.illinois.edu/"
  ],
  "ignorable_emails": [
    "kale@illinois.edu"
  ],
  "text": "Charm++/Converse License\n\nUniversity of Illinois\n\nUniversity of Illinois\nCharm++/Converse Parallel Programming System Software\nNon-Exclusive, Non-Commercial Use License\n\nUpon execution of this Agreement by the party identified below (\"Licensee\"),\nThe Board of Trustees of the University of Illinois  (\"Illinois\"), on behalf of\nThe Parallel Programming Laboratory (\"PPL\") in the Department of Computer\nScience, will provide the Charm++/Converse Parallel Programming System software\n(\"Charm++\") in Binary Code and/or Source Code form (\"Software\") to Licensee,\nsubject to the following terms and conditions. For purposes of this Agreement,\nBinary Code is the compiled code, which is ready to run on Licensee's computer.\nSource code consists of a set of files which contain the actual program\ncommands that are compiled to form the Binary Code.\n\n1. The Software is intellectual property owned by Illinois, and all right,\ntitle and interest, including copyright, remain with Illinois.  Illinois\ngrants, and Licensee hereby accepts, a restricted, non-exclusive,\nnon-transferable license to use the Software for academic, research and\ninternal business purposes only, e.g. not for commercial use (see Clause 7\nbelow), without a fee.\n\n2. Licensee may, at its own expense, create and freely distribute complimentary\nworks that interoperate with the Software, directing others to the PPL server\n(http://charm.cs.illinois.edu) to license and obtain the Software itself. Licensee\nmay, at its own expense, modify the Software to make derivative works.  Except\nas explicitly provided below, this License shall apply to any derivative work\nas it does to the original Software distributed by Illinois.  Any derivative\nwork should be clearly marked and renamed to notify users that it is a modified\nversion and not the original Software distributed by Illinois.  Licensee agrees\nto reproduce the copyright notice and other proprietary markings on any\nderivative work and to include in the documentation of such work the\nacknowledgment:\n\n\"This software includes code developed by the Parallel Programming Laboratory\nin the Department of Computer Science at the University of Illinois at\nUrbana-Champaign.\"\n\nLicensee may redistribute without restriction works with up to 1/2 of their\nnon-comment source code derived from at most 1/10 of the non-comment source\ncode developed by Illinois and contained in the Software, provided that the\nabove directions for notice and acknowledgment are observed.  Any other\ndistribution of the Software or any derivative work requires a separate license\nwith Illinois.  Licensee may contact Illinois (kale@illinois.edu) to negotiate\nan appropriate license for such distribution.\n\n3. Except as expressly set forth in this Agreement, THIS SOFTWARE IS PROVIDED\n\"AS IS\" AND ILLINOIS MAKES NO REPRESENTATIONS AND EXTENDS NO WARRANTIES OF ANY\nKIND, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO WARRANTIES OR\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, OR THAT THE USE OF THE\nSOFTWARE WILL NOT INFRINGE ANY PATENT, TRADEMARK, OR OTHER RIGHTS.  LICENSEE\nASSUMES THE ENTIRE RISK AS TO THE RESULTS AND PERFORMANCE OF THE SOFTWARE\nAND/OR ASSOCIATED MATERIALS.  LICENSEE AGREES THAT UNIVERSITY SHALL NOT BE HELD\nLIABLE FOR ANY DIRECT, INDIRECT, CONSEQUENTIAL, OR INCIDENTAL DAMAGES WITH\nRESPECT TO ANY CLAIM BY LICENSEE OR ANY THIRD PARTY ON ACCOUNT OF OR ARISING\nFROM THIS AGREEMENT OR USE OF THE SOFTWARE AND/OR ASSOCIATED MATERIALS.\n\n4. Licensee understands the Software is proprietary to Illinois. Licensee\nagrees to take all reasonable steps to insure that the Software is  protected\nand secured from unauthorized disclosure, use, or release and  will treat it\nwith at least the same level of care as Licensee would use to  protect and\nsecure its own proprietary computer programs and/or information, but using no\nless than a reasonable standard of care.  Licensee agrees to provide the\nSoftware only to any other person or entity who has registered with Illinois.\nIf licensee is not registering as an individual but as an institution or\ncorporation each member of the institution or corporation who has access to or\nuses Software must agree to and abide by the terms of this license. If Licensee\nbecomes aware of any unauthorized licensing, copying or use of the Software,\nLicensee shall promptly notify Illinois in writing. Licensee expressly agrees\nto use the Software only in the manner and for the specific uses authorized in\nthis Agreement.\n\n5. By using or copying this Software, Licensee agrees to abide by the\ncopyright law and all other applicable laws of the U.S. including, but not\nlimited to, export control laws and the terms of this license. Illinois  shall\nhave the right to terminate this license immediately by written  notice upon\nLicensee's breach of, or non-compliance with, any terms of the license.\nLicensee may be held legally responsible for any  copyright infringement that\nis caused or encouraged by its failure to  abide by the terms of this license.\nUpon termination, Licensee agrees to  destroy all copies of the Software in its\npossession and to verify such  destruction in writing.\n\n6. The user agrees that any reports or published results obtained with  the\nSoftware will acknowledge its use by the appropriate citation as  follows:\n\n\"Charm++/Converse was developed by the Parallel Programming Laboratory in the\nDepartment of Computer Science at the University of  Illinois at\nUrbana-Champaign.\"\n\nAny published work which utilizes Charm++ shall include the following\nreference:\n\n\"L. V. Kale and S. Krishnan. Charm++: Parallel Programming with Message-Driven\nObjects. In 'Parallel Programming using C++' (Eds. Gregory V. Wilson and Paul\nLu), pp 175-213, MIT Press, 1996.\"\n\nAny published work which utilizes Converse shall include the following\nreference:\n\n\"L. V. Kale, Milind Bhandarkar, Narain Jagathesan, Sanjeev Krishnan and Joshua\nYelon. Converse: An Interoperable Framework for Parallel Programming.\nProceedings of the 10th International Parallel Processing Symposium, pp\n212-217, April 1996.\"\n\nElectronic documents will include a direct link to the official Charm++ page\nat http://charm.cs.illinois.edu/\n\n7. Commercial use of the Software, or derivative works based thereon,  REQUIRES\nA COMMERCIAL LICENSE.  Should Licensee wish to make commercial use of the\nSoftware, Licensee will contact Illinois (kale@illinois.edu) to negotiate an\nappropriate license for such use. Commercial use includes: \n(1) integration of all or part of the Software into a product for sale, lease\nor license by or on behalf of Licensee to third parties, or \n(2) distribution of the Software to third parties that need it to commercialize\nproduct sold or licensed by or on behalf of Licensee.\n\n8. Government Rights. Because substantial governmental funds have been  used in\nthe development of Charm++/Converse, any possession, use or sublicense of the\nSoftware by or to the United States government shall be subject to such\nrequired restrictions.\n\n9. Charm++/Converse is being distributed as a research and teaching tool and as\nsuch, PPL encourages contributions from users of the code that might, at\nIllinois' sole discretion, be used or incorporated to make the basic  operating\nframework of the Software a more stable, flexible, and/or useful  product.\nLicensees who contribute their code to become an internal  portion of the\nSoftware agree that such code may be distributed by  Illinois under the terms\nof this License and may be required to sign an  \"Agreement Regarding\nContributory Code for Charm++/Converse Software\" before Illinois  can accept it\n(contact kale@illinois.edu for a copy).\n\nUNDERSTOOD AND AGREED.\n\n\nContact Information:\n\nThe best contact path for licensing issues is by e-mail to  kale@illinois.edu or\nsend correspondence to:\n\nProf. L. V. Kale\nDept. of Computer Science\nUniversity of Illinois\n201, N. Goodwin Ave.,\nUrbana, Illinois 61801 USA\nFAX: (217) 265-4035"
}