{
  "key": "classic-vb",
  "short_name": "Classic VB License",
  "name": "Classic VB License",
  "category": "Permissive",
  "owner": "Karl Peterson",
  "homepage_url": "http://vb.mvps.org/license.asp",
  "spdx_license_key": "LicenseRef-scancode-classic-vb",
  "text_urls": [
    "http://vb.mvps.org/license.asp"
  ],
  "text": "Policy\n\nAll code samples, tools, articles, and other content provided by this website is\nconsidered to be protected by United States and international copyright law. It\nis provided for the educational use of site visitors. Free license is hereby\ngranted to use the code provided and techniques discussed here within your\napplications. You are not licensed to share any of the samples, or other content\non this website, in any form of mass distribution. Specifically,\n\nyou may not repost on other websites material(s) found here,\n\nyou may not sell compilation CDs or DVDs that contain material taken directly\nfrom this website,\n\nyou may provide modules found here, as source, within applications delivered to\nyour clients provided they agree to the same policies stated here and that you\nboth retain the embedded copyright notice(s),\n\nyou may email samples you consider cool to your friends, if you tell them where\nyou found them,\n\nyou may cite this site and its owner in the credits for your application, if you\nwish,\n\nyou may choose to donate to support this website, if material found here has\nsaved you time/money.\n\nCopyright violations will be pursued vigorously.\n\nRationale\n\nThis site is intended to be a benefit to the community of Classic VB developers.\nCode provided here is subject to continual update, as site visitors report bugs,\nand fixes are found. Having a single source for this codebase allows folks to\nalways know where they can turn to find the latest and presumably greatest. This\nway, if you have downloaded code from this site, and it isn't behaving in a\nreasonable manner, the first thing you can do is return to see if it's been\nupdated recently.\n\nWhen the contents of this site are redistributed elsewhere, I lose control over\nversioning, and inevitably end up with emails asking about bugs fixed long ago.\nIt really is easier for everyone to have a single source. The policy stated here\nisn't meant to be a hindrance to visitors, and if you find it so it's very\nlikely I haven't explained it well enough.\n\nIf you find problems with code here, or wonder about licensing and\nredistribution, please let me know!\n\nThanks for understanding...\n\nExceptions\n\nYou're probably thinking, \"Yeah, but maybe if I email him and ask really nice,\n... , after all, my posting to the internet will absolutely benefit all\nhumanity, and I stand to gain nothing personally, and yadda yadda yadda...\" I\nknow. A million good causes, and a free sample to go with each. Well, yeah, I\nreally do mean, and want to stick with, what I wrote above. I'm very glad you\nlike my code, so much so that you want to repost it somewhere else. I'd really\nprefer you didn't do that. I do appreciate your understanding.\n\nDisclaimer\n\nMicrosoft is in no way affiliated with, nor offering endorsement of, this site.\nIt happens that we used to share a common interest in certain topics, but that's\nthe extent of the relationship with regard to what's presented here.\n\nAll software offered on this site is considered to work, but no liability is\nassumed by the author(s). As a developer yourself, it is assumed you realize\nthat sample code is just that. It is your responsibility to use what you find\nhere responsibly."
}