{
  "key": "clearthought-2.0",
  "short_name": "Clearthought Software License v2.0",
  "name": "Clearthought Software License v2.0",
  "category": "Proprietary Free",
  "owner": "Daniel Barbalace",
  "homepage_url": "https://github.com/nerro/table-layout/blob/v4.3.0/src/main/resources/META-INF/LICENCE",
  "spdx_license_key": "LicenseRef-scancode-clearthought-2.0",
  "other_urls": [
    "https://tablelayout.dev.java.net",
    "https://github.com/nerro/table-layout/blob/v4.3.0/README.md#conclusion"
  ],
  "ignorable_urls": [
    "https://tablelayout.dev.java.net/"
  ],
  "text": "The Clearthought Software License, Version 2.0\n\nI. Terms for redistribution of original source and binaries\n\nRedistribution and use of unmodified source and/or binaries are\npermitted provided that the following condition is met:\n\n 1. Redistributions of original source code must retain the above\n    copyright notice and license.  You are not required to redistribute\n    the original source; you may choose to redistribute only the\n    binaries.\n\nBasically, if you distribute unmodified source, you meet\nautomatically comply with the license with no additional effort on\nyour part.\n\nII. Terms for distribution of derived works via subclassing and/or\n    composition.\n\nYou may generate derived works by means of subclassing and/or\ncomposition (e.g., the Adaptor Pattern), provided that the following\nconditions are met:\n\n 1. Redistributions of original source code must retain the above\n    copyright notice and license.  You are not required to redistribute\n    the original source; you may choose to redistribute only the\n    binaries.\n\n 2. The original software is not altered.\n\n 3. Derived works are not contained in the info.clearthought\n    namespace/package or any subpackage of info.clearthought.\n\n 4. Derived works do not use the class or interface names from the\n    info.clearthought... packages\n\nFor example, you may define a class with the following full name:\n    org.nameOfMyOrganization.layouts.RowMajorTableLayout\n\nHowever, you may not define a class with the either of the\nfollowing full names:\n    info.clearthought.layout.RowMajorTableLayout\n    org.nameOfMyOrganization.layouts.TableLayout\n\nIII. Terms for redistribution of source modified via patch files.\n\nYou may generate derived works by means of patch files provided\nthat the following conditions are met:\n\n 1. Redistributions of original source code must retain the above\n    copyright notice and license.  You are not required to\n    redistribute the original source; you may choose to redistribute\n    only the binaries resulting from the patch files.\n\n 2. The original source files are not altered.  All alteration is\n    done in patch files.\n\n 3. Derived works are not contained in the info.clearthought\n    namespace/package or any subpackage of info.clearthought.  This\n    means that your patch files must change the namespace/package\n    for the derived work.  See section II for examples.\n\n 4. Derived works do not use the class or interface names from the\n    info.clearthought... packages.  This means your patch files\n    must change the names of the interfaces and classes they alter.\n    See section II for examples.\n\n 5. Derived works must include the following disclaimer.\n    \"This work is derived from Clearthought's TableLayout,\n    https://tablelayout.dev.java.net, by means of patch files\n    rather than subclassing or composition.  Therefore, this work\n    might not contain the latest fixes and features of TableLayout.\"\n\nIV. Terms for repackaging, transcoding, and compiling of binaries.\n\nYou may do any of the following with the binaries of the\noriginal software.\n\n 1. You may move binaries (.class files) from the original .jar file\n    to your own .jar file.\n\n 2. You may move binaries from the original .jar file to other\n    resource containing files, including but not limited to .zip,\n    .gz, .tar, .dll, .exe files.\n\n 3. You may backend compile the binaries to any platform, including\n    but not limited to Win32, Win64, MAC OS, Linux, Palm OS, any\n    handheld or embedded platform.\n\n 4. You may transcribe the binaries to other virtual machine byte\n    code protocols, including but not limited to .NET.\n\nV. License Disclaimer.\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED.  IN NO EVENT SHALL THE AUTHOR, AFFILATED BUSINESSES,\nOR ANYONE ELSE BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF\nUSE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\nOF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE."
}