{
  "key": "clisp-exception-2.0",
  "short_name": "CLISP Exception to GPL 2.0",
  "name": "CLISP Exception to GPL 2.0",
  "category": "Copyleft Limited",
  "owner": "Clisp",
  "homepage_url": "https://sourceforge.net/p/clisp/clisp/ci/default/tree/COPYRIGHT",
  "is_exception": true,
  "spdx_license_key": "CLISP-exception-2.0",
  "text_urls": [
    "http://sourceforge.net/p/clisp/clisp/ci/default/tree/COPYRIGHT"
  ],
  "other_urls": [
    "http://www.gnu.org/licenses/gpl-2.0.txt"
  ],
  "text": "This copyright does NOT cover user programs that run in CLISP and third-party\npackages not part of CLISP, if a) They only reference external symbols in\nCLISP's public packages that define API also provided by many other Common Lisp\nimplementations (namely the packages COMMON-LISP, COMMON-LISP-USER, KEYWORD,\nCLOS, GRAY, EXT), i.e. if they don't rely on CLISP internals and would as well\nrun in any other Common Lisp implementation. Or b) They only reference external\nsymbols in CLISP's public packages that define API also provided by many other\nCommon Lisp implementations (namely the packages COMMON-LISP, COMMON-LISP-USER,\nKEYWORD, CLOS, GRAY, EXT) and some external, not CLISP specific, symbols in\nthird-party packages that are released with source code under a GPL compatible\nlicense and that run in a great number of Common Lisp implementations, i.e. if\nthey rely on CLISP internals only to the extent needed for gaining some\nfunctionality also available in a great number of Common Lisp implementations.\nSuch user programs are not covered by the term \"derived work\" used in the\nGNU GPL. Neither is their compiled code, i.e. the result of compiling them by\nuse of the function COMPILE-FILE. We refer to such user programs as\n\"independent work\".\n\nYou may copy and distribute memory image files generated by the function\nSAVEINITMEM, if it was generated only from CLISP and independent work, and\nprovided that you accompany them, in the sense of section 3 of the GNU GPL, with\nthe source code of CLISP - precisely the same CLISP version that was used to\nbuild the memory image -, the source or compiled code of the user programs\nneeded to rebuild the memory image (source code for all the parts that are not\nindependent work, see above), and a precise description how to rebuild the\nmemory image from these.\n\nForeign non-Lisp code that is linked with CLISP or loaded into CLISP through\ndynamic linking is not exempted from this copyright. I.e. such code, when\ndistributed for use with CLISP, must be distributed under the GPL."
}