{
  "key": "cockroachdb-2024-10-01",
  "short_name": "CockroachDB Software License 2024-10-01",
  "name": "CockroachDB Software License 2024-10-01",
  "category": "Proprietary Free",
  "owner": "Cockroachlabs",
  "homepage_url": "https://github.com/cockroachdb/cockroach/blob/master/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-cockroachdb-2024-10-01",
  "ignorable_urls": [
    "https://www.cockroachlabs.com/privacy"
  ],
  "text": "CockroachDB Software License\n\nAcceptance\n\nThis Agreement sets forth the terms and conditions on which Licensor makes\nthe Software available to You. By accessing or using the Software or a\nModified Version in any manner, You agree to be bound by all the terms and\nconditions of this Agreement. If you are an individual accessing or using the\nSoftware or a Modified Version on behalf of a legal entity, (i) you represent\nand warrant that you have the authority to enter into this Agreement on\nbehalf of such entity and bind such entity to this Agreement, and (ii)\nreferences to “You” in this Agreement will refer to such entity.\n\nLicense\n\nSubject to the terms and conditions of this Agreement, Licensor grants You a\nnon-exclusive, worldwide, non-sublicensable, non-transferable license to (i)\nuse, copy, and distribute the Software, and create Modified Versions (but not\nother modifications or derivative works) of the Software, and (ii) make, have\nmade, use, sell, offer for sale and import the Software, where such license\napplies only to those patent claims licensable to You by Licensor that are\nnecessarily infringed by the Software as made available to You by Licensor,\nin each of (i) and (ii), for the purposes of operating, evaluating, testing,\nfixing, integrating with, and improving CockroachDB. If You make any written\nclaim of patent infringement relating to the Software, Your patent license\nfor the Software granted under this Agreement terminates immediately.\n\nLimitations and Obligations\n\nYou will not operate the Software or a Modified Version without a License Key\nexcept for Limited Non-Production Use. You agree to adhere to any limitations\nspecified by Licensor regarding use of the License Key at the time it is\nprovided to You. You represent and warrant that all information You provide\nto Licensor to obtain a License Key is complete and accurate at the time of\nsubmission. You must keep any License Key strictly confidential and will not\nshare it with any third parties, other than Your affiliates, contractors, and\nagents who are obligated to keep it confidential and use it solely on Your\nbehalf. You will ensure that such affiliates, contractors, and agents comply\nwith the terms of this Agreement applicable to You, and You will be\nresponsible for their acts and omissions as if they were You hereunder. You\nacknowledge that the Software and any Modified Versions may be subject to\nexport or import control laws and regulations in the US and other countries,\nand You agree to comply with all such laws and regulations.\n\nYou acknowledge that the Software and any Modified Versions share Telemetry\nwith Licensor. You will not operate the Software or a Modified Version\nwithout sharing Telemetry except for Limited Non-Production Use or unless\nLicensor has issued You a License Key that allows Telemetry to be disabled\nand You disable sharing Telemetry. You understand and agree that Licensor may\nuse and disclose personal information collected as part of Telemetry in\naccordance with Licensor’s Privacy Policy:\nhttps://www.cockroachlabs.com/privacy. You acknowledge that the Software and\nModified Versions include technical countermeasures to limit unauthorized\nuse, such as operation without a required License Key or without sending\nrequired Telemetry. You will not circumvent, remove, disable, block or alter\nany technical countermeasures, Telemetry requirements (except as permitted by\nYour License Key), License Key requirements, or other elements in the\nSoftware or Modified Versions designed to enforce the terms of this Agreement\n(collectively, the “Protective Measures”). You must include all of the\nProtective Measures in any Modified Version You create.\n\nYou will not alter, remove, or obscure any licensing, copyright, trademark,\nor other notices of Licensor in the Software or a Modified Version. You must\nensure that anyone who receives a copy of any part of the Software or a\nModified Version from You also receives a copy of this Agreement and if You\ncreate a Modified Version, You must include in any such Modified Version\nprominent notices stating that You have modified the Software.\n\nYou will not perform Benchmarks against any products or services provided\nunder terms that restrict performing and disclosing the results of benchmarks\nof such products or services, unless You have the lawful right to waive such\nterms. If You perform or disclose, or direct or permit any third party to\nperform or disclose, any Benchmark, You will include in any disclosure and\nwill disclose to Licensor all information necessary to replicate such\nBenchmark, and You agree that Licensor may perform and disclose the results\nof benchmarks of Your products or services, irrespective of any restrictions\non benchmarks in the terms governing Your products or services.\n\nNo Other Rights\n\nExcept for the licenses expressly granted to You in this Agreement, Licensor\ngrants You no other licenses or rights in the Software or otherwise.\n\nThird-Party Software\n\nThe Software may contain or be provided together with Third-Party Software.\nEach item of Third-Party Software is subject to its own license terms, which\ncan be found in the documentation accompanying the Software or the source\ncode. Copyrights to the Third-Party Software are held by the respective\ncopyright holders indicated therein. You agree to fully comply with all such\nThird-Party Software license terms.\n\nTermination\n\nYour licenses to the Software will automatically terminate if You breach any\nterm, condition, or restriction of this Agreement; provided that if Your\nbreach is capable of being cured and You cure it within 15 days of the breach\nto Licensor’s satisfaction, Your licenses will be reinstated retroactively.\nNotwithstanding the foregoing, intentional or repeated breaches of this\nAgreement by You will cause Your licenses to terminate automatically and\npermanently.\n\nDisclaimer; Liability Limitations\n\nTO THE EXTENT PERMITTED BY APPLICABLE LAW, THE SOFTWARE IS PROVIDED “AS IS”\nAND WITHOUT ANY REPRESENTATION, WARRANTY OR CONDITION, EXPRESS OR IMPLIED,\nINCLUDING WITHOUT LIMITATION ANY REPRESENTATION, WARRANTY OR CONDITION OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE OR NON-INFRINGEMENT\nOR THAT USE OF THE SOFTWARE WILL BE UNINTERRUPTED OR ERROR FREE.\n\nLICENSOR WILL NOT BE LIABLE TO YOU FOR (I) ANY CONSEQUENTIAL, INDIRECT,\nSPECIAL, MULTIPLE, PUNITIVE OR INCIDENTAL DAMAGES, (INCLUDING WITHOUT\nLIMITATION, LOST PROFITS, BUSINESS INTERRUPTION AND LOST DATA) OR (II)\nDAMAGES IN EXCESS OF ONE HUNDRED US DOLLARS ($100), ARISING OUT OF THIS\nAGREEMENT OR THE USE OF THE SOFTWARE, REGARDLESS OF THE TYPE OF LEGAL CLAIM\nAND WHETHER LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nGoverning Law\n\nThis Agreement shall be governed by and construed under the laws of the State\nof New York and the United States without regard to the conflicts of laws\nprovisions thereof. The state and federal courts located in New York County,\nNew York, have exclusive jurisdiction for all purposes relating to this\nAgreement. The rights and obligations of the parties to this Agreement will\nnot be governed by the United Nations Convention on the International Sale of\nGoods\n\nDefinitions\n\nAgreement: This CockroachDB Software License.\n\nBenchmark: Any benchmark, comparative test or evaluation of the Software.\n\nCockroachDB: A database application that is created by compiling either the\nsource code of the Software in its complete, unmodified form, or the source\ncode of a Modified Version.\n\nIntroductory Period: A limited time period during which the Software is\ndesigned by Licensor to be fully functional and not trigger Protective\nMeasures without requiring a License Key to be entered.\n\nLicense Key: A valid unique code or token for use of the Software that is\nprovisioned for You by Licensor.\n\nLicensor: Cockroach Labs, Inc.\n\nLimited Non-Production Use: Use for design, prototyping, testing, or\ndevelopment purposes in non-production, internal development environments\neither (i) during the Introductory Period (if any) or (ii) in deploying a\ndatabase that runs solely on a single node.\n\nModified Version: A derivative work of the Software that provides all or\nsubstantially all of the features and functionality of the unmodified\nSoftware using all or substantially all of the source code of the unmodified\nSoftware.\n\nSoftware: The software provided to You under this Agreement that includes or\nrefers to this Agreement, in any form, including any portion of such software.\n\nTelemetry: Data about Your use of the Software and its features that is\ncommunicated to Licensor by the Software.\n\nThird-Party Software: Third-party software made available under open source\nor other license terms.\n\nYou: The individual or entity agreeing to this Agreement."
}