{
  "key": "concursive-pl-1.0",
  "short_name": "Concursive Public License 1.0",
  "name": "Concursive Public License 1.0",
  "category": "Proprietary Free",
  "owner": "Concursive",
  "spdx_license_key": "LicenseRef-scancode-concursive-pl-1.0",
  "text": "The Concursive Public License\nVersion 1, April 2014\n\nPreamble\n\nThis Concursive Public License is based on United States Copyright law, as\ndefined by Title 17 of the United States Code.\n\nIn particular, our intent is that:\n\nYou may use, copy, modify, and make derivative works from the code for internal\nuse only.\n\nYou may provide the code in object format for the use of your customers only,\npursuant to a current resale agreement with Concursive Corporation.\u2028\n\nYou may not redistribute the code, and you may not sublicense copies or\nderivatives of the code, either as software or as a service.\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n1. This License applies to any program or other work which contains a notice\nplaced by the copyright holder saying it may be distributed under the terms of\nthis Concursive Public License. The \"Program\", below, refers to any such program\nor work, and a \"work based on the Program\" means either the Program or any\nderivative work under copyright law: that is to say, a work containing the\nProgram or a portion of it, either verbatim or with modifications and/or\ntranslated into another language. (Hereinafter, translation is included without\nlimitation in the term \"modification\".) Each licensee is addressed as \"you\".\n\n2. By using the software you agree to abide by these terms.\n\n3. You may modify your copy or copies of the Program or any portion of it, thus\nforming a work based on the Program, for internal use and the use of your\ncustomers only, pursuant to a current resale agreement with Concursive\nCorporation.\n\n4. If the distribution and/or use of the Program is restricted in certain\ncountries either by patents or by copyrighted interfaces, Concursive Corporation\nmay add an explicit geographical distribution limitation excluding those\ncountries, so that distribution is permitted only in or among countries not thus\nexcluded. In such case, this License incorporates the limitation as if written\nin the body of this License.\n\n5. Concursive Corporation may publish revised and/or new versions of the\nConcursive Public License from time to time. Such new versions will be similar\nin spirit to the present version, but may differ in detail to address new\nproblems or concerns.\n\nEach version is given a distinguishing version number. If the Program specifies\na version number of this License which applies to it and \"any later version\",\nyou have the option of following the terms and conditions either of that version\nor of any later version published by Concursive Corporation. If the Program does\nnot specify a version number of this License, you may choose any version ever\npublished by Concursive Corporation.\n\n6. If any portion of this license is held invalid or unenforceable under any\nparticular circumstance, the balance of the license is intended to apply and the\nlicense as a whole is intended to apply in other circumstances.\n\nNO WARRANTY\n\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.\nEXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER\nPARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER\nEXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE\nQUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE\nDEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY\nCOPYRIGHT HOLDER BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL,\nINCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE\nTHE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED\nINACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE\nPROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY\nHAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nEND OF TERMS AND CONDITIONS"
}