{
  "key": "condor-1.1",
  "short_name": "Condor Public License 1.1",
  "name": "Condor Public License 1.1",
  "category": "Permissive",
  "owner": "Condor Project",
  "homepage_url": "http://www.cs.wisc.edu/condor/license.html",
  "notes": "Per SPDX.org, this license was released 30 October 2003",
  "spdx_license_key": "Condor-1.1",
  "text_urls": [
    "http://www.cs.wisc.edu/condor/license.html"
  ],
  "other_urls": [
    "http://research.cs.wisc.edu/condor/license.html#condor",
    "http://web.archive.org/web/20111123062036/http://research.cs.wisc.edu/condor/license.html#condor"
  ],
  "ignorable_copyrights": [
    "Copyright 1990-2006 Condor Team, Computer Sciences Department, University of Wisconsin-Madison, Madison, WI."
  ],
  "ignorable_holders": [
    "Condor Team, Computer Sciences Department, University of Wisconsin-Madison, Madison, WI."
  ],
  "ignorable_authors": [
    "the Condor Project, Condor Team, Computer Sciences Department, University of Wisconsin-Madison"
  ],
  "ignorable_urls": [
    "http://www.condorproject.org/"
  ],
  "ignorable_emails": [
    "condor-admin@cs.wisc.edu",
    "miron@cs.wisc.edu"
  ],
  "text": "CONDOR PUBLIC LICENSE\n\nVersion 1.1, October 30, 2003\n\nCopyright 1990-2006 Condor Team, Computer Sciences Department,\nUniversity of Wisconsin-Madison, Madison, WI. All Rights Reserved.  For\nmore information contact: Condor Team, Attention: Professor Miron Livny,\nDept of Computer Sciences, 1210 W. Dayton St., Madison, WI 53706-1685, (608)\n262-0856 or miron@cs.wisc.edu. \n\nThis software referred to as the Condor\n  Version 6.x software\n(\"Software\") was developed by the Condor Project, Condor Team,\nComputer Sciences Department, University of Wisconsin-Madison, under\nthe authority of the Board of Regents of the  University of Wisconsin\nSystem and includes voluntary contributions made to the Condor Project\n(\"Copyright Holders and Contributors and the University\").  For more\ninformation on the Condor Project, please see\nhttp://www.condorproject.org/.\n\nInstallation, use, reproduction, display, modification and\nredistribution of this Software, with or without modification,  in\nsource and binary forms, are permitted.  Any exercise of rights under\nthis license including sublicenses by you is subject to the following\nconditions:\n\nRedistributions of this Software, with or without modification,\n   must reproduce this Condor Public License in: (1) the Software,\n   and (2) any user documentation or other similar material\n   which is provided with the Software.\n\nAny user documentation included with a redistribution\n   must include the following notice:\n\n\"This product includes software from the Condor Project (http://www.condorproject.org/)\"\n\t\nAlternatively, if that is where third-party acknowledgments\n   normally appear, this acknowledgment must be reproduced in the\n   Software itself.\n\nAny academic report, publication, or other academic disclosure \n   of results obtained with this Software will acknowledge this\n   Software's use by an appropriate citation.\n\nThe name Condor\n  is a registered trademark of the University of\n   Wisconsin-Madison.  The trademark may not be used to endorse or\n   promote software, or products derived therefrom, and, other than\n   as required by section 2 and 3 above, it may not be affixed to modified\n   redistributions of this Software without the prior written\n   approval, obtainable via email to condor-admin@cs.wisc.edu.\n\nTo the extent that patent claims licensable by the University of\n   Wisconsin-Madison are necessarily infringed by the use or sale of\n   the Software, you are granted a non-exclusive, worldwide, royalty-\n   free perpetual license under such patent claims, with the rights\n   for you to make, use, sell, offer to sell, import and otherwise\n   transfer the Software in source code and object code form and\n   derivative works.   This patent license shall apply to the\n   combination of the Software with other software if, at the time\n   the Software is added by you, such addition of the Software causes\n   such combination to be covered by such patent claims. This patent\n   license shall not apply to any other combinations which include\n   the Software.  No hardware per se is licensed hereunder.\n\nIf you or any subsequent sub-licensee (a ``Recipient\") institutes\n   patent litigation against any entity (including a cross-claim or\n   counterclaim in a lawsuit) alleging that the Software infringes\n   such Recipient's patent(s), then such Recipient's rights granted\n   (directly or indirectly) under the patent license above shall\n   terminate as of the date such litigation is filed.  All\n   sublicenses to the Software which have been properly granted prior\n   to termination shall survive any termination of said patent\n   license, if not otherwise terminated pursuant to this section.\n\nDISCLAIMER\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n   AND THE UNIVERSITY \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\n   INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n   MERCHANTABILITY, OF SATISFACTORY QUALITY, AND FITNESS FOR A\n   PARTICULAR PURPOSE OR USE ARE DISCLAIMED.  THE COPYRIGHT HOLDERS\n   AND CONTRIBUTORS AND THE UNIVERSITY MAKE NO REPRESENTATION THAT THE\n   SOFTWARE, MODIFICATIONS, ENHANCEMENTS OR DERIVATIVE WORKS THEREOF,\n   WILL NOT INFRINGE ANY PATENT, COPYRIGHT, TRADEMARK, TRADE SECRET OR\n   OTHER PROPRIETARY RIGHT.\n\nLIMITATION OF LIABILITY\n\nTHE COPYRIGHT HOLDERS AND CONTRIBUTORS AND ANY OTHER OFFICER,\n   AGENT, OR EMPLOYEE OF THE UNIVERSITY SHALL HAVE NO LIABILITY TO\n   LICENSEE OR OTHER PERSONS FOR DIRECT, INDIRECT, SPECIAL,\n   INCIDENTAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES OF ANY\n   CHARACTER INCLUDING, WITHOUT LIMITATION, PROCUREMENT OF SUBSTITUTE\n   GOODS OR SERVICES, LOSS OF USE, DATA OR PROFITS, OR BUSINESS\n   INTERRUPTION, HOWEVER CAUSED AND ON ANY THEORY OF CONTRACT,\n   WARRANTY, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR\n   OTHERWISE, ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\n   EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nCertain uses and transfers of the Software or documentation, and/or\n   items or software incorporating the Condor Software or\n   documentation, may require a license under U.S. Export Control\n   laws.  Licensee represents and warrants that all uses and transfers\n   of the Condor Software or documentation and/or any items or\n   software incorporating Condor shall be in compliance with U.S.\n   Export Control laws, and Licensee further understands that failure\n   to comply with such export control laws may result in criminal\n   liability to Licensee under U.S. laws.\n\nThe Condor Team may publish revised and/or new versions of this\n   Condor Public License (``this License\") from time to time.  Each\n   version will be given a distinguishing version number.  Once\n   Software has been published under a particular version of this\n   License, you may always continue to use it under the terms of that\n   version. You may also choose to use such Software under the terms\n   of any subsequent version of this License published by the Condor\n   Team.  No one other than the Condor Team has the right to modify\n   the terms of this License."
}