{
  "key": "cosl",
  "short_name": "Cougaar Open Source License",
  "name": "Cougaar Open Source License",
  "category": "Permissive",
  "owner": "Cougaar Software",
  "spdx_license_key": "LicenseRef-scancode-cosl",
  "minimum_coverage": 80,
  "text": "Cougaar Open Source License \n\nThe Cougaar Open Source License (COSL) is a modified version of the OSI \napproved BSD License. Sections 3 and 4 have been modified. \n\nCOSL License : \n\nRedistribution and use in source and binary forms, with or without \nmodification, are permitted provided that the following conditions \nare met: \n\n1. Redistributions of source code must retain the original author's copyright notice, \nthis list of conditions and the following disclaimer. \n\n2. Redistributions in binary form must reproduce the original author's copyright \nnotice, this list of conditions and the following disclaimer in the \ndocumentation and/or other materials provided with the distribution. \n\n3. The end-user documentation included with the redistribution, if \nany, must include the following acknowledgement: \"This product includes \nsoftware developed in part by support from the Defense Advanced Research \nProject Agency (DARPA).\" \n\n4. Neither the name of the DARPA nor the names of its contributors may \nbe used to endorse or promote products derived from this software without \nspecific prior written permission. \n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT \nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR \nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT \nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, \nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED \nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR \nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF \nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING \nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS \nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}