{
  "key": "couchbase-enterprise",
  "short_name": "Couchbase Enterprise Edition License",
  "name": "Couchbase Enterprise Edition License",
  "category": "Proprietary Free",
  "owner": "Couchbase",
  "homepage_url": "http://www.couchbase.com/download",
  "spdx_license_key": "LicenseRef-scancode-couchbase-enterprise",
  "minimum_coverage": 20,
  "ignorable_urls": [
    "http://www.couchbase.com/",
    "http://www.couchbase.org/forums"
  ],
  "text": "COUCHBASE INC. ENTERPRISE LICENSE AGREEMENT - FREE EDITION\n\nIMPORTANT-READ CAREFULLY: BY CLICKING THE \"I ACCEPT\" BOX OR INSTALLING,\nDOWNLOADING OR OTHERWISE USING THIS SOFTWARE AND ANY ASSOCIATED\nDOCUMENTATION, YOU, ON BEHALF OF YOURSELF OR AS AN AUTHORIZED\nREPRESENTATIVE ON BEHALF OF AN ENTITY (\"LICENSEE\") AGREE TO ALL THE\nTERMS OF THIS ENTERPRISE LICENSE AGREEMENT - FREE EDITION (THE\n\"AGREEMENT\") REGARDING YOUR USE OF THE SOFTWARE.  YOU REPRESENT AND\nWARRANT THAT YOU HAVE FULL LEGAL AUTHORITY TO BIND THE LICENSEE TO THIS\nAGREEMENT. IF YOU DO NOT AGREE WITH ALL OF THESE TERMS, DO NOT SELECT\nTHE \"I ACCEPT\" BOX AND DO NOT INSTALL, DOWNLOAD OR OTHERWISE USE THE\nSOFTWARE. THE EFFECTIVE DATE OF THIS AGREEMENT IS THE DATE ON WHICH YOU\nCLICK \"I ACCEPT\" OR OTHERWISE INSTALL, DOWNLOAD OR USE THE SOFTWARE.\n\n1. License Grant. Subject to Licensee's compliance with the terms and\nconditions of this Agreement, Couchbase Inc. hereby grants to Licensee a\nperpetual, non-exclusive, non-transferable, non-sublicensable,\nroyalty-free, limited license to install and use the Software only for\nLicensee's own internal production use on up to two (2) Licensed Servers\nor for Licensee's own internal non-production use for the purpose of\nevaluation and/or development on an unlimited number of Licensed\nServers.\n\n2. Restrictions. Licensee will not: (a) copy or use the Software in any\nmanner except as expressly permitted in this Agreement; (b) use or\ndeploy the Software on any server in excess of the Licensed Servers for\nwhich Licensee has paid the applicable Subscription Fee unless it is\ncovered by a valid license; (c) transfer, sell, rent, lease, lend,\ndistribute, or sublicense the Software to any third party; (d) use the\nSoftware for providing time-sharing services, service bureau services or\nas part of an application services provider or as a service offering\nprimarily designed to offer the functionality of the Software; (e)\nreverse engineer, disassemble, or decompile the Software (except to the\nextent such restrictions are prohibited by law); (f) alter, modify,\nenhance or prepare any derivative work from or of the Software; (g)\nalter or remove any proprietary notices in the Software; (h) make\navailable to any third party the functionality of the Software or any\nlicense keys used in connection with the Software; (i) publically\ndisplay or communicate the results of internal performance testing or\nother benchmarking or performance evaluation of the Software; or (j)\nexport the Software in violation of U.S. Department of Commerce export\nadministration rules or any other export laws or regulations.\n\n3. Proprietary Rights. The Software, and any modifications or\nderivatives thereto, is and shall remain the sole property of Couchbase\nInc. and its licensors, and, except for the license rights granted\nherein, Couchbase Inc. and its licensors retain all right, title and\ninterest in and to the Software, including all intellectual property\nrights therein and thereto. The Software may include third party open\nsource software components. If Licensee is the United States Government\nor any contractor thereof, all licenses granted hereunder are subject to\nthe following: (a) for acquisition by or on behalf of civil agencies, as\nnecessary to obtain protection as \"commercial computer software\" and\nrelated documentation in accordance with the terms of this Agreement and\nas specified in Subpart 12.1212 of the Federal Acquisition Regulation\n(FAR), 48 C.F.R.12.1212, and its successors; and (b) for acquisition by\nor on behalf of the Department of Defense (DOD) and any agencies or\nunits thereof, as necessary to obtain protection as \"commercial computer\nsoftware\" and related documentation in accordance with the terms of this\nAgreement and as specified in Subparts 227.7202-1 and 227.7202-3 of the\nDOD FAR Supplement, 48 C.F.R.227.7202-1 and 227.7202-3, and its\nsuccessors. Manufacturer is Couchbase, Inc.\n\n4. Support.  Couchbase Inc. will provide Licensee with: (a) periodic\nSoftware updates to correct known bugs and errors to the extent\nCouchbase Inc. incorporates such corrections into the free edition\nversion of the Software; and (b) access to, and use of, the Couchbase\nInc. support forum available at the following URL:\nhttp://www.couchbase.org/forums/.  Licensee must have Licensed Servers\nat the same level of Support Services for all instances in a production\ndeployment running the Software.  Licensee must also have Licensed\nServers at the same level of Support Services for all instances in a\ndevelopment and test environment running the Software, although these\nSupport Services may be at a different level than the production\nLicensed Servers.  Couchbase Inc. may, at its discretion, modify,\nsuspend or terminate support at any time upon notice to Licensee.\n\n5. Records Retention and Audit. Licensee shall maintain complete and\naccurate records to permit Couchbase Inc. to verify the number of\nLicensed Servers used by Licensee hereunder. Upon Couchbase Inc.'s\nwritten request, Licensee shall: (a) provide Couchbase Inc. with such\nrecords within ten (10) days; and (b) will furnish Couchbase Inc. with a\ncertification signed by an officer of Licensee verifying that the\nSoftware is being used pursuant to the terms of this Agreement. Upon at\nleast thirty (30) days prior written notice, Couchbase Inc. may audit\nLicensee's use of the Software to ensure that Licensee is in compliance\nwith the terms of this Agreement. Any such audit will be conducted\nduring regular business hours at Licensee's facilities and will not\nunreasonably interfere with Licensee's business activities. Licensee\nwill provide Couchbase Inc. with access to the relevant Licensee records\nand facilities. If an audit reveals that Licensee has used the Software\nin excess of the authorized Licensed Servers, then (i) Couchbase Inc.\nwill invoice Licensee, and Licensee will promptly pay Couchbase Inc.,\nthe applicable licensing fees for such excessive use of the Software,\nwhich fees will be based on Couchbase Inc.'s price list in effect at the\ntime the audit is completed; and (ii) Licensee will pay Couchbase Inc.'s\nreasonable costs of conducting the audit.\n\n6. Confidentiality.  Licensee and Couchbase Inc. will maintain the\nconfidentiality of Confidential Information. The receiving party of any\nConfidential Information of the other party agrees not to use such\nConfidential Information for any purpose except as necessary to fulfill\nits obligations and exercise its rights under this Agreement. The\nreceiving party shall protect the secrecy of and prevent disclosure and\nunauthorized use of the disclosing party's Confidential Information\nusing the same degree of care that it takes to protect its own\nconfidential information and in no event shall use less than reasonable\ncare. The terms of this Confidentiality section shall survive\ntermination of this Agreement. Upon termination or expiration of this\nAgreement, the receiving party will, at the disclosing party's option,\npromptly return or destroy (and provide written certification of such\ndestruction) the disclosing party's Confidential Information.\n\n7. Disclaimer of Warranty. THE SOFTWARE AND ANY SERVICES PROVIDED\nHEREUNDER ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND. COUCHBASE\nINC. DOES NOT WARRANT THAT THE SOFTWARE OR THE SERVICES PROVIDED\nHEREUNDER WILL MEET LICENSEE'S REQUIREMENTS, THAT THE SOFTWARE WILL\nOPERATE IN THE COMBINATIONS LICENSEE MAY SELECT FOR USE, THAT THE\nOPERATION OF THE SOFTWARE WILL BE ERROR-FREE OR UNINTERRUPTED OR THAT\nALL SOFTWARE ERRORS WILL BE CORRECTED. COUCHBASE INC. HEREBY DISCLAIMS\nALL WARRANTIES, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED\nTO THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\nPURPOSE, NON-INFRINGEMENT, TITLE, AND ANY WARRANTIES ARISING OUT OF\nCOURSE OF DEALING, USAGE OR TRADE.\n\n8. Agreement Term and Termination. The term of this Agreement shall\nbegin on the Effective Date and will continue until terminated by the\nparties. Licensee may terminate this Agreement for any reason, or for no\nreason, by providing at least ten (10) days prior written notice to\nCouchbase Inc. Couchbase Inc. may terminate this Agreement if Licensee\nmaterially breaches its obligations hereunder and, where such breach is\ncurable, such breach remains uncured for ten (10) days following written\nnotice of the breach. Licensee acknowledges that the Software may\ncontain a license key with a time-out mechanism that will suspend and/or\nterminate Licensee's use of the Software upon termination of this\nAgreement.  Upon termination of this Agreement, Licensee will, at\nCouchbase Inc.'s option, promptly return or destroy (and provide written\ncertification of such destruction) the applicable Software and all\ncopies and portions thereof, in all forms and types of media. The\nfollowing sections will survive termination or expiration of this\nAgreement: Sections 2, 3, 6, 7, 8, 9, 10 and 11.\n\n9. Limitation of Liability. TO THE MAXIMUM EXTENT PERMITTED BY\nAPPLICABLE LAW, IN NO EVENT WILL COUCHBASE INC. OR ITS LICENSORS BE\nLIABLE TO LICENSEE OR TO ANY THIRD PARTY FOR ANY INDIRECT, SPECIAL,\nINCIDENTAL, CONSEQUENTIAL OR EXEMPLARY DAMAGES OR FOR THE COST OF\nPROCURING SUBSTITUTE PRODUCTS OR SERVICES ARISING OUT OF OR IN ANY WAY\nRELATING TO OR IN CONNECTION WITH THIS AGREEMENT OR THE USE OF OR\nINABILITY TO USE THE SOFTWARE OR DOCUMENTATION OR THE SERVICES PROVIDED\nBY COUCHBASE INC. HEREUNDER INCLUDING, WITHOUT LIMITATION, DAMAGES OR\nOTHER LOSSES FOR LOSS OF USE, LOSS OF BUSINESS, LOSS OF GOODWILL, WORK\nSTOPPAGE, LOST PROFITS, LOSS OF DATA, COMPUTER FAILURE OR ANY AND ALL\nOTHER COMMERCIAL DAMAGES OR LOSSES EVEN IF ADVISED OF THE POSSIBILITY\nTHEREOF AND REGARDLESS OF THE LEGAL OR EQUITABLE THEORY (CONTRACT, TORT\nOR OTHERWISE) UPON WHICH THE CLAIM IS BASED. IN NO EVENT WILL COUCHBASE\nINC.'S OR ITS LICENSORS' AGGREGATE LIABILITY TO LICENSEE, FROM ALL\nCAUSES OF ACTION AND UNDER ALL THEORIES OF LIABILITY, EXCEED ONE\nTHOUSAND DOLLARS (US $1,000). The parties expressly acknowledge and\nagree that Couchbase Inc. has set its prices and entered into this\nAgreement in reliance upon the limitations of liability specified\nherein, which allocate the risk between Couchbase Inc. and Licensee and\nform a basis of the bargain between the parties.\n\n10. General. Couchbase Inc. shall not be liable for any delay or failure\nin performance due to causes beyond its reasonable control. Neither\nparty will, without the other party's prior written consent, make any\nnews release, public announcement, denial or confirmation of this\nAgreement, its value, or its terms and conditions, or in any manner\nadvertise or publish the fact of this Agreement. Notwithstanding the\nabove, Couchbase Inc. may use Licensee's name and logo, consistent with\nLicensee's trademark policies, on customer lists so long as such use in\nno way promotes either endorsement or approval of Couchbase Inc. or any\nCouchbase Inc. products or services. Licensee may not assign this\nAgreement, in whole or in part, by operation of law or otherwise,\nwithout Couchbase Inc.'s prior written consent. Any attempt to assign\nthis Agreement, without such consent, will be null and of no effect.\nSubject to the foregoing, this Agreement will bind and inure to the\nbenefit of each party's successors and permitted assigns. If for any\nreason a court of competent jurisdiction finds any provision of this\nAgreement invalid or unenforceable, that provision of the Agreement will\nbe enforced to the maximum extent permissible and the other provisions\nof this Agreement will remain in full force and effect. The failure by\neither party to enforce any provision of this Agreement will not\nconstitute a waiver of future enforcement of that or any other\nprovision. All waivers must be in writing and signed by both parties.\nAll notices permitted or required under this Agreement shall be in\nwriting and shall be delivered in person, by confirmed facsimile,\novernight courier service or mailed by first class, registered or\ncertified mail, postage prepaid, to the address of the party specified\nabove or such other address as either party may specify in writing. Such\nnotice shall be deemed to have been given upon receipt. This Agreement\nshall be governed by the laws of the State of California, U.S.A.,\nexcluding its conflicts of law rules. The parties expressly agree that\nthe UN Convention for the International Sale of Goods (CISG) will not\napply. Any legal action or proceeding arising under this Agreement will\nbe brought exclusively in the federal or state courts located in the\nNorthern District of California and the parties hereby irrevocably\nconsent to the personal jurisdiction and venue therein. Any amendment or\nmodification to the Agreement must be in writing signed by both parties.\nThis Agreement constitutes the entire agreement and supersedes all prior\nor contemporaneous oral or written agreements regarding the subject\nmatter hereof. To the extent there is a conflict between this Agreement\nand the terms of any \"shrinkwrap\" or \"clickwrap\" license included in any\npackage, media, or electronic version of Couchbase Inc.-furnished\nsoftware, the terms and conditions of this Agreement will control. Each\nof the parties has caused this Agreement to be executed by its duly\nauthorized representatives as of the Effective Date. Except as expressly\nset forth in this Agreement, the exercise by either party of any of its\nremedies under this Agreement will be without prejudice to its other\nremedies under this Agreement or otherwise. The parties to this\nAgreement are independent contractors and this Agreement will not\nestablish any relationship of partnership, joint venture, employment,\nfranchise, or agency between the parties. Neither party will have the\npower to bind the other or incur obligations on the other's behalf\nwithout the other's prior written consent.\n\n11. Definitions.  Capitalized terms used herein shall have the following\ndefinitions: \"Confidential Information\" means any proprietary\ninformation received by the other party during, or prior to entering\ninto, this Agreement that a party should know is confidential or\nproprietary based on the circumstances surrounding the disclosure\nincluding, without limitation, the Software and any non-public technical\nand business information. Confidential Information does not include\ninformation that (a) is or becomes generally known to the public through\nno fault of or breach of this Agreement by the receiving party; (b) is\nrightfully known by the receiving party at the time of disclosure\nwithout an obligation of confidentiality; (c) is independently developed\nby the receiving party without use of the disclosing party's\nConfidential Information; or (d) the receiving party rightfully obtains\nfrom a third party without restriction on use or disclosure.\n\"Documentation\" means any technical user guides or manuals provided by\nCouchbase Inc. related to the Software. \"Licensed Server\" means an\ninstance of the Software running on one (1) operating system.  Each\noperating system instance may be running directly on physical hardware,\nin a virtual machine, or on a cloud server. \"Couchbase Website\" means\nwww.couchbase.com.\"Software\" means the object code version of the\napplicable elastic data management server software provided by Couchbase\nInc. and ordered by Licensee during the ordering process on the\nCouchbase Website.  If you have any questions regarding this Agreement,\nplease contact us at 650-417-7500."
}