{
  "key": "cpp-core-guidelines",
  "short_name": "CppCoreGuidelines License",
  "name": "CppCoreGuidelines License",
  "category": "Permissive",
  "owner": "isocpp",
  "homepage_url": "https://github.com/isocpp/CppCoreGuidelines/blob/master/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-cpp-core-guidelines",
  "ignorable_emails": [
    "admin@isocpp.org"
  ],
  "text": "Standard C++ Foundation grants you a worldwide, nonexclusive, royalty-free,\nperpetual license to copy, use, modify, and create derivative works from this\nproject for your personal or internal business use only. The above copyright\nnotice and this permission notice shall be included in all copies or\nsubstantial portions of the project. This license does not grant permission\nto use the trade names, trademarks, service marks, or product names of the\nlicensor, except as required for reasonable and customary use in describing\nthe origin of the project.\n\nStandard C++ Foundation reserves the right to accept contributions to the\nproject at its discretion.\n\nBy contributing material to this project, you grant Standard C++ Foundation,\nand those who receive the material directly or indirectly from Standard C++\nFoundation, a perpetual, worldwide, non-exclusive, royalty-free, irrevocable,\ntransferrable license to reproduce, prepare derivative works of, publicly\ndisplay, publicly perform, and distribute your contributed material and such\nderivative works, and to sublicense any or all of the foregoing rights to third\nparties for commercial or non-commercial use.  You also grant Standard C++\nFoundation, and those who receive the material directly or indirectly from\nStandard C++ Foundation, a perpetual, worldwide, non-exclusive, royalty-free,\nirrevocable license under your patent claims that directly read on your\ncontributed material to make, have made, use, offer to sell, sell and import\nor otherwise dispose of the material. You warrant that your material is your\noriginal work, or that you have the right to grant the above licenses.\n\nTHE PROJECT IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE PROJECT OR THE USE OR OTHER DEALINGS IN THE\nPROJECT.\n\nIf you believe that anything in the project infringes your copyright, please\ncontact us at admin@isocpp.org with your contact information and a detailed\ndescription of your intellectual property, including a specific URL where you\nbelieve your intellectual property is being infringed."
}