{
  "key": "cryptopp",
  "short_name": "Crypto++ License",
  "name": "Crypto++ License",
  "category": "Permissive",
  "owner": "Wei Dai",
  "spdx_license_key": "LicenseRef-scancode-cryptopp",
  "ignorable_copyrights": [
    "Copyright (c) 1995-2010 by Wei Dai"
  ],
  "ignorable_holders": [
    "Wei Dai"
  ],
  "text": "Compilation Copyright (c) 1995-2010 by Wei Dai. All rights reserved.\n\nThis copyright applies only to this software distribution package as a\ncompilation, and does not imply a copyright on any particular file in the\npackage.\n\nAll individual files in this compilation are placed in the public domain by Wei\nDai and other contributors. I would like to thank the following authors for\nplacing their works into the public domain:\n\nJoan Daemen - 3way.cpp Leonard Janke - cast.cpp, seal.cpp Steve Reid - cast.cpp\nPhil Karn - des.cpp Andrew M. Kuchling - md2.cpp, md4.cpp Colin Plumb - md5.cpp\nSeal Woods - rc6.cpp Chris Morgan - rijndael.cpp Paulo Baretto - rijndael.cpp,\nskipjack.cpp, square.cpp Richard De Moliner - safer.cpp Matthew Skala -\ntwofish.cpp Kevin Springle - camellia.cpp, shacal2.cpp, ttmac.cpp, whrlpool.cpp,\nripemd.cpp\n\nPermission to use, copy, modify, and distribute this compilation for any\npurpose, including commercial applications, is hereby granted without fee,\nsubject to the following restrictions:\n\n1. Any copy or modification of this compilation in any form, except in object\ncode form as part of an application software, must include the above copyright\nnotice and this license.\n\n2. Users of this software agree that any modification or extension they provide\nto Wei Dai will be considered public domain and not copyrighted unless it\nincludes an explicit copyright notice.\n\n3. Wei Dai makes no warranty or representation that the operation of the\nsoftware in this compilation will be error-free, and Wei Dai is under no\nobligation to provide any services, by way of maintenance, update, or otherwise.\nTHE SOFTWARE AND ANY DOCUMENTATION ARE PROVIDED \"AS IS\" WITHOUT EXPRESS OR\nIMPLIED WARRANTY INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL WEI DAI\nOR ANY OTHER CONTRIBUTOR BE LIABLE FOR DIRECT, INCIDENTAL OR CONSEQUENTIAL\nDAMAGES, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n4. Users will not use Wei Dai or any other contributor's name in any publicity\nor advertising, without prior written consent in each case.\n\n5. Export of this software from the United States may require a specific license\nfrom the United States Government. It is the responsibility of any person or\norganization contemplating export to obtain such a license before exporting.\n\n6. Certain parts of this software may be protected by patents. It is the users'\nresponsibility to obtain the appropriate licenses before using those parts.\n\nIf this compilation is used in object code form in an application software,\nacknowledgement of the author is not required but would be appreciated. The\ncontribution of any useful modifications or extensions to Wei Dai is not\nrequired but would also be appreciated."
}