{
  "key": "csla",
  "short_name": "CSLA License",
  "name": "CSLA .NET License",
  "category": "Free Restricted",
  "owner": "Marimer, LLC",
  "homepage_url": "https://github.com/MarimerLLC/csla/blob/master/license.txt",
  "spdx_license_key": "LicenseRef-scancode-csla",
  "text_urls": [
    "https://github.com/MarimerLLC/csla/blob/0650fd13adc4689dcd6ec7b8f4609563ee12f401/license.md"
  ],
  "ignorable_copyrights": [
    "Copyright 2013 by Marimer, LLC, Eden Prairie, MN",
    "Copyright 2013 by Marimer, LLC."
  ],
  "ignorable_holders": [
    "Marimer, LLC, Eden Prairie, MN",
    "Marimer, LLC."
  ],
  "text": "LICENSE AND WARRANTY\nVersion 4.0.3\n\nThe CSLA .NET framework is Copyright 2013 by Marimer, LLC. \n\nYou can use this Software for any noncommercial purpose, including \ndistributing derivative works. You can use this Software for any commercial \npurpose other than you may not use it, in whole or in part, to create a \ncommercial framework product. \n\nIn short, you can use CSLA .NET and modify it to create other commercial or \nbusiness software, you just can't take the framework itself, modify it and \nsell it as a product. \n\nIn return, the owner simply requires that you agree: \n\nThis Software License Agreement (\"Agreement\") is effective \nupon your use of CSLA .NET (\"Software\").\n\n1. Ownership.\nThe CSLA .NET framework is Copyright 2013 by Marimer, LLC, \nEden Prairie, MN, USA. \n\n2. Copyright Notice.\nYou must not remove any copyright notices from the Software source code. \n\n3. License.\nThe owner hereby grants a perpetual, non-exclusive, limited license to use \nthe Software as set forth in this Agreement.\n\n4. Source Code Distribution.\nIf you distribute the Software in source code form you must do so only under \nthis License (i.e. you must include a complete copy of this License with \nyour distribution).\n\n5. Binary or Object Distribution.\nYou may distribute the Software in binary or object form with no requirement \nto display copyright notices to the end user. The binary or object form must \nretain the copyright notices included in the Software source code.\n\n6. Restrictions.\nYou may not sell the Software. If you create a software development framework \nbased on the Software as a derivative work, you may not sell that derivative \nwork. This does not restrict the use of the Software for creation of other \ntypes of non-commercial or commercial applications or derivative works. \n\n7. Disclaimer of Warranty.\nThe Software comes \"as is\", with no warranties. None whatsoever. This means \nno express, implied, statutory or other warranty, including without \nlimitation, warranties of merchantability or fitness for a particular \npurpose, noninfringement, or the presence or absence of errors, whether or \nnot discoverable. You, and your distributees, use this Software at your own \nrisk. Also, you must pass this disclaimer on whenever you distribute \nthe Software. \n\n8. Liability.\nNeither Marimer, LLC nor any contributor to the Software will be liable \nfor any type of direct damages or for any of those types of damages known \nas indirect, special, consequential, incidental, punitive or exemplary \nrelated to the Software or this License, to the maximum extent the law \npermits, no matter what legal theory it’s based on. Also, you must pass \nthis limitation of liability on whenever you distribute the Software. \n\n9. Patents.\nIf you sue anyone over patents that you think may apply to the Software \nfor a person's use of the Software, your license to the Software ends \nautomatically. \n\nThe patent rights, if any, licensed hereunder only apply to the Software, \nnot to any derivative works you make. \n\n10. Termination.\nYour rights under this License end automatically if you breach it in any way.\n\nMarimer, LLC reserves the right to release the Software under different \nlicense terms or to stop distributing the Software at any time. Such an \nelection will not serve to withdraw this Agreement, and this Agreement will \ncontinue in full force and effect unless terminated as stated above.\n\n11. Governing Law.\nThis Agreement shall be construed and enforced in accordance with the laws \nof the state of Minnesota, USA.\n\n12. No Assignment.\nNeither this Agreement nor any interest in this Agreement may be assigned \nby Licensee without the prior express written approval of Developer.\n\n13. Final Agreement.\nThis Agreement terminates and supersedes all prior understandings or \nagreements on the subject matter hereof.  This Agreement may be modified \nonly by a further writing that is duly executed by both parties.\n\n14. Severability.\nIf any term of this Agreement is held by a court of competent jurisdiction \nto be invalid or unenforceable, then this Agreement, including all of the \nremaining terms, will remain in full force and effect as if such invalid \nor unenforceable term had never been included.\n\n15. Headings.\nHeadings used in this Agreement are provided for convenience only and shall \nnot be used to construe meaning or intent."
}