{
  "key": "ctl-linux-firmware",
  "short_name": "Creative Technology Linux Firmware License",
  "name": "Creative Technology Linux Firmware License",
  "category": "Proprietary Free",
  "owner": "Creative Technology Ltd",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.ca0132",
  "spdx_license_key": "LicenseRef-scancode-ctl-linux-firmware",
  "ignorable_urls": [
    "http://opensource.org/licenses"
  ],
  "text": "Redistribution.  Redistribution and use in binary form, without\nmodification, are permitted provided that the following conditions are\nmet:\n\n* Redistributions must reproduce the above copyright notice and the\n  following disclaimer in the documentation and/or other materials\n  provided with the distribution.\n* Neither the name of Creative Technology Ltd or its affiliates (\"CTL\")\n  nor the names of its suppliers may be used to endorse or promote\n  products derived from this software without specific prior written\n  permission.\n* No reverse engineering, decompilation, or disassembly of this software\n  (or any part thereof) is permitted.\n\nLimited patent license. CTL grants a limited, world-wide,\nroyalty-free, non-exclusive license under patents it now or hereafter\nowns or controls to make, have made, use, import, offer to sell and\nsell (\"Utilize\") this software, but strictly only to the extent that any\nsuch patent is necessary to Utilize the software alone, or in\ncombination with an operating system licensed under an approved Open\nSource license as listed by the Open Source Initiative at\nhttp://opensource.org/licenses.  The patent license shall not be\napplicable, to any other combinations which include this software.\nNo hardware per se is licensed hereunder.\n\nDISCLAIMER.  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND\nCONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,\nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\nCOPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\nBUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS\nOF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\nTORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\nUSE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGE.\n\nNO OTHER RIGHTS GRANTED. USER HEREBY ACKNOWLEDGES AND AGREES THAT USE OF\nTHIS SOFTWARE SHALL NOT CREATE OR GIVE GROUNDS FOR A LICENSE BY\nIMPLICATION, ESTOPPEL, OR OTHERWISE TO ANY INTELLECTUAL PROPERTY RIGHTS\n(PATENT, COPYRIGHT, TRADE SECRET, MASK WORK, OR OTHER PROPRIETARY RIGHT)\nEMBODIED IN ANY OTHER CTL HARDWARE OR SOFTWARE WHETHER SOLELY OR IN\nCOMBINATION WITH THIS SOFTWARE."
}