{
  "key": "cypress-linux-firmware",
  "short_name": "Cypress Linux Firmware License",
  "name": "Cypress Linux Firmware License",
  "category": "Proprietary Free",
  "owner": "Cypress Wireless",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.cypress",
  "spdx_license_key": "LicenseRef-scancode-cypress-linux-firmware",
  "ignorable_urls": [
    "http://www.cypress.com/go/opensource"
  ],
  "text": "### CYPRESS WIRELESS CONNECTIVITY DEVICES\n### DRIVER END USER LICENSE AGREEMENT (SOURCE AND BINARY DISTRIBUTION)\n\nPLEASE READ THIS END USER LICENSE AGREEMENT (\"Agreement\") CAREFULLY BEFORE\nDOWNLOADING, INSTALLING, OR USING THIS SOFTWARE, ANY ACCOMPANYING\nDOCUMENTATION, OR ANY UPDATES PROVIDED BY CYPRESS (\"Software\").  BY\nDOWNLOADING, INSTALLING, OR USING THE SOFTWARE, YOU ARE AGREEING TO BE BOUND\nBY THIS AGREEMENT.  IF YOU DO NOT AGREE TO ALL OF THE TERMS OF THIS\nAGREEMENT, PROMPTLY RETURN AND DO NOT USE THE SOFTWARE.  IF YOU HAVE\nPURCHASED THE SOFTWARE, YOUR RIGHT TO RETURN THE SOFTWARE EXPIRES 30 DAYS\nAFTER YOUR PURCHASE AND APPLIES ONLY TO THE ORIGINAL PURCHASER.\n\nSoftware Provided in Binary Code Form.  This paragraph applies to any Software\nprovided in binary code form.  Subject to the terms and conditions of this\nAgreement, Cypress Semiconductor Corporation (\"Cypress\") grants you a\nnon-exclusive, non-transferable license under its copyright rights in the\nSoftware to reproduce and distribute the Software in object code form only,\nsolely for use in connection with Cypress integrated circuit products\n(\"Purpose\").\n\nSoftware Provided in Source Code Form.  This paragraph applies to any Software\nprovided in source code form (\"Cypress Source Code\").  Subject to the terms and\nconditions of this Agreement, Cypress grants you a non-exclusive,\nnon-transferable license under its copyright rights in the Cypress Source Code\nto reproduce, modify, compile, and distribute the Cypress Source Code (whether\nin source code form or as compiled into binary code form) solely for the\nPurpose.  Cypress retains ownership of the Cypress Source Code and any compiled\nversion thereof.  Subject to Cypress' ownership of the underlying Cypress\nSource Code, you retain ownership of any modifications you make to the\nCypress Source Code.  You agree not to remove any Cypress copyright or other\nnotices from the Cypress Source Code and any modifications thereof.  Any\nreproduction, modification, translation, compilation, or representation of\nthe Cypress Source Code except as permitted in this paragraph is prohibited\nwithout the express written permission of Cypress.\n\nFree and Open Source Software.  Portions of the Software may be licensed under\nfree and/or open source licenses such as the GNU General Public License\n(\"FOSS\").  FOSS is subject to the applicable license agreement and not this\nAgreement.  If you are entitled to receive the source code from Cypress for any\nFOSS included with the Software, either the source code will  be included with\nthe Software or you may obtain the source code at no charge from\n<http://www.cypress.com/go/opensource>.  The applicable license terms will\naccompany each source code package.  To review the license terms applicable to\nany FOSS for which Cypress is not required to provide you with source code,\nplease see the Software's installation directory on your computer.\n\nProprietary Rights.  The Software, including all intellectual property rights\ntherein, is and will remain the sole and exclusive property of Cypress or its\nsuppliers.  Except as otherwise expressly provided in this Agreement, you may\nnot: (i) modify, adapt, or create derivative works based upon the Software;\n(ii) copy the Software; (iii) except and only to the extent explicitly\npermitted by applicable law despite this limitation, decompile, translate,\nreverse engineer, disassemble or otherwise reduce the Software to\nhuman-readable form; or (iv) use the Software other than for the Purpose.\n\nNo Support.  Cypress may, but is not required to, provide technical support for\nthe Software.\n\nTerm and Termination.  This Agreement is effective until terminated.  This\nAgreement and Your license rights will terminate immediately without notice\nfrom Cypress if you fail to comply with any provision of this Agreement.  Upon\ntermination, you must destroy all copies of Software in your possession or\ncontrol.  Termination of this Agreement will not affect any licenses validly\ngranted as of the termination date to any end users of the Software.  The\nfollowing paragraphs shall survive any termination of this Agreement: \"Free and\nOpen Source Software,\" \"Proprietary Rights,\" \"Compliance With Law,\"\n\"Disclaimer,\" \"Limitation of Liability,\" and \"General.\"\n\nCompliance With Law.  Each party agrees to comply with all applicable laws,\nrules and regulations in connection with its activities under this Agreement.\nWithout limiting the foregoing, the Software may be subject to export control\nlaws and regulations of the United States and other countries.  You agree to\ncomply strictly with all such laws and regulations and acknowledge that you\nhave the responsibility to obtain licenses to export, re-export, or import\nthe Software.\n\nDisclaimer.  TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, CYPRESS MAKES\nNO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH REGARD TO THE SOFTWARE,\nINCLUDING, BUT NOT LIMITED TO, INFRINGEMENT AND THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress reserves the\nright to make changes to the Software without notice. Cypress does not assume\nany liability arising out of the application or use of Software or any\nproduct or circuit described in the Software. Cypress does not authorize its\nproducts for use as critical components in life-support systems where a\nmalfunction or failure may reasonably be expected to result in significant\ninjury to the user. The inclusion of Cypress' product in a life-support\nsystem or application implies that the manufacturer of such system or\napplication assumes all risk of such use and in doing so indemnifies Cypress\nagainst all charges.\n\nLimitation of Liability.  IN NO EVENT WILL CYPRESS OR ITS SUPPLIERS,\nRESELLERS, OR DISTRIBUTORS BE LIABLE FOR ANY LOST REVENUE, PROFIT, OR DATA,\nOR FOR SPECIAL, INDIRECT, CONSEQUENTIAL, INCIDENTAL, OR PUNITIVE DAMAGES\nHOWEVER CAUSED AND REGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF THE\nUSE OF OR INABILITY TO USE THE SOFTWARE EVEN IF CYPRESS OR ITS SUPPLIERS,\nRESELLERS, OR DISTRIBUTORS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.  IN NO EVENT SHALL CYPRESS' OR ITS SUPPLIERS' RESELLERS', OR\nDISTRIBUTORS' TOTAL LIABILITY TO YOU, WHETHER IN CONTRACT, TORT (INCLUDING\nNEGLIGENCE), OR OTHERWISE, EXCEED THE PRICE PAID BY YOU FOR THE SOFTWARE.\nTHE FOREGOING LIMITATIONS SHALL APPLY EVEN IF THE ABOVE-STATED WARRANTY FAILS\nOF ITS ESSENTIAL PURPOSE.  BECAUSE SOME STATES OR JURISDICTIONS DO NOT ALLOW\nLIMITATION OR EXCLUSION OF CONSEQUENTIAL OR INCIDENTAL DAMAGES, THE ABOVE\nLIMITATION MAY NOT APPLY TO YOU.\n\nRestricted Rights.  The Software under this Agreement is commercial computer\nsoftware as that term is described in 48 C.F.R. 252.227-7014(a)(1).  If\nacquired by or on behalf of a civilian agency, the U.S. Government acquires\nthis commercial computer software and/or commercial computer software\ndocumentation subject to the terms of this Agreement as specified in 48\nC.F.R. 12.212 (Computer Software) and 12.211 (Technical Data) of the Federal\nAcquisition Regulations (\"FAR\") and its successors.  If acquired by or on\nbehalf of any agency within the Department of Defense (\"DOD\"), the U.S.\nGovernment acquires this commercial computer software and/or commercial\ncomputer software documentation subject to the terms of this Agreement as\nspecified in 48 C.F.R. 227.7202-3 of the DOD FAR Supplement (\"DFAR\") and its\nsuccessors.\n\nGeneral.  This Agreement will bind and inure to the benefit of each party's\nsuccessors and assigns, provided that you may not assign or transfer this\nAgreement, in whole or in part, without Cypress' written consent.  This\nAgreement shall be governed by and construed in accordance with the laws of\nthe State of California, United States of America, as if performed wholly\nwithin the state and without giving effect to the principles of conflict of\nlaw.  The parties consent to personal and exclusive jurisdiction of and venue\nin, the state and federal courts within Santa Clara County, California;\nprovided however, that nothing in this Agreement will limit Cypress' right to\nbring legal action in any venue in order to protect or enforce its\nintellectual property rights.  No failure of either party to exercise or\nenforce any of its rights under this Agreement will act as a waiver of such\nrights.  If any portion hereof is found to be void or unenforceable, the\nremaining provisions of this Agreement shall remain in full force and\neffect.  This Agreement is the complete and exclusive agreement between the\nparties with respect to the subject matter hereof, superseding and replacing\nany and all prior agreements, communications, and understandings (both\nwritten and oral) regarding such subject matter.  Any notice to Cypress will\nbe deemed effective when actually received and must be sent to Cypress\nSemiconductor Corporation, ATTN: Chief Legal Officer, 198 Champion Court, San\nJose, CA 95134 USA."
}