{
  "key": "d-fsl-1.0-en",
  "short_name": "German Free Software License",
  "name": "German Free Software License",
  "category": "Copyleft",
  "owner": "Institute for Legal Issues On Free and Open Source Software",
  "homepage_url": "http://www.dipp.nrw.de/d-fsl/index_html/lizenzen/en/D-FSL-1_0_en.txt",
  "spdx_license_key": "LicenseRef-scancode-d-fsl-1.0-en",
  "text_urls": [
    "http://www.dipp.nrw.de/d-fsl/index_html/lizenzen/en/D-FSL-1_0_en.txt"
  ],
  "faq_url": "http://www.d-fsl.org/",
  "other_urls": [
    "http://www.dipp.nrw.de/d-fsl/index_html/lizenzen/de/D-FSL-1_0_de.txt",
    "http://www.dipp.nrw.de/d-fsl/nutzer/"
  ],
  "minimum_coverage": 10,
  "ignorable_copyrights": [
    "(c) Ministry of Science and Research, State of North-Rhine Westphalia 2004"
  ],
  "ignorable_holders": [
    "Ministry of Science and Research, State of North-Rhine Westphalia"
  ],
  "ignorable_authors": [
    "Axel Metzger and Till Jaeger, Institut fur Rechtsfragen der Freien"
  ],
  "ignorable_urls": [
    "http://www.d-fsl.org/",
    "http://www.fsf.org/licenses/gpl",
    "http://www.ifross.de/"
  ],
  "text": "German Free Software License\n\n(c) Ministry of Science and Research, State of \nNorth-Rhine Westphalia 2004\n\nDeveloped and created by Axel Metzger and Till \nJaeger, Institut für Rechtsfragen der Freien und \nOpen Source Software (Institute for Legal Issues \nOn Free and Open Source Software), \n<http://www.ifross.de>.\n\nPreamble\n\nSoftware is more than a mere economic asset. It \nis the technical foundation of the information \nsociety. Therefore, the issue of the public share \nin software is of particular importance. \nConventionally licensed computer programs are \ndistributed in object code form only, and the \nuser is not entitled to modify or pass on the \nprogram to third parties. The license model for \nFree Software (synonym \"Open Source Software\"), \nhowever, grants comprehensive rights in the \nhandling of the program. The German Free Software \nLicense is based on this license model. It gives \nyou the right to use the program in a \ncomprehensive manner. You are allowed to modify \nthe computer program according to your \nrequirements or to reproduce or distribute it and \nmake it publicly available in a modified or \nunmodified form. These rights are granted free of \ncharge. \n\nHowever, the German Free Software License \ncombines these rights with certain obligations \nthat will ensure the free circulation of the \nprogram and all further developments published. \nIf you distribute the program or make it publicly \navailable, you have to include a copy of this \nlicense to anyone receiving the program from you \nand enable access to its source code. Another \nobligation arises from further developments of \nthe program. Modifications to the program which \nyou distribute or make publicly available shall \nbe released in accordance with the conditions of \nthis license. \n\nGerman Free Software License takes into account \nthe special requirements of German and European \nlaw. It is drafted bilingually and thus intended \nfor international distribution. \n\n\nSection 0 Definitions\n\nDocumentation: Description of composition, \narchitecture and/or structure of the programming \nprocess and/or functionalities of the program, \nirrespective of whether they were done in the \nSource Code or separately.\n\nLicense: The agreement concluded between the \nlicensor and you, with the content of the German \nFree Software License and/or the pertaining \noffer. \n\nLicensee: Every natural or legal entity who has \naccepted this License.\n\nProgram: Every computer program which has been \ndistributed or made publicly available by the \nentitled person in accordance with the terms of \nthis License.\n\nObject Code: The machine-readable form of the \nProgram.\n\nPublic/publicly: Not solely directed towards a \ncertain group of people who have a personal \nconnection to each other or are associated \nthrough their affiliation with a legal person or \npublic organisation.\n\nMaking Publicly Available: The public \ndistribution of the Program in an immaterial \nform, in particular, by making it available for \ndownload in data networks.  \n\nEntitled Person(s): The author(s) or other \nholders of the exclusive right to use for the \nProgram.\n\nSource Code: The form of the Program represented \nin programming language and readable for humans.\n\nModification: Any extension, shortening and/or \nalteration of the Program, including, but not \nlimited to further developments.\n\nDistribution: The public passing on of material \ncopies to third parties, in particular, onto \nstorage devices or in connection with hardware.  \n\nComplete Source Code: The Source Code in the form \nused for preparation and/or modification together \nwith the configuration files and software tools \nrequired for compilation and installation, \nprovided that these are not commonly used in the \nrequired form (e.g. standard compiler) or can be \ndownloaded by any Internet user without license \nfee.\n\n\nSection 1 Rights\n\n(1) You may reproduce and distribute the Program \nand make it publicly available in an unmodified \nform. \n\n(2) You may modify the Program and reproduce and \ndistribute modified versions and make them \npublicly available. It is also permitted to \ncombine the Program or parts thereof with other \nprograms. \n\n(3) You obtain the rights free of charge.\n\n\nSection 2 Obligations for Distribution and Making \nPublicly Available\n\n(1) If you distribute the Program or make it \npublicly available, be it in unmodified or \nmodified form, be it in combination with other \nprograms or in connection with hardware, you also \nhave to provide or include the following:\n\n1. all references to this License in the Source \nCode and/or Object Code;\n \n2. all references in the Source Code and/or \nObject Code containing information about the \nauthor of the Program;\n\n3. a conspicuous reference to this License and \nthe Internet address <http://www.d-fsl.org>, to \nbe displayed in a form that can easily be read by \nthe recipient;\n\n4. the complete text of this License in a form \neasy to perceive.\n\n(2) If license and/or contract terms are \ndisplayed when the Program is installed and/or \nstarted, the following items must also be \ndisplayed:\n\n1. this License;\n\n2. a reference to this License; and\n\n3. a reference to the Entitled Person(s) to the \ninitial program components used under this \nLicense.\n\n(3) You may not make the use of the Program \ncontingent upon the compliance with conditions or \nobligations that are not set forth in this \nLicense. \n\n(4) Provided that you have received Documentation \nfor the Program, you have to deliver this \nDocumentation with the Program, as well, unless \nfree delivery of the Documentation is not \npermitted by the documentation license.\n\n\nSection 3 Further Obligations regarding the \nDistribution of Modified Versions \n\n(1) You may only distribute modified versions of \nthe Program or make them publicly available in \naccordance with the terms of this License, so \nthat any third party is able to make use of the \nmodified Program as a whole under this License. \n\n(2) If the Program or a part thereof is combined \nwith another program, this also applies to the \nentire combination as a modified version of the \nProgram, unless the other program is independent \nin terms of form and content.  Another program \nshall be regarded as independent if it fulfils \nthe following requirements:\n\n1. The Source Code of the combined programs must \nbe contained in separate files which do not \ninclude components of the other part except for \nparts containing the information customary and \nrequired for the Program combination. The Source \nCode of the other program does not have to be \ndelivered.\n\n2. The part which is combined with the Program \nmust also be reasonably usable when not combined \nwith the Program, i.e. on a standalone basis or \nwith other programs. The meaning of \"reasonably \nusable\" will be based on the opinion of pertinent \ncircles of expert groups in the relevant field. \nSuch circles of experts include everyone who \ndevelops, uses, distributes or makes publicly \navailable the Program concerned or programs with \nsimilar functionality.\n\n(3) If you distribute or make publicly available \nthe Program or parts thereof - modified or \nunmodified - in combination with another program \nlicensed under the GNU General Public License \n(GPL), the Program may also be used under \nconditions of the GPL, provided it constitutes a \n\"derivative work\" together with the other program \nin the sense of the GPL. In this case, any \nreference to this License should be removed and \nreplaced by a reference to the GPL. Whether a \n\"derivative work\" in the sense of the GPL arises \nfrom this combination is primarily defined in \nsection 2 b) of the GPL. This provision reads: \n\"You must cause any work that you distribute or \npublish, that in whole or in part contains or is \nderived from the Program or any part thereof, to \nbe licensed as a whole at no charge to all third \nparties under the terms of this License.\" The GPL \ncan be obtained under \n<http://www.fsf.org/licenses/gpl>.\n\n(4) If you distribute the Program or make it \npublicly available in a modified form, you must \ninclude a reference to the modifications and the \ndate of the modification in the Source Code. This \nreference must reveal which modifications were \ncarried out and include existing references \ncontaining information on the author of the \nProgram. This applies to whether or not you add \nyour own copyright notice. Instead of a reference \nin the Source Code you may also use or carry on a \nversion control system, provided this is also \ndistributed or made publicly available. \n\n(5) You may not charge any third party for the \ngranting of the non-exclusive rights of use for \nthe Program.\n\n(6) If you acquire any other intellectual or \nindustrial property right to this Program apart \nfrom a copyright, in particular a patent or \nutility model, you license this intellectual or \nindustrial property right for modified or \nunmodified versions of the Program to the extent \nthat is necessary to make due use of the rights \narising from this License. \n\n\nSection 4 Further Obligations for the \nDistribution of the Object Code\n\n(1) If you distribute the Program in Object Code \nform only, apart from the obligations defined in \nSections 2 and 3, you have to either:\n\n1. make the Complete Source Code publicly \navailable in the Internet and - when distributing \nthe Object Code - make a clear reference to the \ncomplete Internet address from which the Source \nCode can be downloaded; or\n\n2.  distribute the Complete Source Code on a \ncustomary data carrier, taking into consideration \nSections 2 and 3.\n\n(2) If you make the Program publicly available in \nObject Code form, apart from the obligations \ndefined in Sections 2 and 3 you must also make \nthe Complete Source Code publicly available in \nthe Internet and make a clear reference to the \ncomplete Internet address.\n\n(3) Provided that you have received the \nDocumentation for the Program, you have to \ndeliver this Documentation together with the \nProgram in accordance with Subsections 1 and 2, \nas well, unless free delivery of the \nDocumentation is not permitted by the \ndocumentation license.\n\n\nSection 5 Conclusion of the Contract\n\n(1) With this License you and any other person \nare offered the conclusion of a contract for the \nuse of this Program under the conditions of this \nLicense.\n\n(2) You may use the Program in accordance with \nthe applicable statutory provisions for the \nintended purpose without having to accept this \nLicense. In the European Union and in most other \nlegal systems, this right in particular includes \nthe following authorizations: \n\n1. Running of the Program as well as reproducing \non hard-drive and RAM  required for this;\n\n2. Making of a back-up copy;\n\n3. Correcting errors;\n\n4. Distributing a lawfully acquired physical copy \nof the Program.\n \n(3) You declare your acceptance of this License \nby distributing the Program, making it publicly \navailable, modifying or reproducing it in a way \nthat goes beyond the intended use in the sense of \nSubsection 2. From this time on, this License \nshall be deemed as a legally binding agreement \nbetween the Entitled Persons and you, without the \nneed for the Entitled Persons to obtain a \ndeclaration of acceptance.\n\n(4) You and any other licensee acquire the rights \narising from this License directly from the \nEntitled Persons. Any sub-licensing or transfer \nof rights is not permitted.\n \n\nSection 6 Termination of Rights in the Event of \nViolations\n\n(1) Any violation of your obligations under this \nLicense automatically leads to the termination of \nyour rights under this License. \n\n(2) Any rights of third parties having obtained \nthe Program or rights to the Program from you \nshall remain unaffected. \n\n\nSection 7 Liability and Warranty\n\n(1) The Entitled Persons are only liable for \nconflicting third-party rights if they were aware \nof such rights without informing you.\n\n(2) Liability for errors and/or other defects in \nthe Program shall be governed by agreements \nconcluded between you and the Entitled Person \nbeyond the scope of this License or, if no such \nagreement exists, by the pertinent statutory \nprovisions.  \n\n\nSection 8 Agreements with Third Parties\n\n(1) This License only governs the relationship \nbetween you and the Entitled Persons. It is not \npart of agreements between you and third parties. \n\n(2) This License does not limit your freedom to \nconclude agreements of any content whatsoever \nwith third parties obtaining copies of the \nProgram from you or purchasing services from you \nin connection with the Program, provided that you \nfulfil your obligations under this License and \nthird-party rights under this License are not \ninfringed. In particular, you may charge a fee as \nconsideration for the transfer of the Program or \nother services.  \n\n(3) This License does not commit you to forward \nthe Program to a third party. You are free to \ndecide to whom you wish to make the Program \navailable. However, you may not prevent or \ncomplicate further use by third parties through \nthe use of technical protective measures, in \nparticular, the use of copy protection of any \nkind. Password-protected access restriction or \nuse in an Intranet shall not be regarded as \ntechnical protective measures.\n\n\nSection 9 Text of the License\n\n(1) This License is written in German and \nEnglish. Both versions are equally binding. It is \nassumed that terminology used in the License has \nthe same meaning in both versions. Should, \nhowever, differences arise, such meaning is \nauthoritative which best brings into line both \nversions, taking into consideration the aim and \npurpose of the License. \n\n(2) The license board of the German Free Software \nLicense may put into force binding new versions \nof this License inasmuch as this is required and \nreasonable. New versions of the License will be \npublished on the Internet site <http://www.d-\nfsl.org> with a unique version number. The new \nversion of the License becomes binding for you as \nsoon as you become aware of its publication. \nLegal remedies against the modification of the \nLicense are not restricted by the regulations \ndescribed above. \n\n(3) You may reproduce and distribute this License \nand make it publicly available in an unmodified \nform. \n\n\nSection 10 Applicable Law\n\nThe License is governed by German law.\n\n\nAppendix: How to submit a Program to the German \nFree Software License.\n\nIn order to make it possible for anyone to \nconclude this License, it is recommended to \ninclude the following reference to the License in \nthe Program:\n\n\"Copyright (C) 20[yy] [Name of the Entitled \nPerson]. \n\nThis Program may be used by anyone in accordance \nwith the terms of the German Free Software \nLicense\n\nThe License may be obtained under <http://www.d-fsl.org>.\"\n"
}