{
  "key": "day-spec",
  "short_name": "Day Specification License",
  "name": "Day Specification License",
  "category": "Proprietary Free",
  "owner": "Day Management AG",
  "homepage_url": "http://www.day.com/maven/jsr170/jars/LICENSE.txt",
  "spdx_license_key": "LicenseRef-scancode-day-spec",
  "text_urls": [
    "http://www.day.com/maven/jsr170/jars/LICENSE.txt",
    "http://www.day.com/maven/jsr170/licenses/day-spec-license.htm"
  ],
  "minimum_coverage": 70,
  "ignorable_copyrights": [
    "Copyright 2005 Day Management AG Barfusserplatz 6, 4001 Basel, Switzerland"
  ],
  "ignorable_holders": [
    "Day Management AG Barfusserplatz 6, 4001 Basel, Switzerland"
  ],
  "text": "[Day Specification License]\n\nDay Management AG (\"Licensor\") is willing to license this specification\nto you ONLY UPON THE CONDITION THAT YOU ACCEPT ALL OF THE TERMS CONTAINED\nIN THIS LICENSE AGREEMENT (\"Agreement\"). Please read the terms and\nconditions of this Agreement carefully.\n\nContent Repository for JavaTM Technology API Specification (\"Specification\")\nVersion: 1.0\nStatus: FCS\nRelease: 11 May 2005\n\nCopyright 2005 Day Management AG\nBarfüsserplatz 6, 4001 Basel, Switzerland.\nAll rights reserved.\n\nNOTICE; LIMITED LICENSE GRANTS\n\n1. License for Purposes of Evaluation and Developing Applications.\nLicensor hereby grants you a fully-paid, non-exclusive, non-transferable,\nworldwide, limited license (without the right to sublicense), under\nLicensor's applicable intellectual property rights to view, download,\nuse and reproduce the Specification only for the purpose of internal\nevaluation. This includes developing applications intended to run on an\nimplementation of the Specification provided that such applications do\nnot themselves implement any portion(s) of the Specification.\n\n2. License for the Distribution of Compliant Implementations. Licensor\nalso grants you a perpetual, non-exclusive, non-transferable, worldwide,\nfully paid-up, royalty free, limited license (without the right to\nsublicense) under any applicable copyrights or, subject to the provisions\nof subsection 4 below, patent rights it may have covering the\nSpecification to create and/or distribute an Independent Implementation\nof the Specification that: (a) fully implements the Specification\nincluding all its required interfaces and functionality; (b) does not\nmodify, subset, superset or otherwise extend the Licensor Name Space, or\ninclude any public or protected packages, classes, Java interfaces, fields\nor methods within the Licensor Name Space other than those\nrequired/authorized by the Specification or Specifications being\nimplemented; and (c) passes the Technology Compatibility Kit (including\nsatisfying the requirements of the applicable TCK Users Guide) for such\nSpecification (\"Compliant Implementation\"). In addition, the foregoing\nlicense is expressly conditioned on your not acting outside its scope.\nNo license is granted hereunder for any other purpose (including, for\nexample, modifying the Specification, other than to the extent of your\nfair use rights, or distributing the Specification to third parties).\n\n3. Pass-through Conditions. You need not include limitations (a)-(c) from\nthe previous paragraph or any other particular \"pass through\" requirements\nin any license You grant concerning the use of your Independent\nImplementation or products derived from it. However, except with respect\nto Independent Implementations (and products derived from them) that\nsatisfy limitations (a)-(c) from the previous paragraph, You may neither:\n(a) grant or otherwise pass through to your licensees any licenses under\nLicensor's applicable intellectual property rights; nor (b) authorize your\nlicensees to make any claims concerning their implementation's compliance\nwith the Specification.\n\n4. Reciprocity Concerning Patent Licenses. With respect to any patent\nclaims covered by the license granted under subparagraph 2 above that\nwould be infringed by all technically feasible implementations of the\nSpecification, such license is conditioned upon your offering on fair,\nreasonable and non-discriminatory terms, to any party seeking it from\nYou, a perpetual, non-exclusive, non-transferable, worldwide license\nunder Your patent rights that are or would be infringed by all technically\nfeasible implementations of the Specification to develop, distribute and\nuse a Compliant Implementation.\n\n5. Definitions. For the purposes of this Agreement: \"Independent\nImplementation\" shall mean an implementation of the Specification that\nneither derives from any of Licensor's source code or binary code\nmaterials nor, except with an appropriate and separate license from\nLicensor, includes any of Licensor's source code or binary code materials;\n\"Licensor Name Space\" shall mean the public class or interface\ndeclarations whose names begin with \"java\", \"javax\", \"javax.jcr\" or their\nequivalents in any subsequent naming convention adopted by Licensor\nthrough the Java Community Process, or any recognized successors or\nreplacements thereof; and \"Technology Compatibility Kit\" or \"TCK\" shall\nmean the test suite and accompanying TCK User's Guide provided by\nLicensor which corresponds to the particular version of the Specification\nbeing tested.\n\n6. Termination. This Agreement will terminate immediately without notice\nfrom Licensor if you fail to comply with any material provision of or act\noutside the scope of the licenses granted above.\n\n7. Trademarks. No right, title, or interest in or to any trademarks,\nservice marks, or trade names of Licensor is granted hereunder. Java is\na registered trademark of Sun Microsystems, Inc. in the United States and\nother countries.\n\n8. Disclaimer of Warranties. The Specification is provided \"AS IS\".\nLICENSOR MAKES NO REPRESENTATIONS OR WARRANTIES, EITHER EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT (INCLUDING AS A\nCONSEQUENCE OF ANY PRACTICE OR IMPLEMENTATION OF THE SPECIFICATION), OR\nTHAT THE CONTENTS OF THE SPECIFICATION ARE SUITABLE FOR ANY PURPOSE.\nThis document does not represent any commitment to release or implement\nany portion of the Specification in any product.\n\nThe Specification could include technical inaccuracies or typographical\nerrors. Changes are periodically added to the information therein; these\nchanges will be incorporated into new versions of the Specification, if\nany. Licensor may make improvements and/or changes to the product(s)\nand/or the program(s) described in the Specification at any time. Any\nuse of such changes in the Specification will be governed by the\nthen-current license for the applicable version of the Specification.\n\n9. Limitation of Liability. TO THE EXTENT NOT PROHIBITED BY LAW, IN NO\nEVENT WILL LICENSOR BE LIABLE FOR ANY DAMAGES, INCLUDING WITHOUT\nLIMITATION, LOST REVENUE, PROFITS OR DATA, OR FOR SPECIAL, INDIRECT,\nCONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND\nREGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF OR RELATED TO ANY\nFURNISHING, PRACTICING, MODIFYING OR ANY USE OF THE SPECIFICATION, EVEN\nIF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n10. Report. If you provide Licensor with any comments or suggestions in\nconnection with your use of the Specification (\"Feedback\"), you hereby:\n(i) agree that such Feedback is provided on a non-proprietary and\nnon-confidential basis, and (ii) grant Licensor a perpetual,\nnon-exclusive, worldwide, fully paid-up, irrevocable license, with the\nright to sublicense through multiple levels of sublicensees, to\nincorporate, disclose, and use without limitation the Feedback for any\npurpose related to the Specification and future versions,\nimplementations, and test suites thereof.\n\n[Addendum to the Day Specification License]\n\nIn addition to the permissions granted under the Specification\nLicense, Day Management AG hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable\nlicense to reproduce, publicly display, publicly perform,\nsublicense, and distribute unmodified copies of the Content\nRepository for Java Technology API (JCR 1.0) Java Archive (JAR)\nfile (\"jcr-1.0.jar\") and to make, have made, use, offer to sell,\nsell, import, and otherwise transfer said file on its own or\nas part of a larger work that makes use of the JCR API.\n\nWith respect to any patent claims covered by this license\nthat would be infringed by all technically feasible implementations\nof the Specification, such license is conditioned upon your\noffering on fair, reasonable and non-discriminatory terms,\nto any party seeking it from You, a perpetual, non-exclusive,\nnon-transferable, worldwide license under Your patent rights\nthat are or would be infringed by all technically feasible\nimplementations of the Specification to develop, distribute\nand use a Compliant Implementation."
}