{
  "key": "dbmx-foss-exception-1.0.9",
  "short_name": "Kyoto Products FOSS License Exception v1.0.9",
  "name": "Kyoto Products FOSS License Exception v1.0.9",
  "category": "Copyleft Limited",
  "owner": "Mikio Hirabayashi",
  "homepage_url": "https://metadata.ftp-master.debian.org/changelogs//main/k/kyotocabinet/kyotocabinet_1.2.79-2_copyright",
  "is_exception": true,
  "spdx_license_key": "LicenseRef-scancode-dbmx-foss-exception-1.0.9",
  "text": "License: FOSS-Exception\n                Kyoto Products FOSS License Exception\n                      Version 1.0, 9 March 2011\n .\n This Free and Open Source Software (\"FOSS\") License Exception allows\n developers of FOSS applications to include Kyoto Products with their FOSS\n applications. Kyoto Products are licensed pursuant to version 3 (or later)\n of the GNU General Public License (\"GPL\"), but this exception permits\n distribution of Kyoto Products with a developer's FOSS applications licensed\n under the terms of another FOSS license listed below, even though such other\n FOSS license may be incompatible with the GPL.\n .\n The following terms and conditions describe the circumstances under which\n this FOSS License Exception applies.\n .\n              FOSS License Exception Terms and Conditions\n .\n 1. Definitions\n .\n    \"Derivative Work\" means a derivative work, as defined under applicable\n    copyright law, formed entirely from the Program and one or more FOSS\n    Applications.\n .\n    \"FOSS Application\" means a free and open source software application\n    distributed subject to a license listed in the section below titled\n    \"FOSS License List.\"\n .\n    \"FOSS Notice\" means a notice placed by FAL Labs in a copy of the Kyoto\n    Products Libraries stating that such copy of the Kyoto Products\n    Libraries may be distributed under FAL Lab's or Kyoto Products' FOSS\n    License Exception.\n .\n    \"Independent Work\" means portions of the Derivative Work that are not\n    derived from the Program and can reasonably be considered independent\n    and separate works.\n .\n    \"Program\" means a copy of FAL Labs' Kyoto Products Libraries that\n    contains a FOSS Notice.\n .\n 2. A FOSS application developer (\"you\" or \"your\") may distribute a Derivative\n   Work provided that you and the Derivative Work meet all of the following\n   conditions:\n .\n   a. You obey the GPL in all respects for the Program and all portions\n      (including modifications) of the Program included in the Derivative\n      Work (provided that this condition does not apply to Independent Works);\n .\n   b. You distribute Independent Works subject to a license listed in the\n      section below titled \"FOSS License List\";\n .\n   c. You distribute Independent Works in object code or executable form\n      with the complete corresponding machine-readable source code on the\n      same medium and under the same FOSS license applying to the object\n      code or executable forms;\n .\n   d. All works that are aggregated with the Program or the Derivative Work\n      on a medium or volume of storage are not derivative works of the\n      Program, Derivative Work or FOSS Application, and must reasonably be\n      considered independent and separate works.\n .\n 3. FAL Labs reserves all rights not expressly granted in these terms and\n   onditions. If all of the above conditions are not met, then this FOSS\n   License Exception does not apply to you or your Derivative Work.\n .\n                             FOSS License List\n .\n   License Name Versions/Copyright Date\n .\n   Apache Software License 1.0 / 1.1 / 2.0\n   Artistic license From Perl 5.8.0\n   BSD License \"July 22 1999\"\n   GNU General Public License (GPL) 2\n   GNU Lesser General Public License (LGPL) 2.1 / 3.0\n   Mozilla Public License (MPL) 1.0 / 1.1\n   OpenSSL license (with original SSLeay license) \"2003\" (\"1998\")\n   PHP License 3.0/3.01\n   Python Software Foundation License 2.1.1\n   X11 License \"2001\"\n   Zlib/libpng License"
}