{
  "key": "dmtf-2017",
  "short_name": "DMTF License 2017",
  "name": "DMTF License 2017",
  "category": "Permissive",
  "owner": "DMTF",
  "homepage_url": "https://raw.githubusercontent.com/DMTF/libredfish/master/LICENSE.md",
  "spdx_license_key": "LicenseRef-scancode-dmtf-2017",
  "faq_url": "http://www.dmtf.org/about/policies/disclosures",
  "other_urls": [
    "http://dmtf.org/sites/default/files/patent-10-18-01.pdf"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2017, Contributing"
  ],
  "ignorable_holders": [
    "Contributing"
  ],
  "ignorable_urls": [
    "http://dmtf.org/sites/default/files/patent-10-18-01.pdf",
    "http://www.dmtf.org/about/policies/disclosures"
  ],
  "text": "The Distributed Management Task Force (DMTF) grants rights under copyright in\nthis software on the terms of the BSD 3-Clause License as set forth below; no\nother rights are granted by DMTF. This software might be subject to other rights\n(such as patent rights) of other parties.\n\n\n### Copyrights.\n\nCopyright (c) 2017, Contributing Member(s) of Distributed Management Task Force,\nInc.. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n* Redistributions in binary form must reproduce the above copyright notice, this\nlist of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n* Neither the name of the Distributed Management Task Force (DMTF) nor the names\nof its contributors may be used to endorse or promote products derived from this\nsoftware without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n### Patents.\n\nThis software may be subject to third party patent rights, including provisional\npatent rights (\"patent rights\"). DMTF makes no representations to users of the\nstandard as to the existence of such rights, and is not responsible to\nrecognize, disclose, or identify any or all such third party patent right,\nowners or claimants, nor for any incomplete or inaccurate identification or\ndisclosure of such rights, owners or claimants. DMTF shall have no liability to\nany party, in any manner or circumstance, under any legal theory whatsoever, for\nfailure to recognize, disclose, or identify any such third party patent rights,\nor for such party's reliance on the software or incorporation thereof in its\nproduct, protocols or testing procedures. DMTF shall have no liability to any\nparty using such software, whether such use is foreseeable or not, nor to any\npatent owner or claimant, and shall have no liability or responsibility for\ncosts or losses incurred if software is withdrawn or modified after publication,\nand shall be indemnified and held harmless by any party using the software from\nany and all claims of infringement by a patent owner for such use.\n\nDMTF Members that contributed to this software source code might have made\npatent licensing commitments in connection with their participation in the DMTF.\nFor details, see http://dmtf.org/sites/default/files/patent-10-18-01.pdf and\nhttp://www.dmtf.org/about/policies/disclosures."
}