{
  "key": "do-no-harm-0.1",
  "short_name": "Do No Harm",
  "name": "Do No Harm",
  "category": "Proprietary Free",
  "owner": "Raisely",
  "homepage_url": "https://github.com/raisely/NoHarm",
  "spdx_license_key": "LicenseRef-scancode-do-no-harm-0.1",
  "ignorable_urls": [
    "https://github.com/raisely/NoHarm"
  ],
  "text": "Do No Harm License\n\nVersion 0.1, August 2018\n\nhttps://github.com/raisely/NoHarm\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n1. Preamble\n\nMost software today is developed with little to no thought of how it will be used, or the\nconsequences for our society and planet.\n\nAs software developers, we engineer the infrastructure of the 21st century. We recognise that our\ninfrastructure has great power to shape the world and the lives of those we share it with, and we\nchoose to consciously take responsibility for the social and environmental impacts of what we build.\n\nWe envisage a world free from injustice, inequality, and the reckless destruction of lives and our\nplanet. We reject slavery in all its forms, whether by force, indebtedness, or by algorithms that\nhack human vulnerabilities. We seek a world where humankind is at peace with our neighbours, nature,\nand ourselves. We want our work to enrich the physical, mental and spiritual wellbeing of all\nsociety.\n\nWe build software to further this vision of a just world, or at the very least, to not put that\nvision further from reach.\n\n2. Definitions\n\n\"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by\nSections 1 through 9 of this document.\n\n\"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is\ngranting the License.\n\n\"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are\ncontrolled by, or are under common control with that entity. For the purposes of this definition,\n\"control\" means (i) the power, direct or indirect, to cause the direction or management of such\nentity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the\noutstanding shares, or (iii) beneficial ownership of such entity.\n\n\"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this\nLicense.\n\n\"Source\" form shall mean the preferred form for making modifications, including but not limited to\nsoftware source code, documentation source, and configuration files.\n\n\"Object\" form shall mean any form resulting from mechanical transformation or translation of a\nSource form, including but not limited to compiled object code, generated documentation, and\nconversions to other media types.\n\n\"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the\nLicense, as indicated by a copyright notice that is included in or attached to the work (an example\nis provided in the Appendix below).\n\n\"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or\nderived from) the Work and for which the editorial revisions, annotations, elaborations, or other\nmodifications represent, as a whole, an original work of authorship. For the purposes of this\nLicense, Derivative Works shall not include works that remain separable from, or merely link (or\nbind by name) to the interfaces of, the Work and Derivative Works thereof.\n\n\"Contribution\" shall mean any work of authorship, including the original version of the Work and any\nmodifications or additions to that Work or Derivative Works thereof, that is intentionally submitted\nto Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity\nauthorized to submit on behalf of the copyright owner. For the purposes of this definition,\n\"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or\nits representatives, including but not limited to communication on electronic mailing lists, source\ncode control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor\nfor the purpose of discussing and improving the Work, but excluding communication that is\nconspicuously marked or otherwise designated in writing by the copyright owner as \"Not a\nContribution.\"\n\n\"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a\nContribution has been received by Licensor and subsequently incorporated within the Work.\n\n\"Forests\" shall mean 0.5 or more hectares of trees that were either planted more than 50 years ago\nor were not planted by humans or human made equipment.\n\n\"Deforestation\" shall mean the clearing, burning or destruction of 0.5 or more hectares of forests\nwithin a 1 year period.\n\n3. Grant of Copyright License\n\nSubject to the terms and conditions of this License, each Contributor hereby grants to You a\nperpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to\nreproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and\ndistribute the Work and such Derivative Works in Source or Object form.\n\n4. Grant of Patent License\n\nSubject to the terms and conditions of this License, each Contributor hereby grants to You a\nperpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this\nsection) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer\nthe Work, where such license applies only to those patent claims licensable by such Contributor that\nare necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s)\nwith the Work to which such Contribution(s) was submitted. If You institute patent litigation\nagainst any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or\na Contribution incorporated within the Work constitutes direct or contributory patent infringement,\nthen any patent licenses granted to You under this License for that Work shall terminate as of the\ndate such litigation is filed.\n\n5. Redistribution\n\nYou may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with\nor without modifications, and in Source or Object form, provided that You meet the following\nconditions:\n\n1. You must give any other recipients of the Work or Derivative Works a copy of this License; and\n\n2. You must cause any modified files to carry prominent notices stating that You changed the\n   files; and\n\n3. You must retain, in the Source form of any Derivative Works that You distribute, all copyright,\n   patent, trademark, and attribution notices from the Source form of the Work, excluding those\n   notices that do not pertain to any part of the Derivative Works; and\n\n4. Neither the name of the copyright holder nor the names of its contributors may be used to endorse\n   or promote products derived from this software without specific prior written permission; and\n\n5. This software must not be used by any organisation, website, product, or service that:\n   1. lobbies for, promotes, or derives a majority of income from actions that support or contribute\n      to:\n      * sex trafficking\n      * human trafficking\n      * slavery\n      * indentured servitude\n      * gambling\n      * tobacco\n      * adversely addictive behaviours\n      * nuclear energy\n      * warfare\n      * weapons manufacturing\n      * war crimes\n      * violence (except when required to protect public safety)\n      * burning of forests\n      * deforestation\n      * hate speech or discrimination based on age, gender, gender identity, race, sexuality, religion, nationality\n\n   2. lobbies against, or derives a majority of income from actions that discourage or frustrate:\n      * peace\n      * access to the rights set out in the Universal Declaration of Human Rights and the Convention on the Rights of the Child\n      * peaceful assembly and association (including worker associations)\n      * a safe environment or action to curtail the use of fossil fuels or prevent climate change\n      * democratic processes\n\n   ; and\n5. If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative\n   Works that You distribute must include a readable copy of the attribution notices contained\n   within such NOTICE file, excluding those notices that do not pertain to any part of the\n   Derivative Works, in at least one of the following places: within a NOTICE text file\n   distributed as part of the Derivative Works; within the Source form or documentation, if\n   provided along with the Derivative Works; or, within a display generated by the Derivative\n   Works, if and wherever such third-party notices normally appear. The contents of the NOTICE\n   file are for informational purposes only and do not modify the License. You may add Your own\n   attribution notices within Derivative Works that You distribute, alongside or as an addendum to\n   the NOTICE text from the Work, provided that such additional attribution notices cannot be\n   construed as modifying the License.\n\nYou may add Your own copyright statement to Your modifications and may provide additional or\ndifferent license terms and conditions for use, reproduction, or distribution of Your modifications,\nor for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of\nthe Work otherwise complies with the conditions stated in this License.\n\n6. Submission of Contributions\n\nUnless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the\nWork by You to the Licensor shall be under the terms and conditions of this License, without any\nadditional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify\nthe terms of any separate license agreement you may have executed with Licensor regarding such\nContributions.\n\n7. Trademarks\n\nThis License does not grant permission to use the trade names, trademarks, service marks, or product\nnames of the Licensor, except as required for reasonable and customary use in describing the origin\nof the Work and reproducing the content of the NOTICE file.\n\n8. Disclaimer of Warranty\n\nUnless required by applicable law or agreed to in writing, Licensor provides the Work (and each\nContributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY\nKIND, either express or implied, including, without limitation, any warranties or conditions of\nTITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely\nresponsible for determining the appropriateness of using or redistributing the Work and assume any\nrisks associated with Your exercise of permissions under this License.\n\n9. Limitation of Liability\n\nIn no event and under no legal theory, whether in tort (including negligence), contract, or\notherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or\nagreed to in writing, shall any Contributor be liable to You for damages, including any direct,\nindirect, special, incidental, or consequential damages of any character arising as a result of this\nLicense or out of the use or inability to use the Work (including but not limited to damages for\nloss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial\ndamages or losses), even if such Contributor has been advised of the possibility of such damages.\n\n10. Accepting Warranty or Additional Liability\n\nWhile redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee\nfor, acceptance of support, warranty, indemnity, or other liability obligations and/or rights\nconsistent with this License. However, in accepting such obligations, You may act only on Your own\nbehalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You\nagree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or\nclaims asserted against, such Contributor by reason of your accepting any such warranty or\nadditional liability.\n\nEND OF TERMS AND CONDITIONS\n\nCopyright (year) [owner](url).\n\nLicensed under the Do No Harm License, Version 0.1 (the \"License\"); you may not use this file except\nin compliance with the License. You may obtain a copy of the License.\n\nUnless required by applicable law or agreed to in writing, software distributed under the License is\ndistributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\nimplied. See the License for the specific language governing permissions and limitations under the\nLicense."
}