{
  "key": "dropbear",
  "short_name": "Dropbear License",
  "name": "Dropbear License",
  "category": "Permissive",
  "owner": "Dropbear",
  "homepage_url": "https://matt.ucc.asn.au/dropbear/dropbear.html",
  "notes": "composite",
  "spdx_license_key": "LicenseRef-scancode-dropbear",
  "minimum_coverage": 80,
  "ignorable_copyrights": [
    "(c) 2004 Mihnea Stoenescu",
    "(c) Todd C. Miller",
    "Copyright (c) 1995 Tatu Ylonen <ylo@cs.hut.fi> , Timo Rinne <tri@iki.fi> ,Espoo, Finland",
    "Copyright (c) 1995,1999 Theo de Raadt",
    "Copyright (c) 1998 Todd C. Miller",
    "Copyright (c) 2000 Andre Lucas",
    "Copyright (c) 2002-2008 Matt Johnston",
    "Portions Copyright (c) 1996 Theo de Raadt",
    "Portions copyright (c) 1996 Jason Downs",
    "Portions copyright (c) 1998 Todd C. Miller",
    "Portions copyright (c) 2004 Mihnea Stoenescu",
    "Portions copyright Robert de Bath, Joris van Rantwijk, Delian Delchev, Andreas Schultz, Jeroen Massar, Wez Furlong, Nicolas Barry, Justin Bradford, and CORE SDI S.A.",
    "copyright 1997-2003 Simon Tatham"
  ],
  "ignorable_holders": [
    "Andre Lucas",
    "Jason Downs",
    "Matt Johnston",
    "Mihnea Stoenescu",
    "Robert de Bath, Joris van Rantwijk, Delian Delchev, Andreas Schultz, Jeroen Massar, Wez Furlong, Nicolas Barry, Justin Bradford, and CORE SDI S.A.",
    "Simon Tatham",
    "Tatu Ylonen , Timo Rinne ,Espoo, Finland",
    "Theo de Raadt",
    "Todd C. Miller"
  ],
  "ignorable_authors": [
    "Andre Lucas",
    "Matt Johnston",
    "Theo de Raadt",
    "Tom St Denis"
  ],
  "ignorable_emails": [
    "tri@iki.fi",
    "ylo@cs.hut.fi"
  ],
  "text": "The majority of code is written by Matt Johnston, under the license below.\n\nPortions of the client-mode work are (c) 2004 Mihnea Stoenescu, under the\nsame license:\n\nCopyright (c) 2002-2008 Matt Johnston\nPortions copyright (c) 2004 Mihnea Stoenescu\nAll rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n=====\n\nLibTomCrypt and LibTomMath are written by Tom St Denis, and are Public Domain.\n\n=====\n\nsshpty.c is taken from OpenSSH 3.5p1, \n  Copyright (c) 1995 Tatu Ylonen <ylo@cs.hut.fi>, Timo Rinne <tri@iki.fi>,Espoo, Finland\n\n                     All rights reserved\n \"As far as I am concerned, the code I have written for this software\n  can be used freely for any purpose.  Any derived versions of this\n  software must be clearly marked as such, and if the derived work is\n  incompatible with the protocol description in the RFC file, it must be\n  called by a name other than \"ssh\" or \"Secure Shell\". \"\n\n=====\n\nloginrec.c is written primarily by Andre Lucas, Jason Downs, Theo de Raadt: \nCopyright (c) 2000 Andre Lucas.  \nPortions copyright (c) 1998 Todd C. Miller\nPortions copyright (c) 1996 Jason Downs\nPortions Copyright (c) 1996 Theo de Raadt.\n\nloginrec.h is written by Andre Lucas:\nCopyright (c) 2000 Andre Lucas.\n\natomicio.h,atomicio.c written by Theo de Raadt (1995-1999) \nCopyright (c) 1995,1999 Theo de Raadt.  \n\nAnd are licensed under the following terms:\n\nCopyright (c) <YEAR>, <OWNER>\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nand strlcat() is (c) Todd C. Miller (included in util.c -- ) are from OpenSSH 3.6.1p2, and are licensed\nunder the BSD-Modified license: \n\n\nCopyright (c)  1998 Todd C. Miller  , < OWNER >\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: \n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. \nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. \nNeither the name of the < ORGANIZATION > nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. \n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n=====\n\nImport code in keyimport.c is modified from PuTTY's import.c, licensed as\nfollows:\n\nPuTTY is copyright 1997-2003 Simon Tatham.\n\nPortions copyright Robert de Bath, Joris van Rantwijk, Delian\nDelchev, Andreas Schultz, Jeroen Massar, Wez Furlong, Nicolas Barry,\nJustin Bradford, and CORE SDI S.A.\n\nPermission is hereby granted, free of charge, to any person\nobtaining a copy of this software and associated documentation files\n(the \"Software\"), to deal in the Software without restriction,\nincluding without limitation the rights to use, copy, modify, merge,\npublish, distribute, sublicense, and/or sell copies of the Software,\nand to permit persons to whom the Software is furnished to do so,\nsubject to the following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT.  IN NO EVENT SHALL THE COPYRIGHT HOLDERS BE LIABLE\nFOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF\nCONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
}