{
  "key": "dsdp",
  "short_name": "DSDP License",
  "name": "DSDP License",
  "category": "Permissive",
  "owner": "University of Chicago",
  "homepage_url": "https://fedoraproject.org/wiki/Licensing/DSDP",
  "spdx_license_key": "DSDP",
  "text_urls": [
    "http://www.mcs.anl.gov/hs/software/DSDP/Copyright.txt"
  ],
  "ignorable_copyrights": [
    "(c) COPYRIGHT 2004 UNIVERSITY OF CHICAGO"
  ],
  "ignorable_holders": [
    "UNIVERSITY OF CHICAGO"
  ],
  "ignorable_emails": [
    "benson@mcs.anl.gov",
    "yinyu-ye@stanford.edu"
  ],
  "text": "COPYRIGHT NOTIFICATION\n\n(C) COPYRIGHT 2004 UNIVERSITY OF CHICAGO\n\nThis program discloses material protectable under copyright laws of the United\nStates. Permission to copy and modify this software and its documentation is\nhereby granted, provided that this notice is retained thereon and on all copies\nor modifications. The University of Chicago makes no representations as to the\nsuitability and operability of this software for any purpose. It is provided \"as\nis\"; without express or implied warranty. Permission is hereby granted to use,\nreproduce, prepare derivative works, and to redistribute to others, so long as\nthis original copyright notice is retained. Any publication resulting from\nresearch that made use of this software should cite this document.\n\n     This software was authored by:\n\n     Steven J. Benson Mathematics and Computer Science Division Argonne National\n     Laboratory Argonne IL 60439\n\n     Yinyu Ye Department of Management Science and Engineering Stanford\n     University Stanford, CA U.S.A\n\n     Any questions or comments on the software may be directed to\n     benson@mcs.anl.gov or yinyu-ye@stanford.edu\n\nArgonne National Laboratory with facilities in the states of Illinois and Idaho,\nis owned by The United States Government, and operated by the University of\nChicago under provision of a contract with the Department of Energy.\n\nDISCLAIMER \n\nTHIS PROGRAM WAS PREPARED AS AN ACCOUNT OF WORK SPONSORED BY AN AGENCY OF THE\nUNITED STATES GOVERNMENT. NEITHER THE UNITED STATES GOVERNMENT NOR ANY AGENCY\nTHEREOF, NOR THE UNIVERSITY OF CHICAGO, NOR ANY OF THEIR EMPLOYEES OR OFFICERS,\nMAKES ANY WARRANTY, EXPRESS OR IMPLIED, OR ASSUMES ANY LEGAL LIABILITY OR\nRESPONSIBILITY FOR THE ACCURACY, COMPLETENESS, OR USEFULNESS OF ANY INFORMATION,\nAPPARATUS, PRODUCT, OR PROCESS DISCLOSED, OR REPRESENTS THAT ITS USE WOULD NOT\nINFRINGE PRIVATELY OWNED RIGHTS. REFERENCE HEREIN TO ANY SPECIFIC COMMERCIAL\nPRODUCT, PROCESS, OR SERVICE BY TRADE NAME, TRADEMARK, MANUFACTURER, OR\nOTHERWISE, DOES NOT NECESSARILY CONSTITUTE OR IMPLY ITS ENDORSEMENT,\nRECOMMENDATION, OR FAVORING BY THE UNITED STATES GOVERNMENT OR ANY AGENCY\nTHEREOF. THE VIEW AND OPINIONS OF AUTHORS EXPRESSED HEREIN DO NOT NECESSARILY\nSTATE OR REFLECT THOSE OF THE UNITED STATES GOVERNMENT OR ANY AGENCY THEREOF."
}