{
    "key": "duende-sla-2022",
    "short_name": "Duende SLA 2022",
    "name": "Duende SLA 2022",
    "category": "Proprietary Free",
    "owner": "Duende Software",
    "homepage_url": "https://duendesoftware.com/license/SoftwareLicense.pdf",
    "spdx_license_key": "LicenseRef-scancode-duende-sla-2022",
    "faq_url": "https://www.nuget.org/packages/Duende.IdentityServer/6.0.4/License",
    "other_urls": [
        "https://github.com/aboutcode-org/scancode-toolit/issues/2954",
        "https://www.nuget.org/packages/Duende.IdentityServer/6.0.4"
    ],
    "ignorable_urls": ["https://duendesoftware.com/products/support"],
    "text": "Duende Software, Inc. – Rev. 01/2022\nDUENDE™ SOFTWARE LICENSE AGREEMENT\n\nThis Software License Agreement (“Agreement”) is a legal agreement between you (either\nas an individual or a single entity (“You”)) and Duende Software, Inc. (“Licensor”) for certain\nsoftware application libraries as set forth on the quote or invoice (“Applications”) provided to\nYou by Licensor (“Quote”), associated “online”, electronic or hard copy user documentation,\nand any upgrades, modified versions, bug fixes, additions and improvements thereof that\nLicensor may make available during the Term of the Agreement (collectively referred to as\nthe “Software”).\n\nReferences to “You” herein shall refer to You, and/or the entity on whose behalf You are using\nthe Software, and all individual developer-users of the Software on behalf of such entity.\n\nPlease note: this Agreement is not intended for affiliate use outside the scope of this\nAgreement. If you intend to purchase the software for use by Your Affiliates please contact\nlicensor for the appropriate fees and license before proceeding. “Affiliate” means any parent\nor subsidiary entity that controls or is controlled by You. \"Control\" means the direct or indirect\nownership of more than fifty percent (50%) of the voting securities of an entity or possession\nof the right to vote more than fifty percent (50%) of the voting interest in the ordinary direction\nof the entity's affairs. An Affiliate shall only be considered such for so long as such control\nexists.\n\nIf the Software is acquired by or on behalf of a unit or agency of the U.S. Government\n(the “Government”), the Government agrees that the Software is “commercial\ncomputer software” or “commercial computer software documentation” and that,\nabsent a written agreement to the contrary, the Government’s rights with respect to\nthe Software is limited by the terms of this Agreement, pursuant to applicable FAR\nand/or DFARS and successor regulations.\n\nBY DOWNLOADING, INSTALLING, OR OTHERWISE ACCESSING OR USING THE\nSOFTWARE, YOU AGREE THAT YOU HAVE READ, UNDERSTOOD, AND AGREE\nTO BE BOUND BY THIS AGREEMENT. IF YOU DO NOT AGREE, YOU MAY NOT\nUSE THE SOFTWARE OR ACCESS THE SOURCE CODE.\n\nAccordingly, You and Licensor acknowledge and agree as follows:\n\n1. LIMITED LICENSE\n\nA. Subject to your complete and ongoing compliance with all the terms and\nconditions set forth in this Agreement, including without limitation, payment of\nany applicable fees and all license limitations and restrictions set forth herein,\nLicensor grants You the following limited, non-exclusive, non-transferable, nonsublicensable, revocable license to use, and (where applicable) authorize your\nemployees and other personnel to use, the unmodified Software in binary form,\ninternally solely in connection with the specific Software Application(s) and\nusage as set forth on the Quote and/or purchase terms selected and paid for in\nconjunction with downloading the Software.\n\nB. The License granted in Paragraph A above does not include the right to\nsublicense, however, you may redistribute the Software upon payment of\nadditional license fees under a separate redistribution license agreement for the\nSoftware.\n\n2. RESTRICTIONS\n\nA. You acknowledge that the license granted in Paragraph 1A does not include any\nright to: (i) redistribute, sell, lease, license, or modify any portion of the\nSoftware; (ii) reproduce, distribute, publicly display, or publicly perform any part\nof the Software; (iii) modify the source code of any portion of the Software (other\nthan modifications made in a non-production environment); or (iv) remove,\nobscure, interfere with or circumvent any feature of the Software, including\nwithout limitation any copyright or other intellectual property notices, security,\nor access control mechanism.\n\nB. You may not use the Software for any purpose other than deploying it on one or\nmore servers in a manner for which the Software is expressly designed.\n\nC. The Software may only be hosted on the machines, servers, and internetworking\ndevices within Your computer network or systems.\n\nD. You may not sell, license, distribute, copy, modify, publicly perform or display,\ntransmit, publish, edit, adapt, create derivative works from, or make any use of\nthe Software except as expressly authorized in this Agreement.\n\nE. If You are prohibited under applicable law from using the Software, You may not\nuse it, and You will comply with all applicable laws and regulations (including\nwithout limitation laws and regulations related to export controls) in connection\nwith your use of the Software.\n\n3. LICENSE FEES\n\nA. If you wish to use the Software in a production environment, you may download\nand use the Software for the Term upon payment of the appropriate license fee\nas indicated on the Quote in accordance with the terms and conditions of this\nAgreement.\n\nB. If you wish to use the Software in a non-production environment, you may\ndownload and access the source and/or binaries at no charge solely for testing\nand evaluation purposes and in accordance with all license limitations and\nrestrictions set forth in this Agreement.\n\n4. SUPPORT\n\nA. Licensor will only provide support in accordance with the support guidelines\nposted at https://duendesoftware.com/products/support. Licensor will use\nDuende Software, Inc. – Rev. 01/2022 Page 3 of 5\ncommercially reasonable efforts to resolve all reasonable support requests, but\nmakes no guarantee that all requests can be finally resolved.\n\nB. Licensor shall not provide support for: instances of the Software deployed on\nunsupported platforms as specified in the documentation accompanying the\nSoftware; support requests not resulting from the ordinary use of the Software; or\nsupport requests resulting from the use of third-party products.\n\nC. Licensor will not provide You with any individual or customized support services\nunder this Agreement.\n\nD. A support contract may be purchased separately from Licensor for individual or\ncustomized support services with varying higher service levels than those\nprovided herein.\n\n5. EXPORT CONTROLS. You represent and warrant that the Software will not be\nshipped, transferred or exported into any country or used in any manner prohibited by\nthe United States Export Administration Act or any other export laws, restrictions or\nregulations (collectively, “Export Laws”). In addition, if the Software is identified as\nexport controlled items under the Export Laws, You represent and warrant that You\nare not a citizen, or otherwise located within, an embargoed nation (including without\nlimitation Cuba, Iran, North Korea, Sudan, or Syria) and that You are not otherwise\nprohibited under the Export Laws from receiving the Software. Any use in violation of\nthe foregoing limitations and restrictions is strictly prohibited, and unlicensed.\n\n6. RESERVATION OF RIGHTS. The Software is owned by Licensor and licensed, not\nsold, to You. The Software is protected by copyright laws and international copyright\ntreaties, as well as other intellectual property laws and treaties. Except for the limited\nrights of use granted herein, all right, title and interest to the Software, including patent,\ncopyright, and trademark rights in and to the Software, the accompanying printed\nmaterials, and any copies of the Software are owned by Licensor.\n\n7. CONFIDENTIALITY. The Software is the confidential and proprietary information of\nLicensor, and You may not, during the term or thereafter, disclose it to any third party,\nor to use it for any purpose other than as expressly provided herein, without a separate\nwritten agreement with Licensor authorizing You to do so.\n\n8. FEEDBACK. If You provide Licensor with any comments, bug reports, feedback,\nenhancements, or modifications proposed or suggested by You for the Software\n(“Feedback”), such Feedback is provided on a non-confidential basis (notwithstanding\nany notice to the contrary You may include in any accompanying communication), and\nLicensor shall have the right to use such Feedback at its discretion, including, but not\nlimited to the incorporation of such suggested changes into future releases of the\nSoftware. You hereby grant Licensor a perpetual, irrevocable, transferable,\nsublicensable, nonexclusive license under all rights necessary to incorporate and use\nyour Feedback for any purpose, including to make and sell any products and services.\nDuende Software, Inc. – Rev. 01/2022 Page 4 of 5\n\n9. TERM AND TERMINATION. This Agreement will remain in effect for the time\nframe specified in your Quote issued to you by Licensor and commences on the\ndate You: (i) paid the applicable license fee for the Software; or (ii) downloaded\nthe Software as a non-production user. However, Licensor may terminate this\nAgreement upon 30 days’ prior written notice allowing You the opportunity to cure, for\nany actual or suspected misuse or abuse by You of the Software or any material\nviolation of this Agreement. You may also choose to terminate this Agreement for any\nreason by ceasing all use of the Software. Following any termination of this Agreement,\nYou will not be provided any refund, in whole or in part, and You must immediately\ncease use of the Software, remove or destroy any instances of the Software and/or\ncopies thereof, and be able to show evidence of such cessation to Licensor upon\nrequest. The terms of this Agreement that expressly are to, or by implication ought to,\nsurvive, will survive this Agreement. Notwithstanding the foregoing, should Licensor\ncompletely cease to do business (excluding transactions in connection with a sale of\nall or substantially all of Licensor’s assets or stock, or in connection with a merger or\nother corporate reorganization), the term of this Agreement shall be perpetual as to\nYour custom application previously deployed by You prior to the date of such cessation\nof business and without the need for any further payments in accordance with all\nlimitations and restrictions in this Agreement.\n\n10. WARRANTY DISCLAIMER AND LIMITATION OF LIABILITY.\nThe Software and any support are provided on an “as is” basis, without warranty\nof any kind. To the maximum extent permitted by applicable law, Licensor\ndisclaims all warranties and conditions, express, implied, statutory or otherwise,\nincluding but not limited to implied warranties or conditions of fitness for a\nparticular purpose, merchantability, title, quality, results, and non-infringement.\nUnder no circumstances will Licensor be liable for any consequential, special,\nindirect, incidental or punitive damages whatsoever arising out of the use or\ninability to use the Software, even if Licensor has been advised of the possibility\nof such damages, and notwithstanding any failure of essential purpose of any\nlimited remedy. In no event will Licensor’s aggregate liability for damages arising\nout of this Agreement or the terms exceed the amount paid by you for the\nSoftware. Some jurisdictions do not allow limitations on implied warranties or\nthe exclusion or limitation of liability for consequential or incidental damages,\nso the above limitations may not apply to You. In such an event, the above\nlimitations and exclusions will be enforced to the maximum extent permitted\nunder applicable law.\n\n11. INDEMNITY. You agree to indemnify Licensor and its affiliates, officers, directors,\nsuppliers, licensors, and other customers from and against any and all liability and\ncosts (including reasonable attorneys’ fees) incurred by such parties in connection with\nor arising out of your use or misuse of the Software.\nDuende Software, Inc. – Rev. 01/2022 Page 5 of 5\n\n12. GOVERNING LAW; VENUE. This Agreement shall be governed by and interpreted\nin accordance with the laws of the State of New York, USA, excluding its law on conflict\nof laws. You hereby consent to submit to personal jurisdiction and venue exclusively\nin the federal and state courts of the State of New York, USA.\n\n13. GENERAL PROVISIONS.\n\nA. You will be responsible for the payment of all taxes, duties, levies, and other charges\nincluding, but not limited to sales, use, gross receipts, excise, VAT, ad valorem and\nany other taxes, any withholdings or deductions, import and custom taxes, any duties,\nor any other charges imposed by any taxing authority (excluding any taxes based on\nthe Licensor’s income) with respect to the fees payable to Licensor in connection with\nthis Agreement.\n\nB. This Agreement contains the entire agreement between You and Licensor,\nsupersedes any other agreement or discussions, oral and written, concerning\nthe subject matter hereof, and may not be modified or amended except by a\nwritten amendment signed by both parties.\n\nC. If any provision of this Agreement is declared invalid, illegal, or unenforceable\nby a court of competent jurisdiction, such provision shall, as to that jurisdiction,\nbe ineffective only to the extent of such invalidity, illegality, or unenforceability,\nand shall not in any manner affect the remaining provisions hereof in such\njurisdiction or render any other provision of this Agreement invalid, illegal, or\nunenforceable in any other jurisdiction.\n\nD. You may provide Licensor with a valid purchase order; provided, however,\npurchase orders are to be used solely for your accounting purposes and any\nterms and conditions contained therein shall be deemed null and void with\nrespect to the parties’ relationship and this License Agreement. Any such\npurchase order provided to Licensor shall in no way relieve you of any obligation\nentered into pursuant to this License Agreement including, but not limited to,\nyour obligation to pay Licensor the appropriate license fees.\n\nE. You agree that in the event of a breach or threatened breach of this Agreement,\nLicensor may suffer irreparable harm and will be entitled to specific\nperformance, and preliminary and/or permanent injunctive relief to enforce this\nAgreement without the need to post bond and that such relief shall be in addition\nto, and not in lieu of, any monetary damages or other relief a court of competent\njurisdiction, whether at law or equity, may award.\n\nF. This Agreement shall supersede any provisions of the Uniform Commercial\nCode as adopted or made applicable to the Software in any competent\njurisdiction. This Agreement shall not be governed by the United Nations\nConvention on Contracts for the International Sale of Goods."
}
