{
  "key": "dynamic-drive-tou",
  "short_name": "Dynamic Drive TOU",
  "name": "Dynamic Drive Terms of Use",
  "category": "Permissive",
  "owner": "DynamicDrive",
  "spdx_license_key": "LicenseRef-scancode-dynamic-drive-tou",
  "ignorable_copyrights": [
    "(c) Dynamic Drive (http://www.dynamicdrive.com)"
  ],
  "ignorable_holders": [
    "Dynamic Drive"
  ],
  "ignorable_urls": [
    "http://www.dynamicdrive.com/"
  ],
  "text": "Dynamic Drive DHTML scripts- Terms of Use\n\nUnless indicated otherwise by the credit, all scripts on this site are original\nscripts written by the authors of Dynamic Drive, and are protected by both US\nand international copyright laws. The below lists the terms of use users of\nDynamic Drive must agree to before using the programs/scripts (Last updated: May\n22nd, 06):\n\n1. Users may use any DHTML scripts offered for download on Dynamic Drive, free\nof charge, on both personal and commercial web sites. This includes web\ndesigners who wish to use our DHTML scripts in their paid web site projects.\n\n2. You may modify our scripts to customize them based on your needs.\n\n3. Users may NOT, however, redistribute or repost/ resell for download any DHTML\nscript found on Dynamic Drive. Redistribution is defined as re-offering our\nscripts for download in any fashion, whether on a competing web site, an\napplication that generates code snippets, or a CD-ROM collection of\nCSS/JavaScript codes etc. Some examples of what is acceptable and what is not\nare:\n\nAcceptable: \n\n-Use our DHTML scripts on any personal or commercial web site to aid in its\nfunctionality/ usability.\n\n-As a web designer, use our DHTML scripts in your paid projects for your client\nweb sites. \n\n-As a software developer, use our DHTML scripts within a application/ program as\npart of its interface, such as a CSS menu being used as the program's navigation\ninterface. The program itself can be distributable. \n\nIn all cases above, the credit notice within the script must remain intact and\nunaltered.\n\nNot Acceptable: \n\n-Put our DHTML scripts on another script library or webmaster type site for\nothers to download. \n\n-Use our DHTML scripts in any type of service or application whereby our codes\nare part of the product offerings themselves. \n\n-Put our DHTML scripts in any other types of medium for direct redistribution,\nsuch as a CD-ROM that consists of, but not limited to, webmaster codes and web\ngraphics.\n\n4. Users agree not to remove/ edit the credit notice within the DHTML source\ncode, or claim the code to be work of their own. What is the copyright notice?\nIt appears inside the <script> tag of each script, and looks something like\nthis:\n\n/*********************************************** \n* Dynamic Countdown script- © Dynamic Drive (http://www.dynamicdrive.com) \n* This notice MUST stay intact for legal use \n* Visit http://www.dynamicdrive.com/ for this script and 100s more.\n***********************************************/\n\nSometimes you may wish to move the DHTML script to an external .js file. In such\ninstances, the credit notice must still be retained within the SCRIPT tags, in\nthe page's visible source:\n\n<script src=\"countdown.js\" type=\"text/javascript\">\n/*********************************************** \n* Dynamic Countdown script- © Dynamic Drive (http://www.dynamicdrive.com) \n* This notice MUST stay intact for legal use \n* Visit http://www.dynamicdrive.com/ for this script and 100s more.\n***********************************************/\n</script>\n\n5. Users agree not to use scripts found on Dynamic Drive for illegal purposes,\nor on pages containing illegal material.\n\n6. Users agree not to hold Dynamic Drive liable for any damages resulted from\nproper or improper use of any of the scripts found on Dynamic Drive. Use at your\nown risk.\n\n7. Users are not required to link back to Dynamic Drive to use our DHTML\nscripts, as much as they are appreciated. :)\n\nBy using any of the scripts on Dynamic Drive, you understand that you have read\nand agreed to the above usage terms. These terms will be strictly enforced, and\nviolators will face criminal charges. Don't say our lawyer didn't warn you!"
}