{
  "key": "edrdg-2000",
  "short_name": "EDRDG General Dictionary License 2000",
  "name": "EDRDG General Dictionary License 2000",
  "category": "Copyleft Limited",
  "owner": "EDRDG",
  "homepage_url": "http://www.edrdg.org/edrdg/licence.html",
  "spdx_license_key": "LicenseRef-scancode-edrdg-2000",
  "text_urls": [
    "https://creativecommons.org/licenses/by-sa/3.0/legalcode"
  ],
  "other_urls": [
    "https://creativecommons.org/licenses/by-sa/3.0/"
  ],
  "ignorable_urls": [
    "http://www.edrdg.org/wiki/index.php/JMdict",
    "http://www.edrdg.org/wiki/index.php/KANJIDIC_Project"
  ],
  "ignorable_emails": [
    "jimbreen@gmail.com"
  ],
  "text": "[EDRDG]\n      ****** ELECTRONIC DICTIONARY RESEARCH AND DEVELOPMENT GROUP ******\n              ****** GENERAL DICTIONARY LICENCE STATEMENT ******\nEDRDG_Home_Page\n1. Introduction\nIn March 2000, James William Breen assigned ownership of the copyright of the\ndictionary files assembled, coordinated and edited by him to the The Electronic\nDictionary Research and Development Group, then at Monash University (hereafter\n\"the Group\"), on the understanding that the Group will foster the development\nof the dictionary files, and will utilize all monies received for use of the\nfiles for the further development of the files, and for research into computer\nlexicography and electronic dictionaries.\nThis document outlines the licence arrangement put in place by The Group for\nusage of the files. It replaces all previous copyright and licence statements\napplying to the files.\n\n2. Application\nThis licence statement and copyright notice applies to the following dictionary\nfiles, the associated documentation files, and any data files which are derived\nfrom them.\n    * JMDICT - Japanese-Multilingual Dictionary File - the Japanese and English\n      components (the translational equivalents in other languages, e.g.\n      German, French, Dutch, etc. are covered by separate copyright held by the\n      compilers of that material.)\n    * EDICT - Japanese-English Electronic DICTionary File\n    * ENAMDICT - Japanese Names File\n    * COMPDIC - Japanese-English Computing and Telecommunications Terminology\n      File\n    * KANJIDIC2 - File of Information about the Kanji in JIS X 0208, JIS X 0212\n      and JIS X 0213 in XML format.\n    * KANJIDIC - File of Information about the 6,355 Kanji in the JIS X 0208\n      Standard (special conditions apply)\n    * KANJD212 - File of Information about the 5,801 Supplementary Kanji in the\n      JIS X 0212 Standard\n    * EDICT-R - romanized version of the EDICT file. (NB: this file has been\n      withdrawn from circulation, and all sites carrying it are requested to\n      remove their copies.)\n    * RADKFILE/KRADFILE - files relating to the decomposition of the 6,355\n      kanji in JIS X 0208 into their visible components.\nCopyright over the documents covered by this statement is held by James William\nBREEN and The Electronic Dictionary Research and Development Group.\n\n3. Licence Conditions\n[http://creativecommons.org/images/public/somerights20.gif]\nThe dictionary files are made available under a Creative Commons Attribution-\nShareAlike Licence (V3.0). The Licence Deed can be viewed here, and the full\nLicence Code is here.\nIn summary (extract from the Licence Deed):\n _____________________________________________________________________________\n|You are free:                                                                |\n|    * to Share - to copy, distribute and transmit the work                   |\n|    * to Remix - to adapt the work                                           |\n|Under the following conditions:                                              |\n|    * Attribution. You must attribute the work in the manner specified by the|\n|      author or licensor (but not in any way that suggests that they endorse |\n|      you or your use of the work).                                          |\n|    * Share Alike. If you alter, transform, or build upon this work, you may |\n|      distribute the resulting work only under the same, similar or a        |\n|      compatible_licence.                                                    |\n|_____________________________________________________________________________|\n\nFor attribution of these files, you must:\n   a. in the case of publishing significant extracts of the files, or material\n      based on significant extracts of the files, e.g. in a published\n      dictionary or in vocabulary lists, clearly acknowledge that you used the\n      files for this purpose;\n\n   b. in the case of a software package, WWW server, smartphone app, etc. which\n      uses the files or incorporates data from the files, you must:\n         i. acknowledge the usage and source of the files in the documentation,\n            publicity material, WWW site of the package/server, etc.;\n        ii. provide copies of the documentation and licence files (in the case\n            of software packages). Where the application packaging does not\n            provide for the inclusion of such files (e.g. with iPhone\n            applications), it is sufficient to provide links, as per the next\n            point;\n       iii. provide links to either local copies of the documentation and\n            licence files or to the locations of the files at Monash University\n            or at the EDRDG site.\n            If a WWW server is providing a dictionary function or an on-screen\n            display of words from the files, the acknowledgement must be made\n            on each screen display, e.g. in the form of a message at the foot\n            of the screen or page. If, however, material from the files is\n            mixed with information from other sources, it is sufficient to\n            provide a general acknowledgement of the sources as described\n            above.\n            For smartphone and tablet apps, acknowledgement must be made, e.g.\n            on a separate screen accessed from a menu, such as one labelled\n            \"About\", \"Sources\", etc. It is not sufficient just to mention it on\n            a start-up/launch page of the app.\n            For the EDICT, JMdict and KANJIDIC files, the following URLs may be\n            used or quoted:\n                # http://www.edrdg.org/wiki/index.php/JMdict-\n                  EDICT_Dictionary_Project\n                # http://www.edrdg.org/wiki/index.php/KANJIDIC_Project\nSee this_page for samples of possible acknowledgement text.\nNote that in all cases, the addition of material to the files or to extracts\nfrom the files does not remove or in any way diminish the Group's copyright\nover the files. Users of material from the files must NOT claim copyright over\nthat material.\nNote also that provided the conditions above are met, there is NO restriction\nplaced on commercial use of the files. The files can be bundled with software\nand sold for whatever the developer wants to charge. Software using these files\ndoes not have to be under any form of open-source licence.\nWhere use of the files results in a financial return to the user, it is\nsuggested that the user make a donation to the Group to assist with the\ncontinued development of the files. The only method currently available is to\nmake a donation via PayPal using a credit or debit card. Simply click on the\nfollowing button and follow the instructions.\n         [Submit https://www.paypal.com/en_US/i/btn/x-click-but21.gif]\nNB: No contract or agreement needs to be signed in order to use the files. By\nusing the files, the user implicitly undertakes to abide by the conditions of\nthis licence.\n\n4. Updating Dictionary Versions\nIf a software package, WWW server, smartphone app, etc. uses the files or\nincorporates data from the files, there must be a procedure for regular\nupdating of the data from the most recent versions available. For example, WWW-\nbased dictionary servers should update their dictionary versions at least once\na month. Failure to keep the versions up-to-date is a violation of the licence\nto use the data.\n\n5. Warranty and Liability\nWhile every effort has been made to ensure the accuracy of the information in\nthe files, it is possible that errors may still be included. The files are made\navailable without any warranty whatsoever as to their accuracy or suitability\nfor a particular application.\nAny individual or organization making use of the files must agree:\n   a. to assume all liability for the use or misuse of the files, and must\n      agree not to hold the Group liable for any actions or events resulting\n      from use of the files.\n   b. to refrain from bringing action or suit or claim against the Group or any\n      of the Group's members on the basis of the use of the files, or any\n      information included in the files.\n   c. to indemnify the Group or its members in the case of action by a third\n      party on the basis of the use of the files, or any information included\n      in the files.\n\n6. Copyright\nEvery effort has been made in the compilation of these files to ensure that the\ncopyright of other compilers of dictionaries and lexicographic material has not\nbeen infringed. The Group asserts its intention to rectify immediately any\nbreach of copyright brought to its attention.\nAny individual or organization in possession of copies of the files, upon\nbecoming aware that a possible copyright infringement may be present in the\nfiles, must undertake to contact the Group immediately with details of the\npossible infringement.\n\n7. Prior Permission\nAll permissions for use of the files granted by James William Breen prior to\nMarch 2000 will be honoured and maintained, however the placing of the KANJD212\nand EDICTH files under the GNU GPL has been withdrawn as of 25 March 2000.\n\n8. Special Conditions for the KANJIDIC, KANJD212 and KANJIDIC2 Files\nIn addition to licensing arrangements described above, the following additional\nconditions apply to the KANJIDIC, KANJD212 and KANJIDIC2 files.\nThe following people have granted permission for material for which they hold\ncopyright to be included in the files, and distributed under the above\nconditions, while retaining their copyright over that material:\nJack HALPERN: The SKIP codes.\nNote that the SKIP codes are under their own similar Creative Common licence.\nSee Jack Halpern's conditions_of_use page.\nChristian WITTERN and Koichi YASUOKA: The Pinyin information.\nUrs APP: the Four Corner codes and the Morohashi information.\nMark SPAHN and Wolfgang HADAMITZKY: the kanji descriptors from their\ndictionary.\nCharles MULLER: the Korean readings.\nJoseph DE ROO: the De Roo codes.\n\n9. Enquiries\nAll enquiries to:\nThe Electronic Dictionary Research and Development Group\nAttn: Dr Jim Breen\n(jimbreen@gmail.com)"
}