{
  "key": "elixir-trademark-policy",
  "short_name": "Elixir Trademark Policy",
  "name": "Elixir Team Trademarks Policy",
  "category": "Proprietary Free",
  "owner": "Elixir",
  "homepage_url": "https://github.com/elixir-lang/elixir/blob/main/LICENSES/LicenseRef-elixir-trademark-policy.txt",
  "spdx_license_key": "LicenseRef-scancode-elixir-trademark-policy",
  "other_spdx_license_keys": [
    "LicenseRef-elixir-trademark-policy"
  ],
  "other_urls": [
    "https://elixir-lang.org/images/logo/logo.png"
  ],
  "ignorable_emails": [
    "trademarks@elixir-lang.org"
  ],
  "text": "ELIXIR TEAM TRADEMARKS POLICY\n\nThis document outlines the policy for allowed usage of the “Elixir” word and the\nElixir logo by other parties.\n\n“Elixir” and the Elixir logo are registered trademarks of the Elixir Team. The\nElixir Team believes in a decentralized approach to growing the community and\nthe ecosystem, independent of the Elixir project and the Elixir Team.\n\nAnyone can use the Elixir trademarks if that use of the trademark is nominative.\nThe trademarks must not be used to disparage the project and its community, nor\nbe used in any way to imply ownership, endorsement, or association with the\nElixir project and the Elixir Team.\n\nYou must not visually combine the Elixir logo with any other images, or change\nthe logo in any way other than ways required by printing restrictions. If you\nwant to create your own visual identity in relation to Elixir, you might use the\nshape of an unrelated “water drop” as part of your design, as seen in many\ncommunity projects and initiatives. You must not combine or modify the Elixir\nlogo.\n\nThe Elixir logo is available in our repository in both vertical and horizontal\nversions.\n\nNominative use\nThe “nominative use” (or “nominative fair use”) is a legal doctrine that\nauthorizes everyone (even commercial companies) to use or refer to the trademark\nof another if:\n\nThe product or service in question must be one not readily identifiable without\nuse of the trademark.\n\nOnly so much of the mark or marks may be used as is reasonably necessary to\nidentify the product or service.\n\nThe organization using the mark must do nothing that would, in conjunction with\nthe mark, suggest sponsorship or endorsement by the trademark holder.\n\nOur trademarks must be used to refer to the Elixir programming language.\n\nExamples of permitted use\nAll examples listed next must strictly adhere to the terms outlined in the\nprevious sections:\n\nUsage of the Elixir logo to say a technology is “powered by Elixir” under\nnominative use. Linking back to the Elixir website, if possible, is appreciated.\n\nUsage of the Elixir logo to display it as a supported technology in a service or\nplatform. For instance, you may say “we support Elixir” and use the Elixir logo,\nbut you may not refer to yourself as “the Elixir platform” nor imply any form of\nendorsement or association with Elixir.\n\nUsage of the Elixir logo in non-commercial community meetups, in presentations,\nand in courses when referring to the language and its ecosystem under nominative\nuse.\n\nUsage of the Elixir logo in non-commercial swag (stickers, t-shirts, mugs, etc)\nto promote the Elixir programming language. The Elixir marks must be the only\nmarks featured in the product. You need permission to make swag that include\nElixir and other third party marks in them.\n\nInclusion of the Elixir logo in non-commercial icon sets. Use of the Elixir\nicons must still adhere to Elixir’s trademark policies.\n\nUsage of the “Elixir” word in book titles, meetups, conferences, and podcasts.\nYou must not use the word to imply uniqueness or endorsement from the Elixir\nteam. “The Elixir book” and “The Elixir podcast” are not permitted.\n“Elixir in Action”, “Thinking Elixir”, and “Kraków Elixir User Group” are valid\nexamples already in use today.\n\nUsage of the “Elixir” word in the names of freely distributed software and\nhardware products is allowed when referring to use with or suitability for the\nElixir programming language, such as wxElixir, Elixirsense, etc. If the product\nincludes the Elixir programming language itself, then you must also respect its\nlicense.\n\nExamples of not permitted use\nHere is a non-exhaustive list of non permitted uses of the marks:\n\nUsage of the Elixir logo in book covers, conferences, and podcasts.\n\nUsage of the Elixir logo as the mark of third party projects, even in combination\nwith other marks.\n\nNaming any company or product after Elixir, such as “The Elixir Hosting”,\n“The Elixir Consultants”, etc.\n\nExamples that require permission\nHere are some examples that may be granted permission upon request:\n\nSelling merchandise (stickers, t-shirts, mugs, etc).\nYou can request permission by emailing trademarks@elixir-lang.org.\n\nImportant note\nNothing in this page shall be interpreted to allow any third party to claim any\nassociation with the Elixir project and the Elixir Team, or to imply any\napproval or support by the Elixir project and the Elixir Team for any third\nparty products, services, or events."
}