{
  "key": "ellis-lab",
  "short_name": "EllisLab License",
  "name": "EllisLab License",
  "category": "Permissive",
  "owner": "EllisLab",
  "homepage_url": "http://www.codeigniter.com/docs",
  "spdx_license_key": "LicenseRef-scancode-ellis-lab",
  "text": "This license is a legal agreement between you and {copyright-owner} for the use\nof {component} (the \"Software\").  By obtaining the Software you\nagree to comply with the terms and conditions of this license.\n\nPERMITTED USE\nYou are permitted to use, copy, modify, and distribute the Software and its\ndocumentation, with or without modification, for any purpose, provided that\nthe following conditions are met:\n\n1. A copy of this license agreement must be included with the distribution.\n\n2. Redistributions of source code must retain the above copyright notice in\n   all source code files.\n\n3. Redistributions in binary form must reproduce the above copyright notice\n   in the documentation and/or other materials provided with the distribution.\n\n4. Any files that have been modified must carry notices stating the nature\n   of the change and the names of those who changed them.\n\n5. Products derived from the Software must include an acknowledgment that\n   they are derived from {component} in their documentation and/or other\n   materials provided with the distribution.\n\n6. Products derived from the Software may not be called \"{component}\",\n   nor may \"{component}\" appear in their name, without prior written\n   permission from {copyright-owner}.\n\n\nINDEMNITY\nYou agree to indemnify and hold harmless the authors of the Software and\nany contributors for any direct, indirect, incidental, or consequential\nthird-party claims, actions or suits, as well as any related expenses,\nliabilities, damages, settlements or fees arising from your use or misuse\nof the Software, or a violation of any terms of this license.\n\nDISCLAIMER OF WARRANTY\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESSED OR\nIMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF QUALITY, PERFORMANCE,\nNON-INFRINGEMENT, MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE.\n\nLIMITATIONS OF LIABILITY\nYOU ASSUME ALL RISK ASSOCIATED WITH THE INSTALLATION AND USE OF THE SOFTWARE.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS OF THE SOFTWARE BE LIABLE\nFOR CLAIMS, DAMAGES OR OTHER LIABILITY ARISING FROM, OUT OF, OR IN CONNECTION\nWITH THE SOFTWARE. LICENSE HOLDERS ARE SOLELY RESPONSIBLE FOR DETERMINING THE\nAPPROPRIATENESS OF USE AND ASSUME ALL RISKS ASSOCIATED WITH ITS USE, INCLUDING\nBUT NOT LIMITED TO THE RISKS OF PROGRAM ERRORS, DAMAGE TO EQUIPMENT, LOSS OF\nDATA OR SOFTWARE PROGRAMS, OR UNAVAILABILITY OR INTERRUPTION OF OPERATIONS."
}