{
  "key": "entessa-1.0",
  "short_name": "Entessa 1.0",
  "name": "Entessa Public License v1.0",
  "category": "Permissive",
  "owner": "Entessa",
  "homepage_url": "http://openseal.sourceforge.net/epl/index.html",
  "notes": "Per SPDX.org, this license is OSI certified",
  "spdx_license_key": "Entessa",
  "text_urls": [
    "http://openseal.org/epl/index.html",
    "http://web.archive.org/web/20040518115036/http://openseal.org/epl/index.html"
  ],
  "osi_url": "http://opensource.org/licenses/entessa.php",
  "other_urls": [
    "http://opensource.org/licenses/Entessa",
    "http://sourceforge.net/softwaremap/?&fq[]=trove%3A397",
    "https://opensource.org/licenses/Entessa"
  ],
  "minimum_coverage": 90,
  "ignorable_copyrights": [
    "Copyright (c) 2003 Entessa, LLC."
  ],
  "ignorable_holders": [
    "Entessa, LLC."
  ],
  "ignorable_authors": [
    "openSEAL (http://www.openseal.org/)"
  ],
  "ignorable_urls": [
    "http://www.entessa.com/",
    "http://www.openseal.org/"
  ],
  "ignorable_emails": [
    "epl@entessa.com"
  ],
  "text": "Entessa Public License Version. 1.0\n\nCopyright (c) 2003 Entessa, LLC. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n   1. Redistributions of source code must retain the above copyright notice,\n   this list of conditions and the following disclaimer.\n\n   2. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n   \n   3. The end-user documentation included with the redistribution, if any, must\n   include the following acknowledgment:\n\n          \"This product includes open source software developed by openSEAL (http://www.openseal.org/).\"\n\n      Alternately, this acknowledgment may appear in the software itself, if and\n      wherever such third-party acknowledgments normally appear.\n\n   4. The names \"openSEAL\" and \"Entessa\" must not be used to endorse or promote\n   products derived from this software without prior written permission. For\n   written permission, please contact epl@entessa.com.\n\n   5. Products derived from this software may not be called \"openSEAL\", nor may\n   \"openSEAL\" appear in their name, without prior written permission of Entessa.\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL ENTESSA, LLC,\nOPENSEAL OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\nIN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY\nOF SUCH DAMAGE.\n\n============================================================\n\nThis software consists of voluntary contributions made by many individuals on\nbehalf of openSEAL and was originally based on software contributed by Entessa,\nLLC, http://www.entessa.com. For more information on the openSEAL, please see\n<http://www.openseal.org/>."
}