{
  "key": "etalab-2.0-en",
  "short_name": "Etalab Open License 2.0 English",
  "name": "Etalab Open License 2.0 English",
  "category": "Permissive",
  "owner": "DINUM",
  "homepage_url": "https://raw.githubusercontent.com/DISIC/politique-de-contribution-open-source/master/LICENSE",
  "notes": "there is also a French version",
  "spdx_license_key": "LicenseRef-scancode-etalab-2.0-en",
  "text_urls": [
    "https://github.com/etalab/licence-ouverte/blob/master/open-licence.md"
  ],
  "other_urls": [
    "https://github.com/DISIC/politique-de-contribution-open-source/blob/master/LICENSE.pdf",
    "https://raw.githubusercontent.com/DISIC/politique-de-contribution-open-source/master/LICENSE",
    "https://www.etalab.gouv.fr/wp-content/uploads/2018/11/open-licence.pdf"
  ],
  "ignorable_urls": [
    "http://www.data.gouv.fr/fr/datasets/xxx"
  ],
  "text": "# OPEN LICENCE 2.0/LICENCE OUVERTE 2.0\n\n## “Reuse” of the “Information” covered by this licence\n\nThe “Grantor” grants the “Reuser” the free, non-exclusive right to “Reuse” the “Information” subject of this licence, for commercial or non-commercial purposes, worldwide and for an unlimited period, in accordance with the conditions stated below.\n\n**The “Reuser” is free to reuse the “Information”:**\n\n-   To reproduce it, copy it.\n-   To adapt, modify, retrieve and transform it in order to create “derived information”, products and services.\n-   To share, disseminate, redistribute, publish and transmit it.\n-   To exploit it for commercial purposes, e.g., by combining it with other information, or by including it in his/her own product or application.\n\n**Subject to:**\n\n-   An acknowledgement of the authorship of the “Information”: its source (at least, the name of the “Grantor”) and the date of the most recent update of the reused “Information”. Specifically, the “Reuser” may satisfy this condition by pointing, via a hypertext link, to the source of “the Information” and so supplying an actual acknowledgement of its authorship.\n\n**For example:**\n\n> “Ministry of xxx—Original data downloaded from `http://www.data.gouv.fr/fr/datasets/xxx/`, updated on 14 February 2017”.\n\nThis acknowledgement of authorship does not confer any official status on the “Reuse” of the “Information”, and must not suggest any sort of recognition or endorsement on the part of the “Grantor”, or any other public entity, of the “Reuser” or of their “Reuse”.\n\n## Personal data\n\nThe “Information” made available may contain “Personal data” that may be subject to “Reuse”. If this is the case, the “Grantor” informs the “Reuser” about its existence. The “Information” may be freely reused, within the rights granted by this licence, subject to compliance with the legal framework relating to personal data protection.\n\n## Intellectual property rights\n\nIt is guaranteed to The “Reuser” that potential “Intellectual property rights” held by third parties or by the “Grantor” on “Information” do not interfere with the rights granted by this licence.\n\nWhen the “Grantor” holds transferable “Intellectual property rights” on the “Information”, he/she assigns these to the “Reuser” on a non-exclusive basis, free of charge, worldwide, for the entire duration of the “Intellectual property rights”, and the “Reuser” is free to use the “Information” for any purpose that complies with the rights and conditions defined in this licence.\n\n## Liability\n\nThe “Information” is made available as it is produced or received by the “Grantor”, without any other express or tacit guarantee than those set out in this licence. The “Grantor” does not guarantee the absence of errors or inaccuracies in the “Information”, nor a continuous supply of the “Information”. He/she cannot be held responsible for any loss, prejudice or damage of any kind caused to third parties as a result of the “Reuse”.\n\nThe “Reuser” is solely responsible for the “Reuse” of the “Information”. This “Reuse” must not mislead third parties as to the contents of the “Information”, its source or its date of update.\n\n## Applicable legislation\n\nThis licence is governed by French law.\n\n### Compatibility of this licence\n\nThis licence has been designed to be compatible with any free licence that at least requires an acknowledgement of authorship, and specifically with the previous version of this licence as well as with the following licences: United Kingdom’s “Open Government Licence” (OGL), Creative Commons’ “Creative Commons Attribution” (CC-BY) and Open Knowledge Foundation’s “Open Data Commons Attribution” (ODC-BY).\n\n## Definitions\n\nWithin the meaning of this licence, are to be considered as :\n\n-   The “Grantor”: any person granting the right to “Reuse” “Information” under the rights and conditions set out in this licence.\n-   The “Information”:\n    -   any public information contained in documents disclosed or published by any administration referred to in the first paragraph of Article L. 300-2 of the code des relations entre le public et l’administration (CRPA),\n    -   any information made available by any person under the terms and conditions of this licence.\n-   The “Reuse”: the use of the “Information” for other purposes than those for which it was produced or received.\n-   The“Reuser”: any person reusing the “Information” in accordance with the conditions of this licence.\n-   “Personal data”: any information relating to an identified or identifiable natural person who may be identified directly or indirectly. Its “Reuse” is conditional on the respect of the existing legal framework.\n-   “Derived information”: any new data or information created directly from the “Information” or from a combination of the “Information” and other data or information not subject to this licence.\n-   “Intellectual property rights”: all rights identified as such under the code de la propriété intellectuelle (including copyright, rights related to copyright, sui generis rights of database producers, etc.).\n\n## About this licence\n\nThis licence is intended to be used by administrations for the reuse of their public information. It can also be used by any individual wishing to supply “Information” under the conditions defined in this licence.\n\nFrance has a comprehensive legal framework aiming at the spontaneous dissemination by the administrations of their public information in order to ensure the widest possible reuse of this information.\n\nThe right to “Reuse” the administrations’ “Information” is governed by the code des relations entre le public et l’administration  (CRPA).\n\nThis licence facilitates the unrestricted and free of charge reuse of public information and is one of the licences which can be used by the administration pursuant to the decree issued under article L. 323-2 of the CRPA.\n\nUnder the Prime Minister’s authority, the Etalab mission is mandated to open up the maximum amount of data held by State administrations and public institutions. Etalab has drawn up the Open Licence to facilitate the unrestricted and free of charge reuse of public information, as defined by article L. 321-1 of the CRPA.\n\nThis licence is version 2.0 of the Open Licence.\n\nEtalab reserves the right to propose new versions of the Open Licence. Nevertheless, “Reusers” may continue to reuse information obtained under this licence should they so wish."
}