{
  "key": "fastcgi-devkit",
  "short_name": "FastCGI DevKit",
  "name": "FastCGI DevKit",
  "category": "Permissive",
  "owner": "OpenMarket",
  "homepage_url": "http://www.fastcgi.com/devkit/LICENSE.TERMS",
  "notes": "Per Fedora, this license is based on MIT, but contains additional clauses\nwhich make it more than a simple MIT variant, notably, the requirement of\nstatement of new terms of contributions under a different license. For that\nreason, this license is Free, but GPL-incompatible.\n",
  "spdx_license_key": "OML",
  "text_urls": [
    "https://fedoraproject.org/wiki/Licensing/Open_Market_License"
  ],
  "ignorable_copyrights": [
    "copyrighted by Open Market, Inc 'Open Market"
  ],
  "ignorable_holders": [
    "Open Market, Inc 'Open Market"
  ],
  "text": "This FastCGI application library source and object code (the\n\"Software\") and its documentation (the \"Documentation\") are\ncopyrighted by Open Market, Inc (\"Open Market\").  The following terms\napply to all files associated with the Software and Documentation\nunless explicitly disclaimed in individual files.\n\nOpen Market permits you to use, copy, modify, distribute, and license\nthis Software and the Documentation for any purpose, provided that\nexisting copyright notices are retained in all copies and that this\nnotice is included verbatim in any distributions.  No written\nagreement, license, or royalty fee is required for any of the\nauthorized uses.  Modifications to this Software and Documentation may\nbe copyrighted by their authors and need not follow the licensing\nterms described here.  If modifications to this Software and\nDocumentation have new licensing terms, the new terms must be clearly\nindicated on the first page of each file where they apply.\n\nOPEN MARKET MAKES NO EXPRESS OR IMPLIED WARRANTY WITH RESPECT TO THE\nSOFTWARE OR THE DOCUMENTATION, INCLUDING WITHOUT LIMITATION ANY\nWARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.  IN\nNO EVENT SHALL OPEN MARKET BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY\nDAMAGES ARISING FROM OR RELATING TO THIS SOFTWARE OR THE\nDOCUMENTATION, INCLUDING, WITHOUT LIMITATION, ANY INDIRECT, SPECIAL OR\nCONSEQUENTIAL DAMAGES OR SIMILAR DAMAGES, INCLUDING LOST PROFITS OR\nLOST DATA, EVEN IF OPEN MARKET HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.  THE SOFTWARE AND DOCUMENTATION ARE PROVIDED \"AS IS\".\nOPEN MARKET HAS NO LIABILITY IN CONTRACT, TORT, NEGLIGENCE OR\nOTHERWISE ARISING OUT OF THIS SOFTWARE OR THE DOCUMENTATION."
}