{
  "key": "ffsl-1",
  "short_name": "FFSL v1",
  "name": "Floodgap Free Software License v1",
  "category": "Copyleft Limited",
  "owner": "Floodgap",
  "homepage_url": "http://www.floodgap.com/software/ffsl/",
  "spdx_license_key": "LicenseRef-scancode-ffsl-1",
  "text_urls": [
    "http://www.floodgap.com/software/ffsl/license.txt"
  ],
  "other_urls": [
    "https://github.com/search?q=%22Floodgap+Free+Software+License%22&type=code",
    "https://www.google.com/search?q=%22Floodgap"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2112 D. Original Author",
    "copyright (c) 2006 Cameron Kaiser"
  ],
  "ignorable_holders": [
    "Cameron Kaiser",
    "D. Original Author"
  ],
  "ignorable_urls": [
    "http://www.floodgap.com/software/ffsl/"
  ],
  "text": "Floodgap Free Software License\n\n   The author of your software has chosen to distribute it under the\n   Floodgap Free Software License. Although this software is without cost,\n   it is not released under Copyleft or GPL, and there are differences\n   which you should read. Your use of this software package constitutes\n   your binding acceptance without restriction.\n\n  This software is without cost\n\n   The Floodgap Free Software License (FFSL) has one overriding mandate:\n   that software using it, or derivative works based on software that uses\n   it, must be free. By free we mean simply \"free as in beer\" -- you may\n   put your work into open or closed source packages as you see fit,\n   whether or not you choose to release your changes or updates publicly,\n   but you must not ask any fee for it. (There are certain exceptions for\n   for-profit use which we will discuss below.)\n\n  Definitions and terms\n\n   Author\n          The declared copyright owner of this software package.\n\n   Binary\n          A pre-compiled or pre-interpreted bytecode or machine language\n          representation of a software package not designed for further\n          modification and tied to a particular platform or architecture.\n\n   Derivative work\n          Any distribution (q.v.) that contains any modification to or\n          deviation from the official reference distribution (q.v.); or\n          any software package significantly based on or integrally\n          including the source code for its features, including but not\n          limited to supersets; subsets of a significant proportion;\n          in-place patched changes to source or binary files; linking in\n          as a library; binary-only distributions if the original package\n          included source (even if the source was not modified prior to\n          compilation); or translations to another programming language,\n          architecture or operating system environment. Derivative works\n          of packages released under this license are also considered\n          subject to this license.\n\n          However, a software package that requires this package but does\n          not include it or is not based upon it, even if it will not\n          operate without it, is not considered a derivative work. For\n          example, interpreted programs requiring an interpreter issued\n          under this license, assuming they are not distributed with any\n          portion of the interpreter, are not derivative works.\n\n   Distribution\n          A packaged release of this software, either the author's\n          original work (the \"reference distribution\") or a derivative\n          work based upon it.\n\n   Reference distribution\n          A packaged release of this software explicitly designated as the\n          official release, written by or on behalf of the Author with his\n          or her explicit designation as official. Only exact copies of\n          the reference distribution may be called reference\n          distributions; all other forms are derivative works.\n\n   Source code\n          The human-readable programming instructions of the package which\n          might be easily read as text and subsequently edited, but\n          requiring compilation or interpretation into binary before being\n          directly useable.\n\n  What you are permitted to do under this license\n\n   Pursuant to the remainder of the terms below,\n     * You may freely use, copy, and disseminate this software package for\n       any non-commercial purpose as well as the commercial purposes\n       permitted below.\n     * You may freely modify this package, including source code if\n       available. Your modifications need not be released, although you\n       are encouraged to do so.\n     * You may release your derivative works based upon this software in\n       purely binary (non-source) form if you choose. You are not\n       obligated to release any portion of your source code openly,\n       although you are encouraged to do so.\n     * If this package is a tool used for generation, compilation or\n       maintenance of works, including but not limited to readable\n       documents, software packages or images (for example, compilers,\n       interpreters, translators, linkers, editors, assemblers or\n       typesetters), you may freely use it for that purpose, commercial or\n       otherwise, as the works made by this package are not considered\n       subject to this license unless specified otherwise within and may\n       be distributed under any desired license and/or offered for sale or\n       rental. Any run-time library or run-time code section linked into\n       the output by a compiler or similar code-generating tool governed\n       by this license is considered to be an integral part of the output,\n       and its presence does not subject the generated work to this\n       license either. (This is, of course, assuming you are not using\n       said tools to generate a derivative work based on this package in\n       violation of the other license terms.)\n       However, if you are linking or including a separately distributed\n       library that is under this license, no matter what tool you are\n       using to do the linking or inclusion, you are then considered to be\n       making a derivative work based on that library and your work does\n       fall under this license. To avoid this, do not include the library\n       with your work (even though it needs the library to function) and\n       instead offer the library separately without cost.\n     * In addition to non-commercial use and the uses permitted above, you\n       may use this software package in any for-profit endeavour as long\n       as it does not involve the specific sale or rental of this package.\n       Some specific but by no means exhaustive examples are listed below.\n       Note that some of these situations may require additional action be\n       taken to ensure compliance.\n          + If this package or a derivative work allows you to serve data\n            or make data available to others (for example, web servers,\n            mail servers, gopher servers, etc.), you may use it to serve\n            any commercial content or in any commercial setting whether\n            you choose to charge a fee or not, as you are considered to be\n            earning income from the content you serve and/or the services\n            facilitated by your business and not from the sale of this\n            package itself. (This is, of course, assuming that you are not\n            charging a fee for sale or rental of this package or a\n            derivative work based on this package in violation of the\n            other license terms.) Similarly, any data you may acquire from\n            the use of this package is yours, and not governed by this\n            license in any way even if for-profit.\n          + If you are selling a product that includes this package or a\n            derivative work either as part of your product's requirements\n            for function or as a bundled extra, such as an operating\n            system distribution, you may charge a fee for your product as\n            long as you also make this package or said derivative work\n            available for free separately (such as by download or link\n            back to this package's site), as you are considered to be\n            requesting a fee for your own product and the package is\n            merely included as a convenience to your users.\n          + If you offer installation of this package or a derivative work\n            as a service, you may charge a fee for the act of installation\n            as long as you also make this package or said derivative work\n            available for free (such as by download or link back to this\n            package's site), as you are considered to be requesting a fee\n            for the act of installation and not for the software you are\n            installing.\n          + The Author may also grant, in writing, other specified\n            exemptions for your particular commercial purpose that do not\n            contravene the spirit of this license or any license terms\n            this package additionally carries.\n     * In your derivative works based on this package, you may choose to\n       offer warranty support or guarantees of performance. This does not\n       in any way make the original Author legally, financially or in any\n       other respect liable for claims issued under your warranty or\n       guarantee, and you are solely responsible for the fulfillment of\n       your terms even if the Author of the work you have based your work\n       upon offers his or her own.\n     * In your derivative works based on this package, you may further\n       restrict the acceptable uses of your package or situations in which\n       it may be employed as long as you clearly state that your terms\n       apply only to your derivative work and not to the original\n       reference distribution. However, you may not countermand or ignore,\n       directly or otherwise, any restriction already made in the\n       reference distribution's license, including in this document\n       itself, in similar fashion to other licenses allowing compatible\n       licenses to co-govern a particular package's use.\n\n  What you must not do under this license\n\n   Remember that these limits apply only to redistribution of a reference\n   distribution, or to a true derivative work. If your project does not\n   include this package or code based upon it, even if it requires this\n   package to function, it is not considered subject to this license or\n   these restrictions.\n     * You must not charge a fee for purchase or rental of this package or\n       any derivative work based on this package. It is still possible to\n       use this package in a commercial environment, however -- see What\n       you are permitted to do under this license.\n     * You must not countermand or ignore, directly or otherwise, the\n       restrictions already extant in this package's license in your\n       derivative work based on it. As a corollary, you must not place\n       your derivative work under a secondary license or description of\n       terms that conflicts with it (for example, this license is not\n       compatible with the GNU Public License).\n     * You must not label any modified distribution of this package as a\n       reference or otherwise official distribution without the permission\n       of the original Author or Authors. You must clearly specify that\n       your modified work is a derivative work, including binary-only\n       releases if the original included source code and you do not even\n       if you did not modify the source prior to compilation.\n\n  What you must do under this license\n\n     * You must agree to all terms specified (agreement to which is\n       unconditionally signified by your usage, modification or\n       repurposing of this package), or to remove the package from your\n       computer and not use it further.\n     * In the absence of any specific offer for redress or assistance\n       under warranty or guarantee of performance that the Author of this\n       package might make, you must agree to accept any and all liability\n       that may come from the use of this package, proper or improper,\n       real or imagined, and certify without condition that you use this\n       product at your own risk with no guarantee of function,\n       merchantability or fitness for a particular purpose. If such offer\n       of redress or assistance is extended, it is fulfillable only by the\n       Author who extended the offer, which might not necessarily be this\n       Author, nor might it be the Authors of any packages it might be\n       based upon.\n     * If you choose to publicly redistribute this package or create a\n       derivative work based on this package, you must make it available\n       without any purchase or rental fee of any kind.\n     * If you choose to create a derivative work based on this package,\n       your derivative work must be copyrighted, and must be governed\n       under (at a minimum) the original package's license, which will\n       necessarily include all terms noted here. As such, if you choose to\n       distribute your derivative work, you must include a human-readable\n       license in your distribution containing all restrictions of use,\n       necessarily including this license, and any additional restrictions\n       the Author has mandated that do not contravene this license which\n       you and users of your derivative work must also honour.\n     * If you choose to create and distribute a derivative work based on\n       this package, your derivative work must clearly make reference to\n       this package, any other packages your work or the original work\n       might be based on, and all applicable copyrights, either in your\n       documentation, your work's standard human-readable output, or both.\n       A suggested method might be\n\n     Contains or is based on the Foo software package.\n     Copyright (C) 2112 D. Original Author. All rights reserved.\n     http://their.web.site.invalid/\n\n  Additional notes\n\n   Enforcement is the responsibility of the Author. However, violation of\n   this license may subject you to criminal and civil penalties depending\n   on your country.\n\n   This package is bound by the version of license that accompanies it.\n   Future official versions of a particular package may use a more updated\n   license, and you should always review the license before use. This\n   license's most current version is always available from the following\n   locations:\n\n     [1]http://www.floodgap.com/software/ffsl/\n     [2]gopher://gopher.floodgap.com/1/ffsl/\n\n   This license is version 1, dated 19 November 2006.\n\n   This license is copyright © 2006 Cameron Kaiser. All rights reserved.\n   The text of this license is available for re-use and re-distribution\n   under the Creative Commons. The use of the term \"Floodgap Free Software\n   License\" does not imply endorsement of packages using this license by\n   Floodgap Systems or by Cameron Kaiser. Modified licenses using portions\n   of these terms may refer to themselves as modified FFSL, with the\n   proviso that their modifications be clearly marked in accordance with\n   the Creative Commons Attribution-ShareAlike 2.5 License.\n\n   Only the text of this license, and not programs covered by this\n   license, is so offered under Creative Commons.\n\nReferences\n\n   1. http://www.floodgap.com/software/ffsl/\n   2. gopher://gopher.floodgap.com/1/ffsl/"
}