{
  "key": "first-works-appreciative-1.2",
  "short_name": "First Works Appreciative License 1.2",
  "name": "First Works Appreciative License 1.2",
  "category": "Proprietary Free",
  "owner": "Jonathan Michael Davis",
  "spdx_license_key": "LicenseRef-scancode-first-works-appreciative-1.2",
  "ignorable_copyrights": [
    "Copyright (c) 2005 Jonathan Michael Davis <jond_123@hotmail.com> <jon@jondavis.net>"
  ],
  "ignorable_holders": [
    "Jonathan Michael Davis"
  ],
  "ignorable_emails": [
    "jon@jondavis.net",
    "jond_123@hotmail.com"
  ],
  "text": "First Works Appreciative License\n\nVersion 1.2\nJuly 7, 2005\nCopyright (c) 2005\nJonathan Michael Davis\n<jond_123@hotmail.com>\n<jon@jondavis.net>\n\nAll Rights Reserved\n\n\nThis First Works Appreciative License (the \"License\") applies to any original\nwork of authorship (the \"Original Work\") under whose owner (the \"Licensor\") has\nincluded and clearly referenced this license as part of the Original work, or\nhas placed the following notice immediately following or accompanying the\ncopyright notice for the Original Work:\n\n       \"Licensed under the First Works Appreciative License version 1.2\"\n\nThe recipient and/or of Original Work (the \"Licensee\") is hereby granted this\nLicense.\n\n1) GRANT OF LICENSE. Licensor hereby grants to the Licensee a worldwide,\n   non-exclusive, perpetual license to exercise the following activities:\n\n        a) to reproduce the Original Work in its original state;\n       \n        b) to prepare cooperative works in conjunction with the Original Work\n           that extend the functionality or usefulness of Original Work;\n       \n        c) to modify the Original Work (the \"Modified Work\") for personal use\n           or limited distribution, with the provision that copies of the\n           Modified Work shall conform to the obligations set forth by the\n           sections of this license entitled Conditions Of Redistribution\n           (section 2) and Limitations Of Derivative Work (section 3);\n       \n        d) to distribute copies of the Original Work and associated works to\n           the public, with the provision that copies of the Original Work\n           shall conform to the obligations set forth by the sections of this\n           license entitled Conditions Of Redistribution (section 2) and\n           Limitations Of Derivative Work (section 3);\n           \n        e) to perform the Original Work publicly or privately;\n       \n        f) to display the Original Work publicly or privately.\n\n2) CONDITIONS OF REDISTRIBUTION. The grant of copyright license for\n   redistribution is limited to the following conditions:\n\n        a) Original authorship recognition shall be retained with all copies of\n           Original Work and Modified Work insomuch as was reflected by the\n           Original Work. Modified Work may assign new logos and other artwork\n           and designs to override Original Work, provided it does not negate\n           communication of original authorship or Licensor and identifies the\n           name and/or title of the Original Work.\n           \n        b) Distribution of Original Work may not directly profit, including\n           profitable sale of the Original Work, without permission from the\n           Licensor, whether accompanied with this License or provided to\n           Licensee as a separate exchange of communication or agreement. This\n           limitation DOES NOT hinder Licensee from bundling Original Work with\n           other work of value for profit, provided that the bundle is not\n           identified, labeled, described, or otherwise marketed with the\n           bundled work being the primary product associated with the bundle.\n\n        c) Distribution of Modified Work may directly profit, including\n           profitable sale of the Modified Work, provided that the Licensee has\n           made a reasonable effort to obtain prior permission to perform the\n           work. Licensor reserves the right to deny permission if contacted.\n           However, the requirement of permission is dependent upon the\n           Licensor's accessibility, such as having a valid address. If the\n           Licensee can reasonably evidence that contact could not be made\n           with the Licensor to obtain permission within 60 days of reasonable\n           effort, obtainment of permission is not required, provided\n           subsection \"d\" is retained.\n\n        d) Distribution of Modified Work shall not be granted unless either:\n       \n                1.  The modifications are reasonably minor, and the product is\n                    clearly identified as modified, but the product otherwise\n                    retains all identifications of the Original Work, with the\n                    original author and Licensor retained.\n\n                ii. The modifications are reasonably significant, and the\n                    Modified Work has insignificant (less than 50%) dependence\n                    upon the Original Work to maintain value or usefulness.\n                    Ratio of dependence shall not be construed to assume\n                    measurement based upon file size, lines of code, visual\n                    exposure, or otherwise, but shall be measured fairly on a\n                    case by case basis in a court of law or by a third party\n                    mediator.\n\n3) LIMITATIONS OF DERIVATIVE WORK. Source code is provided freely for personal\n   use on the local machine, and for modifying Original Work to create Modified\n   Work for use on a personal basis on a local machine, or to distribute\n   according to the Conditions of Redistribution (section 2). Source code may\n   also be used for business use, but not for commercial use except as outlined\n   in Conditions of Redistribution (section 2). Source code is also provided\n   for unlimited educational use, provided that the Licensee is or represents\n   an established educational organization, and original authorship notations\n   and recognitions are retained.\n\n4) NO WARRANTY. Except as expressly set forth in this or any superseding\n   agreement, the Original Work is provided on an \"as is\" basis, without\n   warranties or conditions of any kind, either express or implied including,\n   without limitation, any warranties or conditions of title, non-infringement,\n   merchantability or fitness for a particular purpose. Each Recipient is\n   solely responsible for determining the appropriateness of using and\n   distributing the Original Work (or Modified Work) and assumes all risks\n   associated with its exercise of rights under this License, including but not\n   limited to the risks and costs of software errors, compliance with\n   applicable laws, damage to or loss of data, software or hardware, and\n   unavailability or interruption of operations.\n\n5) DISCLAIMER OF LIABILITY. Except as expressly set forth in this or any\n   superseding agreement, neither Licensee nor Licensor, nor any contributors\n   to Modified Works, shall have any liability for any direct, indirect,\n   incidental, special, exemplary, or consequential damages (including without\n   limitation lost profits), however caused and on any theory of liability,\n   whether in contract, strict liability, or tort (including negligence or\n   otherwise) arising in any way out of the use or distribution of the Original\n   Work or the exercise of any rights granted hereunder, even if advised of\n   the possibility of such damages.\n"
}