{
  "key": "flowplayer-gpl-3.0",
  "short_name": "Flowplayer GPL 3.0",
  "name": "Flowplayer GPL 3.0",
  "category": "Copyleft",
  "owner": "Flowplayer",
  "homepage_url": "https://flowplayer.org/license/",
  "spdx_license_key": "LicenseRef-scancode-flowplayer-gpl-3.0",
  "other_urls": [
    "http://www.gnu.org/licenses/gpl-3.0.html"
  ],
  "ignorable_authors": [
    "ModOrg"
  ],
  "ignorable_urls": [
    "http://www.gnu.org/licenses/"
  ],
  "text": "This program is free software: you can redistribute it and/or modify it under\nthe terms of the GNU General Public License as published by the Free Software\nFoundation, either version 3 of the License, or (at your option) any later\nversion.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A\nPARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with\nthis program.  If not, see <http://www.gnu.org/licenses/>.\n\nThe Flowplayer Free version is released under the GNU GENERAL PUBLIC LICENSE\nVersion 3 (GPL). Our GPL based license requires that you do not remove the\ncopyright notices or author attribution from the player's user interface. These\nare present in the player canvas (bottom left corner) and in the context menu.\nSee license FAQ for more details.\n\nCommercial licenses are available. The commercial player version does not\nrequire any Flowplayer notices or texts and also provides some additional\nfeatures.\n\nADDITIONAL TERM per GPL Section 7\n\nIf you convey this program (or any modifications of it) and assume contractual\nliability for the program to recipients of it, you agree to indemnify\nFlowplayer, Ltd. for any liability that those contractual assumptions impose on\nFlowplayer, Ltd.\n\nExcept as expressly provided herein, no trademark rights are granted in any\ntrademarks of Flowplayer, Ltd. Licensees are granted a limited, non-exclusive\nright to use the mark Flowplayer and the Flowplayer logos in connection with\nunmodified copies of the Program and the copyright notices required by section\n5.d of the GPL license. For the purposes of this limited trademark license\ngrant, customizing the Flowplayer by skinning, scripting, or including plugins\nprovided by Flowplayer, Ltd. is not considered modifying the Program.\n\nLicensees that do modify the Program, taking advantage of the open-source\nlicense, may not use the Flowplayer mark or Flowplayer logos and must change the\nlogo as follows:\n\nstating that the licensee modified the Flowplayer. A suitable notice might read\n\"Flowplayer Source code modified by ModOrg 2012\"; for the canvas, the notice\nshould read \"Based on Flowplayer source code\".\n\nIn addition, licensees that modify the Program must give the modified Program a\nnew name that is not confusingly similar to Flowplayer and may not distribute it\nunder the name Flowplayer."
}