{
  "key": "fraunhofer-iso-14496-10",
  "short_name": "Fraunhofer ISO 14496-10 License",
  "name": "Fraunhofer ISO 14496-10 License",
  "category": "Permissive",
  "owner": "Fraunhofer-Gesellschaft",
  "spdx_license_key": "LicenseRef-scancode-fraunhofer-iso-14496-10",
  "minimum_coverage": 60,
  "ignorable_copyrights": [
    "Copyright (c) ISO/IEC 2005",
    "Copyright 2005, International Telecommunications Union, Geneva"
  ],
  "ignorable_holders": [
    "ISO/IEC",
    "International Telecommunications Union, Geneva"
  ],
  "ignorable_authors": [
    "Heiko Schwarz Fraunhofer"
  ],
  "ignorable_urls": [
    "http://www.itu.int/"
  ],
  "text": "********************************************************************************\n\nNOTE - One of the two copyright statements below may be chosen\n       that applies for the software.\n\n********************************************************************************\n\nThis software module was originally developed by\n\nHeiko Schwarz    (Fraunhofer HHI),\nTobias Hinz      (Fraunhofer HHI),\nKarsten Suehring (Fraunhofer HHI)\n\nin the course of development of the ISO/IEC 14496-10:2005 Amd.1 (Scalable Video\nCoding) for reference purposes and its performance may not have been optimized.\nThis software module is an implementation of one or more tools as specified by\nthe ISO/IEC 14496-10:2005 Amd.1 (Scalable Video Coding).\n\nThose intending to use this software module in products are advised that its\nuse may infringe existing patents. ISO/IEC have no liability for use of this\nsoftware module or modifications thereof.\n\nAssurance that the originally developed software module can be used\n(1) in the ISO/IEC 14496-10:2005 Amd.1 (Scalable Video Coding) once the\nISO/IEC 14496-10:2005 Amd.1 (Scalable Video Coding) has been adopted; and\n(2) to develop the ISO/IEC 14496-10:2005 Amd.1 (Scalable Video Coding):\n\nTo the extent that Fraunhofer HHI owns patent rights that would be required to\nmake, use, or sell the originally developed software module or portions thereof\nincluded in the ISO/IEC 14496-10:2005 Amd.1 (Scalable Video Coding) in a\nconforming product, Fraunhofer HHI will assure the ISO/IEC that it is willing\nto negotiate licenses under reasonable and non-discriminatory terms and\nconditions with applicants throughout the world.\n\nFraunhofer HHI retains full right to modify and use the code for its own\npurpose, assign or donate the code to a third party and to inhibit third\nparties from using the code for products that do not conform to MPEG-related\nITU Recommendations and/or ISO/IEC International Standards.\n\nThis copyright notice must be included in all copies or derivative works.\nCopyright (c) ISO/IEC 2005.\n\n********************************************************************************\n\nCOPYRIGHT AND WARRANTY INFORMATION\n\nCopyright 2005, International Telecommunications Union, Geneva\n\nThe Fraunhofer HHI hereby donate this source code to the ITU, with the following\nunderstanding:\n    1. Fraunhofer HHI retain the right to do whatever they wish with the\n       contributed source code, without limit.\n    2. Fraunhofer HHI retain full patent rights (if any exist) in the technical\n       content of techniques and algorithms herein.\n    3. The ITU shall make this code available to anyone, free of license or\n       royalty fees.\n\nDISCLAIMER OF WARRANTY\n\nThese software programs are available to the user without any license fee or\nroyalty on an \"as is\" basis. The ITU disclaims any and all warranties, whether\nexpress, implied, or statutory, including any implied warranties of\nmerchantability or of fitness for a particular purpose. In no event shall the\ncontributor or the ITU be liable for any incidental, punitive, or consequential\ndamages of any kind whatsoever arising from the use of these programs.\n\nThis disclaimer of warranty extends to the user of these programs and user's\ncustomers, employees, agents, transferees, successors, and assigns.\n\nThe ITU does not represent or warrant that the programs furnished hereunder are\nfree of infringement of any third-party patents. Commercial implementations of\nITU-T Recommendations, including shareware, may be subject to royalty fees to\npatent holders. Information regarding the ITU-T patent policy is available from\nthe ITU Web site at http://www.itu.int.\n\nTHIS IS NOT A GRANT OF PATENT RIGHTS - SEE THE ITU-T PATENT POLICY.\n\n********************************************************************************"
}