{
  "key": "free-fork",
  "short_name": "Free-Fork License",
  "name": "University of Washington Free-Fork License",
  "category": "Copyleft Limited",
  "owner": "University of Washington IT",
  "spdx_license_key": "LicenseRef-scancode-free-fork",
  "ignorable_copyrights": [
    "Copyright 1988-2002 University of Washington"
  ],
  "ignorable_holders": [
    "University of Washington"
  ],
  "ignorable_emails": [
    "imap-license@cac.washington.edu"
  ],
  "text": "University of Washington's Free-Fork License\n\nUniversity of Washington IMAP toolkit\nVersion 2002 of IMAP toolkit\nCopyright 1988-2002 University of Washington\n\nThis University of Washington Distribution (code and documentation) is\nmade available to the open source community as a public service by the\nUniversity of Washington.  Contact the University of Washington at\nimap-license@cac.washington.edu for information on other licensing\narrangements (e.g. for use in proprietary applications).\n\nUnder this license, this Distribution may be modified and the original\nversion and modified versions may be copied, distributed, publicly\ndisplayed and performed provided that the following conditions are\nmet:\n\n(1) modified versions are distributed with source code and\ndocumentation and with permission for others to use any code and\ndocumentation (whether in original or modified versions) as granted\nunder this license;\n\n(2) if modified, the source code, documentation, and user run-time\nelements should be clearly labeled by placing an identifier of origin\n(such as a name, initial, or other tag) after the version number;\n\n(3) users, modifiers, distributors, and others coming into possession\nor using the Distribution in original or modified form accept the\nentire risk as to the possession, use, and performance of the\nDistribution;\n\n(4) this copyright management information (software identifier and\nversion number, copyright notice and license) shall be retained in all\nversions of the Distribution;\n\n(5) the University of Washington may make modifications to the\nDistribution that are substantially similar to modified versions of\nthe Distribution, and may make, use, sell, copy, distribute, publicly\ndisplay, and perform such modifications, including making such\nmodifications available under this or other licenses, without\nobligation or restriction;\n\n(6) modifications incorporating code, libraries, and/or documentation\nsubject to any other open source license may be made, and the\nresulting work may be distributed under the terms of such open source\nlicense if required by that open source license, but doing so will not\naffect this Distribution, other modifications made under this license\nor modifications made under other University of Washington licensing\narrangements;\n\n(7) no permission is granted to distribute, publicly display, or\npublicly perform modifications to the Distribution made using\nproprietary materials that cannot be released in source format under\nconditions of this license;\n\n(8) the name of the University of Washington may not be used in\nadvertising or publicity pertaining to Distribution of the software\nwithout specific, prior written permission.\n\nThis software is made available \"as is\", and\n\nTHE UNIVERSITY OF WASHINGTON DISCLAIMS ALL WARRANTIES, EXPRESS OR\nIMPLIED, WITH REGARD TO THIS SOFTWARE, INCLUDING WITHOUT LIMITATION\nALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE, AND IN NO EVENT SHALL THE UNIVERSITY OF WASHINGTON BE LIABLE\nFOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\nACTION OF CONTRACT, TORT (INCLUDING NEGLIGENCE) OR STRICT LIABILITY,\nARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS\nSOFTWARE."
}