{
  "key": "freetts",
  "short_name": "FreeTTS License",
  "name": "FreeTTS License",
  "category": "Permissive",
  "owner": "Oracle Corporation",
  "homepage_url": "http://freetts.sourceforge.net/license.terms",
  "spdx_license_key": "LicenseRef-scancode-freetts",
  "text_urls": [
    "http://freetts.sourceforge.net/license.terms"
  ],
  "faq_url": "http://freetts.sourceforge.net/docs/index.php",
  "ignorable_copyrights": [
    "Portions Copyright 1999-2001 Language Technologies Institute, Carnegie Mellon University",
    "Portions Copyright 2001-2004 Sun Microsystems, Inc."
  ],
  "ignorable_holders": [
    "Language Technologies Institute, Carnegie Mellon University",
    "Sun Microsystems, Inc."
  ],
  "text": "Portions Copyright 2001-2004 Sun Microsystems, Inc.  \nPortions Copyright 1999-2001 Language Technologies Institute,\nCarnegie Mellon University.  \nAll Rights Reserved.  Use is subject to license terms.\n\nPermission is hereby granted, free of charge, to use and distribute\nthis software and its documentation without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of this work, and to\npermit persons to whom this work is furnished to do so, subject to\nthe following conditions:\n\n 1. The code must retain the above copyright notice, this list of\n    conditions and the following disclaimer.\n 2. Any modifications must be clearly marked as such.\n 3. Original authors' names are not deleted.\n 4. The authors' names are not used to endorse or promote products\n    derived from this software without specific prior written\n    permission.\n\nSUN MICROSYSTEMS, INC., CARNEGIE MELLON UNIVERSITY AND THE\nCONTRIBUTORS TO THIS WORK DISCLAIM ALL WARRANTIES WITH REGARD TO THIS\nSOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS, IN NO EVENT SHALL SUN MICROSYSTEMS, INC., CARNEGIE MELLON\nUNIVERSITY NOR THE CONTRIBUTORS BE LIABLE FOR ANY SPECIAL, INDIRECT OR\nCONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF\nUSE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR\nOTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\nPERFORMANCE OF THIS SOFTWARE."
}