{
  "key": "generic-amiwm",
  "short_name": "Generic-amiwm",
  "name": "Generic-amiwm",
  "category": "Proprietary Free",
  "owner": "Marcus Comstedt",
  "homepage_url": "https://metadata.ftp-master.debian.org/changelogs//non-free/a/amiwm/amiwm_0.22pl2-3_copyright",
  "spdx_license_key": "LicenseRef-scancode-generic-amiwm",
  "text": "License: Generic-amiwm\n Generic amiwm License\n =====================\n .\n This license applies to whomever receives this file.  It is a generic\n license to use and distribute amiwm.  If you want to acquire the software\n under a different license, please contact the author.  This license is\n in part based on the XV license by John Bradley.\n .\n Permission to copy and distribute amiwm in its entirety, for\n non-commercial purposes, is hereby granted without fee, provided\n that this license information and copyright notice appear in all copies.\n .\n If you redistribute amiwm, the *entire* contents of this distribution\n must be distributed, including the README, INSTALL and LICENSE files,\n the sources, and the various scripts and Makefiles.\n .\n You may distribute binaries built from the unmodified amiwm sources, for\n non-commercial purposes, provided that the entire amiwm source distribution\n is also included, as per the preceding paragraph.\n .\n You may distribute amiwm as a component of an aggregate software\n distribution, provided that no other condition of this license is violated.\n In particular, the entire amiwm distribution must be included in the\n aggregate software distribution.\n .\n Unrestricted use of the software is also hereby granted without fee.\n Distribution and modification of source or binaries are not considered use\n and explicitly covered by other paragraphs of this license.\n .\n The software may be modified for your own purposes, but modified versions\n may not be distributed without prior consent of the author.  You may\n freely distribute patches against the unmodified source code.\n .\n This software is provided 'as-is', without any express or implied\n warranty.  In no event will the author be held liable for any damages\n arising from the use of this software."
}