{
  "key": "genivia-gsoap",
  "short_name": "Genivia Proprietary",
  "name": "Genivia gSOAP Commercial Licensing",
  "category": "Commercial",
  "owner": "Genivia",
  "homepage_url": "http://www.genivia.com/Products/gsoap/contract.html",
  "spdx_license_key": "LicenseRef-scancode-genivia-gsoap",
  "text_urls": [
    "http://www.genivia.com/Products/gsoap/contract.html"
  ],
  "other_urls": [
    "sales@genivia.com"
  ],
  "ignorable_emails": [
    "sales@genivia.com"
  ],
  "text": "Commercial Licensing and Support Contracting\n\nOur software products are developed with great care and passed numerous industry\nevaluations. Our software is used by the US government and military.\n\nReturning customers looking for online payment of invoices, please contact us.\n\nLicensing Options\n\nThere are three licensing options.\n\nStandard Open Source Edition: The open source edition offers basic functionality\nwithout the use of the wsdl2h tool (no WSDL/schemas to code generation), no\nwebserver, no UDDI support, and no sample applications to use as basis for your\nprojects. The limited edition is licensed under the gSOAP public license free of\ncharge for commercial use. The gSOAP public license requires a notice (Exhibit\nB) in the project documentation and in the third-party license list of the\nproduct.\n\nStandard Commercial Edition: The standard edition of the gSOAP toolset for\ncommercial use. This edition is identical to the standard open source edition,\nbut allows the use of the wsdl2h and soapcpp2 tools for commercial code and\ndocument generation. This licens does not have the limitations of the open-\nsource GPL and gSOAP public licenses. The standard commercial edition is\nlicensed with limited warranties.\n\nEnterprise Edition: The enterprise edition of the gSOAP toolset provides the\ngold standard toolset for your enterprise. The enterprise edition is best suited\nfor organizations that require high reliability, security, and extensive support\nfor WSDL, SOAP, XML, and WS-* protocols. Warranties, software maintenance and\nsupport are included.\n\nTo determine the applicable license or to inquire about license and support cost\ninformation please send a request with a project description from your official\ncompany e-mail address to sales@genivia.com.\n\nDownload standard open source edition\n\nResellers\n\nPlease contact sales@genivia.com for pricing of the standard edition with or\nwithout the software support/maintenance option."
}