{
  "key": "github-codeql-terms-2020",
  "short_name": "GitHub CodeQL Terms 2020",
  "name": "GitHub CodeQL Terms and Conditions 2020",
  "category": "Proprietary Free",
  "owner": "GitHub Inc",
  "homepage_url": "https://github.com/github/codeql-cli-binaries/blob/main/LICENSE.md",
  "spdx_license_key": "LicenseRef-scancode-github-codeql-terms-2020",
  "text_urls": [
    "https://raw.githubusercontent.com/github/codeql-cli-binaries/main/LICENSE.md"
  ],
  "ignorable_urls": [
    "https://github.com/contact",
    "https://github.com/logos",
    "https://support.github.com/contact"
  ],
  "text": "GitHub CodeQL Terms and Conditions\n==================================\nThese GitHub CodeQL Terms and Conditions (\"**Terms**\") are a legal\nagreement between you (either as an individual or on behalf of an\nentity) and GitHub, Inc. regarding your use of the GitHub CodeQL\nsoftware and associated documentation (collectively, the\n\"**Software**\"). By using the Software, you accept these Terms.\n**Please read all of these Terms;** in many cases, provisions set\nforth later in the Terms limit and qualify provisions set forth\nearlier in the Terms.  If you do not accept these Terms, do not\ndownload, install, use, or copy the Software.\n\nDefinitions\n-----------\n\nIn these Terms:\n\n  * \"OSI-approved License\" means an Open Source Initiative\n    (OSI)-approved open source software license.\n\n  * \"Open Source Codebase\" means a codebase that is released under an\n    OSI-approved License.\n\nUse Rights; Scope of License\n----------------------------\n\nThe Software is licensed on a per user basis. Here's what you may do\nwith the Software, but subject to License Restrictions provisions\nbelow:\n\n  * Use the Software to perform academic research.\n\n  * Use the Software to demonstrate the Software.\n\n  * Test CodeQL queries that are released under an OSI-approved\n    Licence to confirm that new versions of those queries continue to\n    find the right vulnerabilities.\n\nHere's what you may also do with the Software, but only with an Open\nSource Codebase and subject to the License Restrictions provisions\nbelow:\n\n  * Perform analysis on the Open Source Codebase.\n\n  * If the Open Source Codebase is hosted and maintained on\n    GitHub.com, generate CodeQL databases for or during automated\n    analysis, CI, or CD.\n\nLicense Restrictions\n--------------------\n\nThese Terms do not authorize, and the Software may not be used for any\npurpose not expressly set forth above, including:\n\n  * To otherwise or in any other context generate any CodeQL database\n    for or during automated analysis, CI or CD, whether as part of\n    normal engineering processes or another context.\n\n  * To otherwise or in any other context use the Software in\n    connection with any codebase that is not an Open Source Codebase\n    (e.g., code in a private repo in GitHub).\n\n_**Please note:** if your use of the Software is under a paid customer\nlicense for GitHub Advanced Security, the restrictions with respect to\nautomated analysis, CI, and CD and use in connection with non-Open\nSource Codebases do not apply._\n\nAt all times, except (and only to the extent) permitted by applicable\nlaw or applicable third-party license, you will not (and have no right\nto):\n\n  * work around any technical limitations in the Software that only\n    allow you to use it in certain ways;\n\n  * reverse engineer, decompile or disassemble the Software;\n\n  * remove, minimize, block, or modify any notices of GitHub or its\n    suppliers in the Software;\n\n  * use the Software in any way that is against the law; or\n\n  * share, publish, distribute or lend the Software, provide or make\n    available the Software as a hosted solution (whether on a\n    standalone basis or combined, incorporated or integrated with\n    other software or services) for others to use, or transfer the\n    Software or these Terms to any third party.\n\nThe Software is licensed, not sold. GitHub reserves all rights not\nexpressly granted in these Terms.\n\nOpen Source Software\n--------------------\n\nThe Software may include components licensed under open source\nsoftware licenses. Any such licenses are included in the \"Open Source\nNotices\" documentation that is included with the Software. Such\ndocumentation also includes copies of all applicable open source\nlicenses.\n\nTo the extent the terms of the licenses applicable to open source\ncomponents require GitHub to make an offer to provide source code in\nconnection with the Software, such offer is hereby made, and you may\nexercise it by contacting GitHub: https://github.com/contact.\n\nUnless otherwise agreed to in writing with GitHub, your agreement with\nGitHub will always include, at a minimum, these Terms. Open source\nsoftware licenses for the Software's source code constitute separate\nwritten agreements. To the limited extent that any open source\nsoftware license expressly supersedes these Terms, such open source\nlicense governs your use of the applicable component(s) of the\nSoftware subject to such license.\n\nGitHub Trademarks\n-----------------\n\nThese Terms do not grant any right or license to use any of GitHub's\ntrademarks or logos, including, without limitation, the names GitHub\nand CodeQL and any Software logo designs in the \"logos\" folder of the\nSoftware. You agree not to display or use any of these trademarks or\nlogos in any manner without GitHub's prior written permission, except\nas allowed by GitHub's Logos and Usage Policy located at\nhttps://github.com/logos. GitHub reserves all right, title and\ninterest in and to all GitHub trademarks and logos.\n\nAdditional Services\n-------------------\n\nAuto-Updates: The Software may include an auto-update service. If the\nSoftware automatically enables such service (or, if it is not\nautomatically enabled and you choose to use it), GitHub will\nautomatically update the Software when a new version is available.\n\nSupport\n-------\n\nBecause the Software is \"as-is,\" GitHub may not provide support for it.\n\nExport Control\n--------------\n\nCustomer will comply with all applicable export and import laws and\nregulations that apply to the Software.\n\nDisclaimer; Limitations of Liability\n------------------------------------\n\nTHE SOFTWARE, INCLUDING ANY ADDITIONAL SERVICES, IS PROVIDED ON AN\n\"AS-IS\" BASIS, AND GITHUB GIVES NO EXPRESS WARRANTIES, GUARANTEES OR\nCONDITIONS. TO THE EXTENT PERMITTED BY APPLICABLE LAW, GITHUB\nDISCLAIMS THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE AND NON-INFRINGEMENT. YOUR USE OF THE SOFTWARE IS\nAT YOUR SOLE RISK.\n\nTO THE EXTENT PERMITTED BY APPLICABLE LAW, YOU EXPRESSLY UNDERSTAND\nAND AGREE THAT (1) YOU CAN RECOVER DIRECT DAMAGES RELATING TO THE\nSOFTWARE, INCLUDING ANY ADDITIONAL SERVICES, UP TO U.S. $5.00 FROM\nGITHUB AND ITS SUPPLIERS, AND (2) GITHUB WILL NOT BE LIABLE FOR ANY\nINDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR EXEMPLARY DAMAGES,\nINCLUDING, WITHOUT LIMITATION, ANY DAMAGES FOR LOSS OF PROFITS,\nGOODWILL, USE, OR DATA OR OTHER INTANGIBLE LOSSES (EVEN IF GITHUB HAS\nBEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES) RELATING TO THE\nSOFTWARE, INCLUDING ANY ADDITIONAL SERVICES.\n\nMiscellaneous\n-------------\n\n_No Waiver._ The failure of GitHub to exercise or enforce any right or\nprovision of these Terms will not constitute a waiver of such right or\nprovision.\n\n_Entire Agreement._ These Terms, together with any open source\nsoftware licenses referenced above, constitutes the entire agreement\nbetween you and GitHub regarding your use of the Software, superseding\nany prior agreements between you and GitHub (including, but not\nlimited to, any prior versions of these Terms) regarding such use.\n\n_Governing Law._ You agree that these Terms and your use of the\nSoftware are governed by the laws of the State of California and any\ndispute relating to the Software or your use thereof must be brought\nin a tribunal of competent jurisdiction located in or near San\nFrancisco, California.\n\n_Modifications._ These Terms may only be modified by a written\namendment signed by an authorized representative of GitHub, or by the\nposting by GitHub of a revised version.\n\n_Contact Us._ Questions about these Terms? Contact us at\nhttps://support.github.com/contact."
}