{
  "key": "gitpod-self-hosted-free-2020",
  "short_name": "Gitpod Self-Hosted Free License Terms 2020",
  "name": "Gitpod Self-Hosted Free License Terms 2020",
  "category": "Proprietary Free",
  "owner": "Gitpod",
  "homepage_url": "https://github.com/gitpod-io/gitpod/blob/main/License.enterprise.txt",
  "spdx_license_key": "LicenseRef-scancode-gitpod-self-hosted-free-2020",
  "faq_url": "https://github.com/gitpod-io/gitpod/blob/main/License.txt",
  "text": "# Gitpod Self-Hosted Free License Terms and\n# Gitpod Enterprise Source Code License\n\n\n### 1 Preamble\n\n1.1 These Software Licensing Terms (“Terms”) provide the terms and conditions\nthat govern usage of the Software Gitpod Self-Hosted Free Edition in source and\nbinary form (“Software”). The Software is provided by Gitpod GmbH, Am\nGermaniahafen 1, 24143 Kiel (“Gitpod”). By downloading or using to the\nSoftware, you agree to be bound by the following Terms.\n\n### 2  Scope of Terms\n\n2.1 These Terms apply to the usage of the Software, which is designed to be used\nfor business purposes.\n\n2.2 These Terms apply to the binary code and to the source code of the Software,\nunless the header of a source file explicitly refers to a different license.\n\n2.3 These Terms apply unless you have a separate agreement with Gitpod in\nwritten form that explicitly supersedes these Terms.\n\n### 3 License Fees\n\n3.1 The use of the Software as described in Sec. 2 is free of charge. It is\nhowever limited to the features that are accessible without a license key and\nmay only take place in accordance with these Terms.\n\n3.2 In case you want to use additional features or distribute the Software or\nmodifications to it without the restrictions of these Terms, please reach out\nfor a license key, which is subject to different legal and commercial terms.\n\n### 4 Granting of Rights\n\n4.1 Permission is hereby granted to obtain a copy of the Software and their\naccompanying documentation to use, reproduce and execute the Software for\ninternal purposes in accordance with these Terms and to distribute the\nunmodified software without charging a fee for it.\n\n4.2 Subject to the conditions of these Terms, you may modify the Software,\nincluding patching it. You agree that Gitpod retains all right, title and\ninterest in and to all such modifications and patches (“Modifications”). You may\nonly use, reproduce and execute the Modifications for internal purposes in\naccordance with these Terms. You may not distribute Modifications to any third\nparty. Nonetheless, you may make such modifications publicly available as fork\nof the repository which hosts the original version of the Software, however only\nunder these Terms and only, if accompanied by the complete machine-readable\nsource code of the Modifications and of the Software.\n\n4.3 The copyright notices in the Software and this entire statement, including\nthe above license grant and these Terms must be included in all copies of the\nSoftware (in whole or in part). Copyright notices, serial numbers and other\nfeatures aimed at product identification or control may not be removed, altered,\nsuppressed or otherwise bypassed under any circumstances. For the avoidance of\ndoubt, the software may neither in source nor in binary form be modified in\norder to enable or activate any features of the software that would otherwise\nrequire a valid license key.\n\n4.4 Any other usage of the Software, in particular modifying, combining it with\nother software and providing it to third parties on a commercial basis, is\nprohibited. This includes any sale, lease, indirect use of the Software to the\nbenefit of third parties and its provision as a commercial service, or offering\nit as a part of a commercial service or platform.\n\n4.5 The Software remains the exclusive intellectual property of Gitpod at all\ntimes. Mandatory rights resulting from applicable copyright law (e.g. related to\ndecompilation) remain unaffected.\n\n4.6 Gitpod provides the source code of the Software on a voluntary basis and is\nnot obligated to do so. Furthermore, Gitpod is not obligated to provide any\nupdates or upgrades it may develop.\n\n4.7 Please consider purchasing a license key (see above Sec. 3) for further\nusage rights and additional features.\n\n### 5 Telemetry\n\n5.1 Gitpod intends to collect certain statistical data on the use of the\nSoftware on an anonymized basis in the future with a future version of the\nSoftware. The data will only be used to improve the Software and the data will\nnot be sold to third parties. Gitpod will inform about this with the future\nrelease.\n\n### 6 Warranty and Liability\n\n6.1 THE SOFTWARE IS PROVIDED FREE OF CHARGE ON AN “AS IS” BASIS, WITHOUT\nWARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND\nNON-INFRINGEMENT.\n\n6.2 IN NO EVENT SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE\nBE LIABLE FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OF\nOR OTHER DEALINGS IN THE SOFTWARE.\n\n6.3 THIS LIMITATION OF LIABILITY DOES NOT EXCLUDE MANDATORY LEGAL GROUNDS FOR\nLIABILITY SUCH AS LIABILITY FOR PERSONAL INJURY, GROSS NEGLIGENCE, WILLFUL\nINTENT OR LAWS ON PRODUCT LIABILITY.\n\n### 7 Third-party Components\n\n7.1 The Software contains third-party components including open source software\n(“Third-Party Components“). Parts of such Third-Party Components are subject to\ndeviating license terms (“Third-Party License Terms“). A list of such\nThird-Party Components and its respective Third-Party License Terms are\navailable via the files License.third-party.npm.txt and\nLicense.third-party.go.txt. No stipulation in these Terms is intended to impose\nfurther restrictions on your use of such Third-Party Components licensed under\nThird-Party License Terms.\n\n7.2 Gitpod reserves the right to introduce deviating or additional Third-Party\nLicense Terms in the course of modifications of the Software and in case of\nupdates for the Software to the extent necessary due to additional Third-Party\nComponents or due to changed Third-Party License Terms."
}