{
  "key": "gpl-2.0-freertos",
  "is_deprecated": true,
  "short_name": "GPL 2.0 with FreeRTOS exception",
  "name": "GPL 2.0 with FreeRTOS exception",
  "category": "Copyleft Limited",
  "owner": "FreeRTOS",
  "homepage_url": "http://www.freertos.org/a00114.html",
  "notes": "replaced by freertos-exception-2.0",
  "is_exception": true,
  "text_urls": [
    "http://www.freertos.org/"
  ],
  "text": "The FreeRTOS source code is licensed by a modified GNU General Public License - the\nmodification taking the form of an exception.\n\nThe exception permits the source code of applications that use FreeRTOS solely\nthrough the API published on this website to remain closed source, thus permitting\nthe use of FreeRTOS in commercial applications without necessitating that the whole\napplication be open sourced. The exception can only be used if you wish to combine\nFreeRTOS with a proprietary product and you comply with the terms stated in the\nexception itself.\n\nThe FreeRTOS download also includes demo application source code, some of which is\nprovided by third parties AND IS LICENSED SEPARATELY FROM FREERTOS.\n\nFor the avoidance of any doubt refer to the comment included at the top of each\nsource and header file for license and copyright information.\n\nThis is a list of files for which Real Time Engineers Ltd. is not the copyright owner\nand are NOT COVERED BY THE GPL.\n\n1. Various header files provided by silicon manufacturers and tool vendors that\ndefine processor specific memory addresses and utility macros. Permission has been\ngranted by the various copyright holders for these files to be included in the\nFreeRTOS download. Users must ensure license conditions are adhered to for any use\nother than compilation of the FreeRTOS demo applications.\n\n2. The uIP TCP/IP stack the copyright of which is held by Adam Dunkels. Users must\nensure the open source license conditions stated at the top of each uIP source file\nis understood and adhered to.\n\n3. The lwIP TCP/IP stack the copyright of which is held by the Swedish Institute of\nComputer Science. Users must ensure the open source license conditions stated at the\ntop of each lwIP source file is understood and adhered to.\n\n4. Various peripheral driver source files and binaries provided by silicon\nmanufacturers and tool vendors. Permission has been granted by the various copyright\nholders for these files to be included in the FreeRTOS download. Users must ensure\nlicense conditions are adhered to for any use other than compilation of the FreeRTOS\ndemo applications.\n\n5. The files contained within FreeRTOS\\Demo\\WizNET_DEMO_TERN_186\\tern_code, which are\nslightly modified versions of code provided by and copyright to Tern Inc.\n\nErrors and omissions should be reported to Richard Barry, contact details for whom\ncan be obtained from the Contact page.\n\nThis library is free software; you can redistribute it and/or modify it under the\nterms of the GNU General Public License as published by the Free Software Foundation;\neither version 2, or (at your option) any later version.\n\nThis library is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A\nPARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this\nlibrary; see the file COPYING.  If not, write to the Free Software Foundation, 51\nFranklin Street, Fifth Floor, Boston, MA 02110-1301, USA.\n\nGNU General Public License Exception\n\nAny FreeRTOS source code, whether modified or in its original release form, or\nwhether in whole or in part, can only be distributed by you under the terms of the\nGNU General Public License plus this exception. An independent module is a module\nwhich is not derived from or based on FreeRTOS.\n\nEXCEPTION TEXT:\n\nClause 1\n\nLinking FreeRTOS statically or dynamically with other modules is making a combined\nwork based on FreeRTOS. Thus, the terms and conditions of the GNU General Public\nLicense cover the whole combination.\n\nAs a special exception, the copyright holder of FreeRTOS gives you permission to link\nFreeRTOS with independent modules that communicate with FreeRTOS solely through the\nFreeRTOS API interface, regardless of the license terms of these independent modules,\nand to copy and distribute the resulting combined work under terms of your choice,\nprovided that\n\n1. Every copy of the combined work is accompanied by a written statement that details\nto the recipient the version of FreeRTOS used and an offer by yourself to provide the\nFreeRTOS source code (including any modifications you may have made) should the\nrecipient request it.\n\n2. The combined work is not itself an RTOS, scheduler, kernel or related product.\n\n3. The independent modules add significant and primary functionality to FreeRTOS and\ndo not merely extend the existing functionality already present in FreeRTOS.\n\nClause 2\n\nFreeRTOS may not be used for any competitive or comparative purpose, including the\npublication of any form of run time or compile time metric, without the express\npermission of Real Time Engineers Ltd. (this is the norm within the industry and is\nintended to ensure information accuracy)."
}