{
  "key": "gpl-2.0-ice",
  "is_deprecated": true,
  "replaced_by": [
    "gpl-2.0 WITH ice-exception-2.0"
  ],
  "short_name": "GPL 2.0 with Ice exception",
  "name": "GPL 2.0 with Ice exception",
  "category": "Copyleft",
  "owner": "ZeroC",
  "homepage_url": "https://github.com/zeroc-ice/ice/blob/master/ICE_LICENSE",
  "notes": "replaced by ice-exception-2.0",
  "is_exception": true,
  "other_urls": [
    "http://www.gnu.org/licenses"
  ],
  "text": "This copy of Ice is free software; you can redistribute it and/or modify\nit under the terms of the GNU General Public License version 2 as\npublished by the Free Software Foundation.\n\nIce is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS\nFOR A PARTICULAR PURPOSE. See the GNU General Public License for more\ndetails.\n\nYou should have received a copy of the GNU General Public License version\n2 along with this program; if not, see http://www.gnu.org/licenses.\n\nLinking Ice statically or dynamically with other software (such as a \nlibrary, module or application) is making a combined work based on Ice. \nThus, the terms and conditions of the GNU General Public License version\n2 cover this combined work.\n\nIf such software can only be used together with Ice, then not only the \ncombined work but the software itself is a work derived from Ice and as\nsuch shall be licensed under the terms of the GNU General Public License \nversion 2. This includes the situation where Ice is only being used \nthrough an abstraction layer.\n\nAs a special exception to the above, ZeroC grants to the contributors for\nthe following projects the permission to license their Ice-based software \nunder the terms of the GNU Lesser General Public License (LGPL) version \n2.1 or of the BSD license:\n\n - Orca Robotics (http://orca-robotics.sourceforge.net)\n \n - Mumble (http://mumble.sourceforge.net)\n\nThis exception does not extend to the parts of Ice used by these \nprojects, or to any other derived work: as a whole, any work based on Ice\nshall be licensed under the terms and conditions of the GNU General\nPublic License version 2.\n\nYou may also combine Ice with any software not derived from Ice, provided\nthe license of such software is compatible with the GNU General Public \nLicense version 2. In addition, as a special exception, ZeroC grants you\npermission to combine Ice with:\n \n - the OpenSSL library, or with a modified version of the OpenSSL library\n   that uses the same license as OpenSSL\n\n - any library not derived from Ice and licensed under the terms of\n   the Apache License, version 2.0 \n   (http://www.apache.org/licenses/LICENSE-2.0.html) \n\nIf you modify this copy of Ice, you may extend any of the exceptions \nprovided above to your version of Ice, but you are not obligated to \ndo so."
}