{
  "key": "gretelai-sal-1.0",
  "short_name": "Gretel.AI SAL 1.0",
  "name": "Gretel.AI Source Available License Agreement v1.0",
  "category": "Source-available",
  "owner": "Gretel",
  "homepage_url": "https://gretel.ai/license/source-available-license",
  "spdx_license_key": "LicenseRef-scancode-gretelai-sal-1.0",
  "text_urls": [
    "https://github.com/gretelai/gretel-synthetics/blob/master/LICENSE"
  ],
  "faq_url": "https://gretel.ai/license",
  "standard_notice": "Gretel utilizes a Source Available License. Unless one of the\nexceptions or alternate license options below is in place,\nthe default license will be Gretel's Source Available License.\nFor more details and our FAQ please see our website:\nhttps://gretel.ai/license\nExceptions to the Source Available License:\n1. License directly present in the file\n2. LICENSE file in the same directory as the work\n3. First LICENSE found when exploring parent directories up to the project\ntop level directory\n4. Defaults to the Gretel Source Available License\n",
  "ignorable_emails": [
    "hi@gretel.ai"
  ],
  "text": "GRETEL.AI SOURCE AVAILABLE LICENSE AGREEMENT\nVersion 1.0 – August 2022\n\nTHIS GRETEL.AI SOURCE AVAILABLE LICENSE AGREEMENT, VERSION 1.0 (THE “AGREEMENT”) SETS FORTH THE \nTERMS AND CONDITIONS UNDER WHICH GRETEL LABS, INC. (“GRETEL.AI”) MAKES AVAILABLE CERTAIN OF ITS \nPROPRIETARY SOFTWARE SOURCE CODE, AS INDICATED BY A COPYRIGHT NOTICE THAT GRETEL.AI INCLUDES IN \nOR ATTACHES TO SPECIFIC VERSIONS OF SUCH SOFTWARE SOURCE CODE (THE “SOFTWARE”). PLEASE READ THE \nFOLLOWING TERMS AND CONDITIONS CAREFULLY BEFORE DOWNLOADING, INSTALLING OR USING THE SOFTWARE, \nAS THEY GOVERN USE OF THE SOFTWARE.\n\nGretel.ai is willing to license the Software to the individual or entity that agrees to this \nAgreement (“you”), only upon the condition that you accept all the terms contained in this Agreement. \nBy downloading, installing or using the Software, you indicate that you understand this Agreement \nand accept all of its terms. If you are downloading, installing or using the Software on behalf \nof a company or other legal entity, you represent that you have the authority to bind such entity \nto this Agreement, in which case “you” or “your” shall refer to such entity. If you do not agree \nto the terms of this Agreement, you may not download, install or use the Software. \n\nUnless and until you have entered into a separate license agreement with Gretel.ai, this \nAgreement constitutes the final, complete, and exclusive agreement between the parties \nregarding the Software licensed hereunder, and supersedes all prior or contemporaneous \nagreements, understandings, and communication, whether written or oral, with respect \nto such Software.\n\n1) LICENSE.\n\n1.a) Grant of License. Conditioned on your compliance with the terms and conditions of \nthis Agreement, Gretel.ai grants you a non-exclusive, royalty-free, worldwide, \nnon-transferable, non-sublicensable license under Gretel.ai’s copyrights in the \nSoftware and during the term of this Agreement to:\n\n(a) modify and prepare derivative works based on the Software (your “Modifications”);\n(b) compile, install and execute the Software and your Modifications; and, \n(c) to copy the Software and your Modifications as reasonably necessary to exercise \nthe license rights granted above, including making a reasonable number of copies for \nbackup and archival purposes;\n\nin each case, (i) solely on servers and equipment owned or controlled by you, \n(ii) solely for your internal business purposes or for your own non-commercial \nacademic, research or other personal use, and (iii) in all events, in accordance \nwith the obligations and restrictions set forth in this Agreement, including Sections 1.2 - 1.5.\n\n1.b) License Restrictions. The license granted to you in Section 1.1 does not include \nthe right to, and you will not, and you will not permit any other individual or entity to:\n\n(a) distribute, sell, sublicense or otherwise transfer or make available \nthe Software or your Modifications to third parties;\n\n(b) make the Software or your Modifications available to third parties on a service bureau, \ntime sharing, hosting or other computer services basis, or otherwise make the functionality \nof the Software or your Modifications available to third parties, including by providing a \nsoftware-as-a-service, platform-as-a-service, infrastructure-as-a-service or other similar \nonline service (a “XaaS Service”); or\n\n(c) use the Software or your Modifications as part of a product or service, or to perform a \nservice, that is offered to third parties, including by providing a XaaS Service.\n\n1.c) Notices. You will reproduce all of Gretel.ai’s and its licensors’ copyright notices \nand any other proprietary rights notices contained in the Software (and not remove or alter \nany of the foregoing) in all copies of the Software and Modifications that you make.\n\n1.d) Limited Rights. Your rights in the Software are limited to those expressly granted in \nSection 1.1. Gretel.ai and its licensors reserve all right, title and interest in and to \nthe Software and all intellectual property rights therein not expressly granted to you \nin this Agreement. You agree to comply fully with all U.S. export laws and regulations \nto ensure that neither the Software nor any technical data related thereto nor any direct \nproduct thereof are exported or re-exported directly or indirectly in violation of, \nor used for any purposes prohibited by, such laws and regulations.\n\n1.e) Open-Source Software. Gretel.ai may package or otherwise make the Software available \nwith software or other material that is distributed as “free software,” “open source software” \nor under similar licensing or distribution models, including the GNU General Public License, \nGNU Lesser General Public License, Mozilla Public License, BSD licenses, the MIT license, \nthe Apache License and other such licenses, whether or not recognized or approved by the \nFree Software Foundation or the Open Source Initiative (“Open Source Software”), as noted in Gretel.ai’s \ndocumentation for the Software. All such Open Source Software is licensed to you exclusively \nunder the terms of their applicable licenses, including all warranty disclaimers and \nlimitations on liability therein, and the usage limitations and restrictions set forth \nin this Agreement do not apply to such Open Source Software.\n\nNotwithstanding the foregoing, the license granted to you in Section 1.1 does not include \nthe right to, and you will not, and you will not permit any other individual or entity to, \nmodify, combine, integrate or otherwise use the Software or your Modifications with \nOpen Source Software or any other software or materials in such a manner that requires, \nor could require, the Software or your Modifications, in whole or part, to be (a) disclosed or \ndistributed to third parties in source code form, (b) licensed to third parties for the \npurpose of making derivative works, or (c) redistributable by third parties at no charge, \nincluding under the terms of the GNU General Public License version 3, the GNU Affero General Public License\nversion 3, the GNU Lesser General Public License version 3, or any prior or successor \nversions or equivalents of the foregoing.\n\n2) FEEDBACK. To the extent you provide Gretel.ai with suggestions, proposals, ideas, \nrecommendations or other feedback relating to the Software (“Feedback”), you hereby \ngrant to Gretel.ai a non-exclusive, perpetual, irrevocable, royalty-free, fully-paid, \nsub-licensable, transferable, worldwide right and license to make, have made, use, \nsell, offer for sale, import, export, rent, lease, reproduce, distribute, publicly \ndisplay, publicly perform, modify, create derivative works of, disclose and otherwise \nexploit such Feedback in any manner without restriction (whether of confidentiality, compensation or otherwise).\n\n3) OWNERSHIP. As between you and Gretel.ai, you acknowledge and agree that Gretel.ai \nowns all right, title, and interest in and to the Software, including all intellectual \nproperty rights therein. Gretel.ai reserves all rights not expressly granted to you in \nthis Agreement, including with respect to its trademarks, service marks and brand features.\n\n4) WARRANTY DISCLAIMER. You acknowledge and agree that the Software is provided “AS IS.” \nGRETEL.AI DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY, \nFITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT, AND ANY WARRANTIES ARISING OUT OF COURSE OF DEALING \nOR USAGE OF TRADE. For the avoidance of doubt, Gretel.ai has no obligation to provide maintenance, \nsupport or any other services to you for the Software under this Agreement.\n\n5) LIMITATION ON LIABILITY. TO THE EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL GRETEL.AI\nBE LIABLE TO YOU OR TO ANY THIRD PARTY FOR DAMAGES OF ANY KIND, INCLUDING, WITHOUT LIMITATION,\nDIRECT, SPECIAL, INCIDENTAL, PUNITIVE OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, \nBUSINESS OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THIS AGREEMENT, \nWHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), \nSTRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT GRETEL.AI HAS BEEN ADVISED OF THE \nPOSSIBILITY OF SUCH LOSS OR DAMAGE. THE PARTIES HAVE AGREED THAT THESE LIMITATIONS \nWILL SURVIVE AND APPLY EVEN IF ANY LIMITED REMEDY SPECIFIED IN THIS AGREEMENT IS \nFOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE. \n  \nYou expressly acknowledge that Gretel.ai has entered into this Agreement in reliance upon the \nlimitations of liability specified herein, which allocate the risk between Gretel.ai and you,\nand form a basis of the bargain between us.\n\n6) TERM AND TERMINATION. This Agreement is effective until terminated. You may terminate this Agreement \nat any time by destroying all copies of the Software and your Modifications. \nThis Agreement will terminate immediately, without the requirement of written notice to you, \nin the event that you breach the terms of this Agreement or infringe or otherwise violate Gretel.ai’s \nintellectual property rights. Upon any termination of this Agreement, \nthe rights and licenses granted to you in this Agreement will automatically terminate \nand you will, at your expense, destroy all copies of the Software and your Modifications. \nSections 2, 3, 4, 5, 6 and 7 will survive any termination of this Agreement. \n\n7) GENERAL PROVISIONS. \n\n7a) Assignment. You may not assign this Agreement, in whole or in part, by operation of \nlaw or otherwise, without the prior written consent of Gretel.ai. Any attempted assignment \nwithout such consent will be null and void. Gretel.ai may assign this Agreement without your consent. \nSubject to the foregoing, this Agreement will bind and inure to the benefit of each \nparty's successors and permitted assigns.\n\n7b) Governing Law. This Agreement will be governed by and construed in accordance with the \nlaws of the State of California, USA (excluding its body of law controlling conflicts of law). \nThe parties expressly agree that the United Nations Convention on Contracts for the \nInternational Sale of Goods will not apply. Any legal action or proceeding arising in \nconnection with this Agreement will be brought exclusively in the federal or state courts \nlocated in the City and County of San Francisco, California and the parties hereby consent \nto the personal jurisdiction and venue therein.\n\n7c) Entire Agreement. This Agreement and the attached exhibits constitute the entire and \nexclusive agreement between the parties pertaining to the subject matter hereof, \nand supersede any and all prior agreements, communications, and understandings (both written and oral) \nregarding such subject matter. This Agreement may only be modified, and any rights under it waived, \nby a written document executed by both parties. If for any reason a court of competent \njurisdiction finds any provision of this Agreement invalid or unenforceable, that provision \nof the Agreement will be enforced to the maximum extent permissible and the other provisions \nof this Agreement will remain in full force and effect. The failure to enforce any provision \nof this Agreement will not constitute a waiver of future enforcement of that or any other provision.\n\nIf you have any questions regarding this Agreement, you may contact Gretel.ai at hi@gretel.ai."
}