{
  "key": "gtpl-v2",
  "short_name": "GTPL-v2",
  "name": "Globus Toolkit Public License (GTPL) v2",
  "category": "Permissive",
  "owner": "Globus",
  "homepage_url": "https://web.archive.org/web/20060715182344/http://www.globus.org/toolkit/legal/3.2/license-v2.html",
  "spdx_license_key": "LicenseRef-scancode-gtpl-v2",
  "ignorable_copyrights": [
    "Copyright 1999-2003 University of Chicago and The University of Southern California"
  ],
  "ignorable_holders": [
    "University of Chicago and The University of Southern California"
  ],
  "ignorable_authors": [
    "the Globus Project (http://www.globus.org/)"
  ],
  "ignorable_urls": [
    "http://www.globus.org/"
  ],
  "ignorable_emails": [
    "info@globus.org"
  ],
  "text": "Globus Toolkit Public License\nVersion 2, July 31, 2003\n\nCopyright 1999-2003 University of Chicago and The University of Southern\nCalifornia.  All rights reserved.\n\nThis software referred to as the Globus Toolkit software\n(\"Software\") includes voluntary contributions made to the Globus\nProject collaboration.  Persons and entities that have made voluntary\ncontributions are hereinafter referred to as \"Contributors.\" This Globus\nToolkit Public License is referred to herein as \"the GTPL.\"  For more\ninformation on the Globus Project, please see http://www.globus.org/.\n\nPermission is granted for the installation, use, reproduction,\nmodification, display, performance and redistribution of this Software,\nwith or without modification, in source and binary forms.  Permission is\ngranted for the installation, use, reproduction, modification, display,\nperformance and redistribution of user files, manuals, and training and\ndemonstration slides (\"Documentation\") distributed with or specifically\ndesignated as distributed under the GTPL.  Any exercise of rights under\nthe GTPL is subject to the following conditions:\n\n1.  Redistributions of this Software, with or without modification,\n    must reproduce the GTPL in: (1) the Software, or (2) the Documentation\n    or some other similar material which is provided with the Software\n    (if any).\n\n2.  The Documentation, alone or if included with a redistribution of\n    the Software, must include the following notice: \"This\n    product includes material developed by the Globus Project\n    (http://www.globus.org/).\"\n\n    Alternatively, if that is where third-party acknowledgments normally\n    appear, this acknowledgment must be reproduced in the Software itself.\n\n3.  Globus Toolkit and Globus Project are trademarks of the\n    University of Chicago.  Any trademarks of the University of\n    Chicago or the University of Southern California may not be used\n    to endorse or promote software, or products derived therefrom, and\n    except as expressly provided herein may not be affixed to modified\n    redistributions of this Software or Documentation except with prior\n    written approval, obtainable at the discretion of the trademark\n    owner from info@globus.org.\n\n4.  To the extent that patent claims licensable by the University of\n    Southern California and/or by the University of Chicago (as Operator\n    of Argonne National Laboratory) are necessarily infringed by the\n    use or sale of the Software, you and your transferees are granted\n    a non-exclusive, worldwide, royalty-free license under such patent\n    claims, with the rights to make, use, sell, offer to sell, import and\n    otherwise transfer the Software in source code and object code form.\n    This patent license shall not apply to Documentation or to any other\n    software combinations which include the Software.  No hardware per\n    se is licensed hereunder.\n\n    If you or any subsequent transferee (a \"Recipient\") institutes patent\n    litigation against any entity (including a cross-claim or counterclaim\n    in a lawsuit) alleging that the Software infringes such Recipient's\n    patent(s), then such Recipient's rights granted under the patent\n    license above shall terminate as of the date such litigation is filed.\n\n5.  DISCLAIMER \n\n    SOFTWARE AND DOCUMENTATION ARE PROVIDED BY THE COPYRIGHT HOLDERS AND\n    CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,\n    BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,\n    OF SATISFACTORY QUALITY, AND FITNESS FOR A PARTICULAR PURPOSE OR\n    USE ARE DISCLAIMED.  THE COPYRIGHT HOLDERS AND CONTRIBUTORS MAKE\n    NO REPRESENTATION THAT THE SOFTWARE, DOCUMENTATION, MODIFICATIONS,\n    ENHANCEMENTS OR DERIVATIVE WORKS THEREOF, WILL NOT INFRINGE ANY\n    PATENT, COPYRIGHT, TRADEMARK, TRADE SECRET OR OTHER PROPRIETARY RIGHT.\n\n6.  LIMITATION OF LIABILITY\n\n    THE COPYRIGHT HOLDERS AND CONTRIBUTORS SHALL HAVE NO LIABILITY TO\n    LICENSEE OR OTHER PERSONS FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL,\n    CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES OF ANY CHARACTER\n    INCLUDING, WITHOUT LIMITATION, PROCUREMENT OF SUBSTITUTE GOODS OR\n    SERVICES, LOSS OF USE, DATA OR PROFITS, OR BUSINESS INTERRUPTION,\n    HOWEVER CAUSED AND ON ANY THEORY OF CONTRACT, WARRANTY, TORT\n    (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR OTHERWISE, ARISING IN\n    ANY WAY OUT OF THE USE OF THIS SOFTWARE OR DOCUMENTATION, EVEN IF\n    ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7.  The Globus Project may publish revised and/or new versions of\n    the GTPL from time to time.  Each version will be given a\n    distinguishing version number.  Once Software or Documentation\n    has been published under a particular version of the GTPL, you may\n    always continue to use it under the terms of that version. You may\n    also choose to use such Software or Documentation under the terms of\n    any subsequent version of the GTPL published by the Globus Project.\n    No one other than the Globus Project has the right to modify the\n    terms of the GTPL.\n\nGlobus Toolkit Public License 7-31-03"
}