{
  "key": "gtpl-v1",
  "short_name": "GTPL-v1",
  "name": "Globus Toolkit Public License (GTPL) v1",
  "category": "Permissive",
  "owner": "Globus",
  "homepage_url": "https://web.archive.org/web/20021213102637/http://www.globus.org/toolkit/license.html",
  "spdx_license_key": "LicenseRef-scancode-gtpl-v1",
  "ignorable_copyrights": [
    "Copyright (c) 1999 University of Chicago and The University of Southern California"
  ],
  "ignorable_holders": [
    "University of Chicago and The University of Southern California"
  ],
  "ignorable_authors": [
    "and/or derived from the Globus Project (http://www.globus.org/)",
    "and/or derived from the Globus project (http://www.globus.org/)"
  ],
  "ignorable_urls": [
    "http://www.globus.org/"
  ],
  "text": "Globus Toolkit Public License (GTPL)\nCopyright (c) 1999 University of Chicago and The University of \nSouthern California. All Rights Reserved.\n\n 1) The \"Software\", below, refers to the Globus Toolkit (in either\n    source-code, or binary form and accompanying documentation) and a\n    \"work based on the Software\" means a work based on either the\n    Software, on part of the Software, or on any derivative work of\n    the Software under copyright law: that is, a work containing all\n    or a portion of the Software either verbatim or with\n    modifications.  Each licensee is addressed as \"you\" or \"Licensee.\"\n\n 2) The University of Southern California and the University of\n    Chicago as Operator of Argonne National Laboratory are copyright\n    holders in the Software.  The copyright holders and their third\n    party licensors hereby grant Licensee a royalty-free nonexclusive\n    license, subject to the limitations stated herein and\n    U.S. Government license rights.\n\n 3) A copy or copies of the Software may be given to others, if you\n    meet the following conditions:\n\n    a) Copies in source code must include the copyright notice and\n       this license.\n\n    b) Copies in binary form must include the copyright notice and\n       this license in the documentation and/or other materials\n       provided with the copy.\n\n 4) All advertising materials, journal articles and documentation\n    mentioning features derived from or use of the Software must\n    display the following acknowledgement:\n\n    \"This product includes software developed by and/or derived from\n    the Globus project (http://www.globus.org/).\"\n\n    In the event that the product being advertised includes an intact\n    Globus distribution (with copyright and license included) then\n    this clause is waived.\n\n 5) You are encouraged to package modifications to the Software\n    separately, as patches to the Software.\n\n 6) You may make modifications to the Software, however, if you\n    modify a copy or copies of the Software or any portion of it,\n    thus forming a work based on the Software, and give a copy or\n    copies of such work to others, either in source code or binary\n    form, you must meet the following conditions:\n\n    a) The Software must carry prominent notices stating that you\n       changed specified portions of the Software.\n\n    b) The Software must display the following acknowledgement:\n\n       \"This product includes software developed by and/or derived\n        from the Globus Project (http://www.globus.org/) to which the\n        U.S. Government retains certain rights.\"\n\n 7) You may incorporate the Software or a modified version of the\n    Software into a commercial product, if you meet the following\n    conditions:\n\n    a) The commercial product or accompanying documentation must\n       display the following acknowledgment:\n\n       \"This product includes software developed by and/or derived\n        from the Globus Project (http://www.globus.org/) to which the\n        U.S. Government retains a paid-up, nonexclusive, irrevocable\n        worldwide license to reproduce, prepare derivative works, and\n        perform publicly and display publicly.\"\n\n    b) The user of the commercial product must be given the following\n       notice:\n\n       \"[Commercial product] was prepared, in part, as an account of\n        work sponsored by an agency of the United States Government.\n        Neither the United States, nor the University of Chicago, nor\n        University of Southern California, nor any contributors to\n        the Globus Project or Globus Toolkit nor any of their employees,\n        makes any warranty express or implied, or assumes any legal\n        liability or responsibility for the accuracy, completeness, or\n        usefulness of any information, apparatus, product, or process\n        disclosed, or represents that its use would not infringe\n        privately owned rights.\n\n        IN NO EVENT WILL THE UNITED STATES, THE UNIVERSITY OF CHICAGO\n        OR THE UNIVERSITY OF SOUTHERN CALIFORNIA OR ANY CONTRIBUTORS\n        TO THE GLOBUS PROJECT OR GLOBUS TOOLKIT BE LIABLE FOR ANY\n        DAMAGES, INCLUDING DIRECT, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL\n        DAMAGES RESULTING FROM EXERCISE OF THIS LICENSE AGREEMENT OR\n        THE USE OF THE [COMMERCIAL PRODUCT].\"\n\n 8) LICENSEE AGREES THAT THE EXPORT OF GOODS AND/OR TECHNICAL DATA\n    FROM THE UNITED STATES MAY REQUIRE SOME FORM OF EXPORT CONTROL\n    LICENSE FROM THE U.S. GOVERNMENT AND THAT FAILURE TO OBTAIN SUCH\n    EXPORT CONTROL LICENSE MAY RESULT IN CRIMINAL LIABILITY UNDER U.S.\n    LAWS.\n\n 9) Portions of the Software resulted from work developed under a\n    U.S. Government contract and are subject to the following license:\n    the Government is granted for itself and others acting on its\n    behalf a paid-up, nonexclusive, irrevocable worldwide license in\n    this computer software to reproduce, prepare derivative works, and\n    perform publicly and display publicly.\n\n10) The Software was prepared, in part, as an account of work\n    sponsored by an agency of the United States Government.  Neither\n    the United States, nor the University of Chicago, nor The\n    University of Southern California, nor any contributors to the\n    Globus Project or Globus Toolkit, nor any of their employees,\n    makes any warranty express or implied, or assumes any legal\n    liability or responsibility for the accuracy, completeness, or\n    usefulness of any information, apparatus, product, or process\n    disclosed, or represents that its use would not infringe privately\n    owned rights.\n\n11) IN NO EVENT WILL THE UNITED STATES, THE UNIVERSITY OF CHICAGO OR\n    THE UNIVERSITY OF SOUTHERN CALIFORNIA OR ANY CONTRIBUTORS TO THE\n    GLOBUS PROJECT OR GLOBUS TOOLKIT BE LIABLE FOR ANY DAMAGES,\n    INCLUDING DIRECT, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES\n    RESULTING FROM EXERCISE OF THIS LICENSE AGREEMENT OR THE USE OF\n    THE SOFTWARE.\n\n                              END OF LICENSE"
}