{
  "key": "hauppauge-firmware-eula",
  "short_name": "Hauppauge Firmware EULA",
  "name": "Hauppauge Firmware EULA",
  "category": "Proprietary Free",
  "owner": "Hauppauge",
  "homepage_url": "https://lists.debian.org/debian-devel/2007/02/msg00498.html",
  "spdx_license_key": "LicenseRef-scancode-hauppauge-firmware-eula",
  "text": "END-USER FIRMWARE LICENSE AGREEMENT (this license).\n\nLICENSE. You may copy and use the Firmware, subject to these conditions:\n\n1. This Firmware is licensed for use only in conjunction with\n   Hauppauge component products. Use of the Firmware in conjunction\n   with non-Hauppauge component products is not licensed hereunder.\n\n2. You may not copy, modify, rent, sell, distribute or transfer any\n   part of the Firmware except as provided in this Agreement, and you\n   agree to prevent unauthorized copying of the Firmware.\n\n3. You may not reverse engineer, decompile, or disassemble the Firmware.\n\n4. You may not sublicense the Firmware.\n\n5. The Firmware may contain the firmware or other property of third party\n   suppliers.\n\nTRADEMARKS. Except as expressly provided herein, you shall not use\nHauppauge's name in any publications, advertisements, or other\nannouncements without Hauppauge's prior written consent. You do not\nhave any rights to use any Hauppauge trademarks or logos.\n\nOWNERSHIP OF FIRMWARE AND COPYRIGHTS. Title to all copies of the\nFirmware remains with Hauppauge or its suppliers. The Firmware is\ncopyrighted and protected by the laws of the United States and other\ncountries, and international treaty provisions. You may not remove any\ncopyright notices from the Firmware. Hauppauge may make changes to the\nFirmware, or items referenced therein, at any time without notice, but\nis not obligated to support or update the Firmware. Except as\notherwise expressly provided, Hauppauge grants no express or implied\nright under Hauppauge patents, copyrights, trademarks, or other\nintellectual property rights. You may transfer the Firmware only if a\ncopy of this license accompanies the Firmware and the recipient agrees\nto be fully bound by these terms.\n\nEXCLUSION OF WARRANTIES.\nTHE FIRMWARE IS PROVIDED \"AS IS\" AND POSSIBLY WITH FAULTS. UNLESS\nEXPRESSLY AGREED OTHERWISE, HAUPPAUGE AND ITS SUPPLIERS AND LICENSORS\nDISCLAIM ANY AND ALL WARRANTIES AND GUARANTEES, EXPRESS, IMPLIED OR\nOTHERWISE, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, NONINFRINGEMENT, OR FITNESS FOR A PARTICULAR PURPOSE.\nHauppauge does not warrant or assume responsibility for the accuracy\nor completeness of any information, text, graphics, links or other\nitems contained within the Firmware. You assume all liability,\nfinancial or otherwise, associated with Your use or disposition of the\nFirmware.\n\nLIMITATION OF LIABILITY. IN NO EVENT SHALL HAUPPAUGE OR ITS SUPPLIERS\nAND LICENSORS BE LIABLE FOR ANY DAMAGES WHATSOEVER FROM ANY CAUSE OF\nACTION OF ANY KIND (INCLUDING, WITHOUT LIMITATION, LOST PROFITS,\nBUSINESS INTERRUPTION, OR LOST INFORMATION) ARISING OUT OF THE USE,\nMODIFICATION, OR INABILITY TO USE THE FIRMWARE, OR OTHERWISE, NOR FOR\nPUNITIVE, INCIDENTAL, CONSEQUENTIAL, OR SPECIAL DAMAGES OF ANY KIND,\nEVEN IF HAUPPAUGE OR ITS SUPPLIERS AND LICENSORS HAVE BEEN ADVISED OF\nTHE POSSIBILITY OF SUCH DAMAGES. SOME JURISDICTIONS PROHIBIT EXCLUSION\nOR LIMITATION OF LIABILITY FOR IMPLIED WARRANTIES OR CONSEQUENTIAL OR\nINCIDENTAL DAMAGES, SO CERTAIN LIMITATIONS MAY NOT APPLY. YOU MAY ALSO\nHAVE OTHER LEGAL RIGHTS THAT VARY BETWEEN JURISDICTIONS.\n\nWAIVER AND AMENDMENT. No modification, amendment or waiver of any\nprovision of this Agreement shall be effective unless in writing and\nsigned by an officer of Hauppauge. No failure or delay in exercising\nany right, power, or remedy under this Agreement shall operate as a\nwaiver of any such right, power or remedy. Without limiting the\nforegoing, terms and conditions on any purchase orders or similar\nmaterials submitted by you to Hauppauge, and any terms contained in\nHauppauges standard acknowledgment form that are in conflict with\nthese terms, shall be of no force or effect.\n\nSEVERABILITY. If any provision of this Agreement is held by a court of\ncompetent jurisdiction to be contrary to law, such provision shall be\nchanged and interpreted so as to best accomplish the objectives of the\noriginal provision to the fullest extent allowed by law and the\nremaining provisions of this Agreement shall remain in full force and\neffect.\n\nEXPORT RESTRICTIONS. Each party acknowledges that the Firmware is\nsubject to applicable import and export regulations of the United\nStates and of the countries in which each party transacts business,\nspecifically including U.S. Export Administration Act and Export\nAdministration Regulations. Each party shall comply with such laws and\nregulations, as well as all other laws and regulations applicable to\nthe Firmware. Without limiting the generality of the foregoing, each\nparty agrees that it will not export, re-export, transfer or divert\nany of the Firmware or the direct programs thereof to any restricted\nplace or party in accordance with U.S. export regulations. Note that\nFirmware containing encryption may be subject to additional\nrestrictions.\n\nAPPLICABLE LAWS. Claims arising under this Agreement shall be governed\nby the laws of New York, excluding its principles of conflict of laws\nand the United Nations Convention on Contracts for the Sale of\nGoods. You may not export the Firmware in violation of applicable\nexport laws and regulations. Hauppauge is not obligated under any\nother agreements unless they are in writing and signed by an\nauthorized representative of Hauppauge.\n\nGOVERNMENT RESTRICTED RIGHTS. The Firmware is provided with\n\"RESTRICTED RIGHTS.\" Use, duplication, or disclosure by the Government\nis subject to restrictions as set forth in FAR52.227-14 and\nDFAR252.227-7013 et seq. or their successors. Use of the Firmware by\nthe Government constitutes acknowledgment of Hauppauge's proprietary\nrights therein. Contractor or Manufacturer is Hauppauge Computer\nWorks, Inc.  91 Cabot Court Hauppauge, NY 11788\n\nTERMINATION OF THIS AGREEMENT. Hauppauge may terminate this Agreement\nat any time if you violate its terms. Upon termination, you will\nimmediately destroy the Firmware or return all copies of the Firmware\nto Hauppauge."
}