{
  "key": "hessla",
  "short_name": "HESSLA",
  "name": "Hacktivismo Enhanced-Source Software License Agreement",
  "category": "Proprietary Free",
  "owner": "Hacktivismo",
  "homepage_url": "http://www.hacktivismo.com/about/hessla.php",
  "spdx_license_key": "LicenseRef-scancode-hessla",
  "text_urls": [
    "https://directory.fsf.org/wiki/License:HESSLA"
  ],
  "text": "TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION, USE AND/OR MODIFICATION\n\n0. DEFINITIONS. The following are defined terms that, whenever used in\nthis License Agreement, have the following meanings:\n\n0.1 Author: \"Author\" shall mean the copyright holder of an Original\nWork (the \"Program\") released by the Author under this License\nAgreement.\n\n0.2 Copy: \"Copy\" shall mean everything and anything that constitutes a\ncopy according to copyright law, without limitation. A \"copy\" does not\nbecome anything other than a \"copy\" merely because, for example, a\ngovernmental or institutional employee duplicates the Program or a\npart of it for another employee of the same institution or\nGovernmental Entity, or merely because it is copied from one computer\nto another, or from one medium to another, or multiple copies are made\non the same medium, within the same institutional or Governmental\nEntity.\n\n0.3 Derivative Work: A \"Derivative Work\" or \"work based on the\nProgram\" shall mean either the Program itself or any work containing\nthe Program or a portion of it, either verbatim or with modifications\nand/or translated into another language. (Hereinafter, translation is\nincluded without limitation in the term \"modification.\"). In the\nunlikely event that, and to the extent that, this contractual\ndefinition of \"Derivative Work\" is later determined by any tribunal or\ndispute-resolution body to be different is scope from the meaning of\n\"derivative work\" under the copyright law of any country, then the\nbroadest and most encompassing possible definition either the\ncontractual definition of \"Derivative Work,\" or any broader and more\nencompassing statutory or legal definition, shall control. Acceptance\nof this contractually-defined scope of the term \"Derivative Work\" is a\nmandatory pre-condition for You to receive any of the benefits offered\nby this License Agreement.\n\n0.3.1 Mere aggregation of another work not based on the Program with\nthe Program (or with a Derivative Work based on the Program) on a\nvolume of a storage or distribution medium does not bring the other\nwork under the scope of this License Agreement.\n\n0.4 License Agreement: When used in this License Agreement, the terms\n\"this License\" or \"this License Agreement\" shall mean The Hactivismo\nEnhanced-Source Software License Agreement, v. 0.1, or any subsequent\nversion made applicable under the terms of Section 15.\n\n0.5 Licensee: The term \"Licensee\" shall mean You or any other\nLicensee, whether or not a Qualified Licensee.\n\n0.6 Original Work: \"Original Work\" shall mean a Program or other work\nof authorship, or portion thereof, that is not a Derivative Work.\n\n0.7 Program: The \"Program,\" to which this License Agreement applies,\nis the Original Work (including, but not limited to, computer\nsoftware) released by the Author under this License Agreement.\n\n0.8 Qualified Licensee: A \"Qualified Licensee\" means a Licensee that\nremains in full compliance with all terms and conditions of this\nLicense Agreement. You are no longer a Qualified Licensee if, at any\ntime, You violate any terms of this License Agreement. Neither the\nProgram nor any Software based on the Program may be copied,\ndistributed, performed, displayed, used or modified by You, even for\nYour own purposes, unless You are a Qualified Licensee. A Licensee\nother than a Qualified Licensee remains subject to all terms and\nconditions of this License Agreement, and to all remedies for each\ncumulative violation as set forth herein. Loss of the status of\nQualified Licensee signifies that violation of any terms of the\nLicense Agreement subjects a Licensee to loss of most of the benefits\nthat Qualified Licensees enjoy under this License Agreement, and to\nadditional remedies for all violations occurring after the first\nviolation.\n\n0.9 Software: \"Software\" or \"the Software\" shall mean the Program, any\nDerivative Work based on the Program or a portion thereof, and/or any\nmodified version of the Program or portion thereof, without\nlimitation.\n\n0.10 Source Code: The term \"Source Code\" shall mean the preferred form\nof a Program or Original Work for making modifications to it and all\navailable documentation describing how to access and modify that\nProgram or Original Work.\n\n0.10.1 For an executable work, complete Source Code means all the\nSource Code for all modules it contains, plus any associated interface\ndefinition files, plus the scripts used to control compilation and\ninstallation of the executable. However, as a special exception, the\nSource Code distributed need not include anything that is normally\ndistributed (in either source or binary form) with the major\ncomponents (compiler, kernel, and so on) of the operating system on\nwhich the executable runs, unless that component itself accompanies\nthe executable.\n\n0.10.2 \"Object Code:\" Because of certain peculiarities of current\nexport-control rules, \"object code\" of the Program, or any modified\nversion of the Program, or Derivative Work based on the Program, must\nnot be exported except by way of distribution that is ancillary to the\ndistribution of the Source Code. The \"Source Code\" shall be understood\nas the primary content transferred or exported by You, and the \"object\ncode\" shall be considered as merely an ancillary component of any such\nexport distribution.\n\n0.11 Strong Cryptography: \"Strong Cryptography\" shall mean\ncryptography no less secure than (for example, and without limitation)\na 2048-bit minimum key size for RSA encryption, 1024-bit minimum key\nsize for Diffie-Hellman (El Gamal), or a 256-bit minimum key size for\nAES and similar symmetric ciphers.\n\n0.12 Substandard Key-Selection Technique: The term \"Substandard\nKey-Selection Technique\" shall mean a method or technique to cause\nencryption keys to be more easily guessed or less secure, such as by\n(i) causing the selection of keys to be less than random, or (ii)\nemploying a selection process that selects among only a subset of\npossible keys, instead of from among the largest set of possible keys\nthat can securely be used consistent with contemporary knowledge about\nthe cryptographic techniques employed by You. The following\nillustrations elaborate on the foregoing definition:\n\n0.12.1 If the key-generation or key-selection technique for the\nencryption algorithm You employ involves the selection of one or more\nprime numbers, or involves one or more mathematical functions or\nconcatenations performed on one or more prime numbers, then each prime\nnumber should be selected from a very large set of candidate prime\nnumbers, but not necessarily from the set of all possible prime\nnumbers (e.g., inclusion of the number 1 in the candidate set, for\nexample, may in some instances reduce rather than enhance security),\nand absolutely not from any artificially small set of candidate primes\nthat makes the guessing of a key easier than would be the case if a\nsecure key-generation technique were employed. In all instances, the\nprimes should be selected at random from among the candidate set. If\nthere is a customary industry standard for maximizing the security\nassociated with the key-generation or key-selection technique for the\ncryptosystem You select, then (with attention also to the requirements\nof Section 0.11), You should employ a key-generation or selection\ntechnique no less secure than the customary industry standard for\nsecure use of the cryptosystem.\n\n0.12.2 If the key-generation or key-selection technique for the\nencryption algorithm You employ involves the selection of a random\ninteger, or the transformation of a random integer through one or more\nmathematical processes, then the selection of the integer shall be at\nrandom from the largest possible set of all possible integers\nconsistent with the secure functioning of the encryption algorithm. It\nshall not be selected from an artificially small set of integers\n(e.g., if a 256-bit random integer serves as the key, then You could\nnot set 200 of the 256 bits as \"0,\" and randomly generate only the\nremaining 56 bits producing effectively a 56-bit keylength instead of\nusing the full 256 bits).\n\n0.12.3 In other words, Your key-generation technique must promote\nsecurity to the maximum extent permitted by the cryptographic\nmethod(s) and keylength You elect to employ, rather than facilitating\neavesdropping or surveillance in any way. The example of GSM\ntelephones, in which 16 of 56 bits in each encryption key were set at\n\"0,\" thereby reducing the security of the system by a factor of\n65,536, is particularly salient. Such artificial techniques to reduce\nthe security of a cryptosystem by selecting keys from only a\nless-secure or suboptimal subset of possible keys, is prohibited and\nwill violate this License Agreement if any such technique is employed\nin any Software.\n\n0.13 You: Each Licensee (including, without limitation, Licensees that\nhave violated the License Agreement and who are no longer Qualified\nLicensees, but who nevertheless remain subject to all requirements of\nthis License Agreement and to all cumulative remedies for each\nsuccessive violation), is referred to as \"You.\"\n\n0.13.1 Governmental Entity: \"You\" explicitly includes any and all\n\"Governmental Entities,\" without limitation. \"Governmental Entity\" or\n\"Governmental Entities,\" when used in this License Agreement, shall\nmean national governments, sub-national governments (for example, and\nwithout limitation, provincial, state, regional, local and municipal\ngovernments, autonomous governing units, special districts, and other\nsuch entities), governmental subunits (without limitation,\ngovernmental agencies, offices, departments, government corporations,\nand the like), supra-national governmental entities such as the\nEuropean Union, and entities through which one or more governments\nperform governmental functions or exercise governmental power in\ncoordination, cooperation or unison.\n\n0.13.2 Governmental Person: \"You\" also explicitly includes\n\"Governmental Persons.\" The terms \"Governmental Person\" or\n\"Governmental Persons,\" when used in this License Agreement, shall\nmean the officials, officers, employees, representatives, contractors\nand agents of any Governmental Entity.\n\n1. Application of License Agreement. This License Agreement applies to\nany Program or other Original Work of authorship that contains a\nnotice placed by the Author saying it may be distributed under the\nterms of this License Agreement. The preferred manner of placing such\na notice is to include the following statement immediately after the\ncopyright notice for such an Original Work:\n\n    \"Licensed under the Hacktivismo Enhanced-Source Software License\n    Agreement, Version 0.1\"\n\n2. Means of Acceptance Use, Copying, Distribution or Modification By\nAnyone Constitutes Acceptance. Subject to Section 14.1 (concerning the\nspecial case of certain Governmental Entities) any copying,\nmodification, distribution, or use by You of the Program or any\nSoftware, shall constitute Your acceptance of all terms and conditions\nof this License Agreement.\n\n2.1 As a Licensee, You may not authorize, permit, or enable any person\nto use the Program or any Software or Derivative Work based on it\n(including any use of Your copy or copies of the Program) unless such\nperson has accepted this License Agreement and has become a Licensee\nsubject to all its terms and conditions.\n\n2.2 You may not make any copy for Your own use unless You have\naccepted this License Agreement and subjected yourself to all its\nterms and conditions.\n\n2.3 You may not make a copy for the use of any other person, or\ntransfer a copy to any other person, unless such person is a Licensee\nthat has accepted this License Agreement and such person is subject to\nall terms and conditions of this License Agreement.\n\n2.4 It is not the position of Hacktivismo that copyright law confers\nan exclusive right to use, as opposed to the exclusive right to copy\nthe Software. However, for purposes of contract law, any use of the\nSoftware shall be considered to constitute acceptance of this License\nAgreement. Moreover, all copying is prohibited unless the recipient of\na copy has accepted the License Agreement. Because each such recipient\nLicensee is contractually obligated not to permit anyone to access,\nuse, or secure a copy of the Software, without first accepting the\nterms and conditions of this License Agreement, use by non-Licensees\nis effectively prohibited contractually because nobody can obtain a\ncopy of, or access to a copy of, any Software without (1) accepting\nthe License Agreement through use, and (2) triggering some Licensee's\nobligation to require acceptance as a precondition of copying or\naccess.\n\n3. \"Qualified Licensee\" Requirement: Neither the Program nor any\nSoftware or Derivative Work based on the Program may be copied,\ndistributed, displayed, performed, used or modified by You, even for\nYour own purposes, unless You are a \"Qualified Licensee.\" To remain a\nQualified Licensee, You must remain in full compliance with all terms\nand conditions of this License Agreement.\n\n4. License Agreement Is Exclusive Source of All Your Rights:\n\n4.1 You may not copy, modify, or distribute the Program, or obtain any\ncopy, except as expressly provided under this License Agreement. Any\nattempt otherwise to copy, modify, obtain a copy, sublicense or\ndistribute the Program is void, and will automatically terminate Your\nrights under this License Agreement and subject You to all cumulative\nremedies for each successive violation that may be available to the\nAuthor. However, Qualified Licensees who have received copies from You\n(and thereby have received rights from the Author) under this License\nAgreement, and who would otherwise qualify as Qualified Licensees,\nwill not have their rights under their License Agreements suspended or\nrestricted on account of anything You do, so long as such parties\nremain in full compliance.\n\n4.2 You are not required to accept this License Agreement and prior to\nthe time You elect to become a Licensee and accept this License\nAgreement, You may always elect instead not to copy, use, modify,\ndistribute, compile, or perform the Program or any Software released\nunder this License Agreement. However, nothing else grants You\npermission to copy, to obtain or possess a copy, to compile a copy in\nobject code or executable code from a copy in source code, to modify,\nor to distribute the Program or any Software based on the\nProgram. These actions are prohibited by law if You do not accept this\nLicense Agreement. Additionally, as set forth in Section 2, any use,\ncopying or modification of the Software constitutes acceptance of this\nLicense Agreement by You.\n\n4.3 Each time You redistribute the Program (or any Software or\nDerivative Work based on the Program), the recipient automatically\nreceives a License Agreement from the Author to copy, distribute,\nmodify, perform or display the Software, subject to the terms and\nconditions of this License Agreement. You may not impose any further\nrestrictions on the recipients' exercise of the rights granted\nherein. You are not responsible for enforcing compliance by third\nparties to this License Agreement. Enforcement is the responsibility\nof the Author.\n\n5. Grant of Source Code License.\n\n5.1 Source Code Always Available from Author: Author hereby promises\nand agrees except to the extent prohibited by export-control law to\nprovide a machine-readable copy of the Source Code of the Program at\nthe request of any Licensee. Author reserves the right to satisfy this\nobligation by placing a machine-readable copy of the Source Code of\nthe most current version of the Program in an information repository\nreasonably calculated to permit inexpensive and convenient access by\nYou for so long as Author continues to distribute the Program, and by\npublishing the address of that information repository in a notice\nimmediately following the copyright notice that applies to the\nProgram. Every copy of the Program distributed by Hacktivismo (but not\nnecessarily every other Author) consists of the Source Code\naccompanied, in some instances, by an ancillary distribution of\ncompiled Object Code, but the continued availability of the Source\nCode from the Author addresses the possibility that You might have\n(for any reason) not received from someone else a complete, current,\ncopy of the Source Code (lack of which would, for example, prevent You\nfrom exporting copies to others without violating this license, see\nSection 8).\n\n5.2 Grant of License. If and only if, and for so long as You remain a\nQualified Licensee, in accordance with Section 3 of this License\nAgreement, Author hereby grants You a world-wide, royalty-free,\nnon-exclusive, non-sublicensable copyright license to do the\nfollowing:\n\n5.2.1 to reproduce the Source Code of the Program in copies;\n\n5.2.2 to prepare Derivative Works based upon the Program and to edit\nor modify the Source Code in the process of preparing such Derivative\nWorks;\n\n5.2.3 to distribute copies of the Source Code of the Original Work\nand/or of Derivative Works to others, with the proviso that copies of\nOriginal Work or Derivative Works that You distribute shall be\nlicensed under this License Agreement, and that You shall fully inform\nall recipients of the terms of this License Agreement.\n\n6. Grant of Copyright License. If and only if, and for so long as You\nremain a Qualified Licensee, in accordance with Section 3 of this\nLicense Agreement, Author hereby grants You a world-wide,\nroyalty-free, non-exclusive, non-sublicensable license to do the\nfollowing:\n\n6.1 to reproduce the Program in copies;\n\n6.2 to prepare Derivative Works based upon the Program, or upon\nSoftware that itself is based on the Program;\n\n6.3 to distribute (either by distributing the Source Code, or by\ndistributing compiled Object Code, but any export of Object Code must\nbe ancillary to a distribution of Source Code) copies of the Program\nand Derivative Works to others, with the proviso that copies of the\nProgram or Derivative Works that You distribute shall be licensed\nunder this License Agreement, that You shall fully inform all\nrecipients of the terms of this License Agreement;\n\n6.4 to perform the Program or a Derivative Work publicly;\n\n6.5 to display the Program or a Derivative Work publicly; and\n\n6.6 to charge a fee for the physical act of transferring a copy of the\nProgram (You may also, at Your option, offer warranty protection in\nexchange for a fee).\n\n7. Grant of Patent License. If and only if, and for so long as You\nremain a Qualified Licensee, in accordance with Section 3 of this\nLicense Agreement, Author hereby grants You a world-wide,\nroyalty-free, non-exclusive, non-sublicensable license Agreement,\nunder patent claims owned or controlled by the Author that are\nembodied in the Program as furnished by the Author (\"Licensed Claims\")\nto make, use, sell and offer for sale the Program. Subject to the\nproviso that You grant all Licensees a world-wide, non-exclusive,\nroyalty-free license under any patent claims embodied in any\nDerivative Work furnished by You, Author hereby grants You a\nworld-wide, royalty-free, non-exclusive, non-sublicensable license\nunder the Licensed Claims to make, use, sell and offer for sale\nDerivative Works.\n\n8. Exclusions From License Agreement Grants. Nothing in this License\nAgreement shall be deemed to grant any rights to trademarks,\ncopyrights, patents, trade secrets or any other intellectual property\nof Licensor except as expressly stated herein. No patent license is\ngranted to make, use, sell or offer to sell embodiments of any patent\nclaims other than the Licensed Claims defined in Section 7. No right\nis granted to the trademarks of Author even if such marks are included\nin the Program. Nothing in this License Agreement shall be interpreted\nto prohibit Author from licensing under additional or different terms\nfrom this License Agreement any Original Work, Program, or Derivative\nWork that Author otherwise would have a right to License.\n\n8.1 Implied Endorsements Prohibited. Neither the name of the Author\n(in the case of Programs and Original Works released by Hacktivismo,\nthe name \"Hacktivismo\"), nor the names of contributors who helped\nproduce the Program may be used to endorse or promote modifications of\nthe Program, any Derivative Work, or any Software other than the\nProgram, without specific prior written permission of the\nAuthor. Neither the name of Hacktivismo nor the names of any\ncontributors who helped write the Program may be used to endorse or\npromote any Program or Software released under this License Agreement\nby any person other than Hacktivismo.\n\n9. Modifications and Derivative Works. Only Qualified Licensees may\nmodify the Software or prepare or distribute Derivative Works. If You\nare a Qualified Licensee, Your authorization to modify the Software or\nprepare or distribute Derivative Works (including permission to\nprepare and/or distribute Derivative Works, as provided in Sections\n5.2.2, 5.2.3, 6.2, 6.3, and 6.6) is subject to each and all of the\nfollowing mandatory terms and conditions (9.1 through 9.6, inclusive):\n\n9.1 You must cause the modified files to carry prominent notices\nstating that You changed the files and the date of any change;\n\n9.2 If the modified Software normally reads commands interactively\nwhen run, You must cause it, when started running for such interactive\nuse in the most ordinary way, to print or display an announcement\nincluding an appropriate copyright notice and a notice that there is\nno warranty (or else, saying that You provide a warranty) and that\nusers may redistribute the program under this License Agreement, and\ntelling the user how to view a copy of this License\nAgreement. (Exception: if the Program itself is interactive but does\nnot normally print such an announcement, Your Derivative Work based on\nthe Program is not required to print an announcement.);\n\n9.3 Any Program, Software, or modification thereof copied or\ndistributed by You, that incorporates any portion of the Original\nWork, must not contain any code or functionality that subverts the\nsecurity of the Software or the end-user's expectations of privacy,\nanonymity, confidentiality, authenticity, and trust, including\n(without limitation) any code or functionality that introduces any\n\"backdoor,\" escrow mechanism, \"spy-ware,\" or surveillance techniques\nor methods into any such Program, Software, or modification thereof;\n\n9.4 Any Program, Software, or modification thereof copied or\ndistributed by You, that employs any cryptographic or other security,\nprivacy, confidentiality, authenticity, and/or trust methods or\ntechniques, including without limitation any Derivative Work that\nincludes any changes or modifications to any cryptographic techniques\nin the Program, shall employ Strong Cryptography.\n\n9.5 Any Program, Software, or modification thereof copied or\ndistributed by You, if it contains any key-generation or selection\ntechnique, must not employ any Substandard Key-Selection Technique.\n\n9.6 No Program or Software copied or distributed by You may transmit\nor communicate any symmetric key, any \"private key\" if an asymmetric\ncryptosystem is employed, or any part of such key, nor may it\notherwise make any such key or part of such key known, to any person\nother than the end-user who generated the key, without the active\nconsent and participation of that individual end-user. If a private or\nsymmetric key is stored or recorded in any manner, it must not be\nstored or recorded in plaintext, and it must be protected from reading\n(at a minimum) by use of a password. Use of steganography or other\ntechniques to disguise the fact that a private or symmetric key is\neven stored is strongly encouraged, but not absolutely required.\n\n10. Use Restrictions: Human Rights Violations Prohibited.\n\n10.1 Neither the Program, nor any Software or Derivative Work based on\nthe Program may used by You for any of the following purposes (10.1.1\nthrough 10.1.5, inclusive):\n\n10.1.1 to violate or infringe any human rights or to deprive any\nperson of human rights, including, without limitation, rights of\nprivacy, security, collective action, expression, political freedom,\ndue process of law, and individual conscience;\n\n10.1.2 to gather evidence against any person to be used to deprive any\nperson of human rights;\n\n10.1.3 any other use as a part of any project or activity to deprive\nany person of human rights, including not only the above-listed\nrights, but also rights of physical security, liberty from physical\nrestraint or incarceration, freedom from slavery, freedom from\ntorture, freedom to take part in government, either directly or\nthrough lawfully elected representatives, and/or freedom from\nself-incrimination;\n\n10.1.4 any surveillance, espionage, or monitoring of individuals,\nwhether done by a Governmental Entity, a Governmental Person, or by\nany non-governmental person or entity;\n\n10.1.5 censorship or \"filtering\" of any published information or expression.\n\n10.2 Additionally, the Program, any modification of it, or any\nSoftware or Derivative Work based on the Program may not be used by\nany Governmental Entity or other institution that has any policy or\npractice (whether official or unofficial) of violating the human\nrights of any persons.\n\n10.3 You may not authorize, permit, or enable any person (including,\nwithout limitation, any Governmental Entity or Governmental Person) to\nuse the Program or any Software or Derivative Work based on it\n(including any use of Your copy or copies of the Program) unless such\nperson has accepted this License Agreement and has become a Licensee\nsubject to all its terms and conditions, including (without\nlimitation) the use restrictions embodied in Section 10.1 and 10.2,\ninclusive.\n\n11. All Export Distributions Must Consist of or Be Ancillary to\nDistribution of Source Code. Because of certain peculiarities of\ncurrent export-control law, any distribution by You of the Program or\nany Software may be in the form of Source Code only, or in the form or\nSource Code accompanied by compiled Object Code, but You may not\nexport any Software in the form of compiled Object Code only. Such an\nexport distribution of compiled executable code must in all cases be\nancillary to a distribution of the complete corresponding\nmachine-readable source code, which must be distributed on a medium,\nor by a method, customarily used for software interchange.\n\n12. EXPORT LAWS: THIS LICENSE AGREEMENT ADDS NO RESTRICTIONS TO THE\nEXPORT LAWS OF YOUR JURISDICTION. It is Your responsibility to comply\nwith any export regulations applicable in Your jurisdiction. From the\nUnited States, Canada, or many countries in Europe, export or\ntransmission of this Software to certain embargoed destinations\n(including, but not necessarily limited to, Cuba, Iran, Iraq, Libya,\nNorth Korea, Sudan, and Syria), may be prohibited. If Hacktivismo is\nidentified as the Author of the Program (and it is not the property of\nsome other Author), then export to any national of Cuba, Iran, Iraq,\nLibya, North Korea, Sudan or Syria, or into the territory of any of\nthese countries, by any Licensee who has received this Software\ndirectly from Hacktivismo or from the Cult of the Dead Cow, or any of\ntheir members, is contractually prohibited and will constitute a\nviolation of this License Agreement. You are advised to consult the\ncurrent laws of any and all countries whose laws may apply to You,\nbefore exporting this Software to any destination. Special care should\nbe taken to avoid export to any embargoed destination. An Author other\nthan Hacktivismo may substitute that Author's legal name for\n\"Hacktivismo\" in this Paragraph, in relation to any Program released\nby that Author under this Paragraph.\n\n13. Contrary Judgments, Settlements and Court Orders. If, as a\nconsequence of a court judgment or allegation of patent infringement\nor for any other reason (not limited to patent issues), conditions are\nimposed on You (whether by court order, agreement or otherwise) that\ncontradict the conditions of this License Agreement, they do not\nexcuse You from the conditions of this License Agreement. If You\ncannot distribute so as to satisfy simultaneously Your obligations\nunder this License Agreement and any other pertinent obligations, then\nas a consequence You may not distribute the Software at all. For\nexample, if a patent license would not permit royalty-free\nredistribution of the Program by all those who receive copies directly\nor indirectly through You, then the only way You could satisfy both it\nand this License Agreement would be to refrain entirely from\ndistribution of the Program.\n\nIt is not the purpose of this Section 13 to induce You to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this Section has the sole purpose of protecting the\nintegrity of the software distribution system reflected in this\nLicense Agreement, which is implemented by public license\npractices. Many people have made generous contributions to the wide\nrange of software distributed through related distribution systems, in\nreliance on consistent application of such distribution systems; it is\nup to the Author/donor to decide if he or she is willing to distribute\nsoftware through any other system and a Licensee cannot impose that\nchoice.\n\n14. Governmental Entities: Any Governmental Entity (\"Governmental\nEntity\" is defined broadly as set forth in Section 0.13.1) or\nGovernmental Person (as \"Governmental Person\" is defined broadly in\nSection 0.13.2), that uses, modifies, changes, copies, displays,\nperforms, or distributes the Program, or any Software or Derivative\nWork based on the Program, may do so if and only if all of the\nfollowing terms and conditions (14.1 through 14.10, inclusive) are\nagreed to and fully met:\n\n14.1 If it is the position of any Governmental Entity (or, in the case\nof any \"Governmental Person,\" if it is the position of that\nGovernmental Person's Governmental Entity) that any doctrine or\ndoctrines of law (including, without limitation, any doctrine(s) of\nimmunity or any formalities of contract formation) may render this\nLicense Agreement unenforceable or less than fully enforceable against\nsuch Governmental Entity, or any Governmental Person of such\nGovernmental Entity, then prior to any use, modification, change,\ndisplay, performance, copy or distribution of the Program, or of any\nSoftware or Derivative Work based on the Program, or any part thereof,\nby the Governmental Entity, or by any Governmental Person of that\nGovernmental Entity, the Governmental Entity shall be required to\ninform the Author in writing of each such doctrine that is believed to\nrender this License Agreement or any part of it less than fully\nenforceable against such Governmental Entity or any Governmental\nPerson of such entity, and to explain in reasonable detail what\nadditional steps, if taken, would render the License Agreement fully\nenforceable against such entity or person. Failure to provide the\nrequired written notice to the Author in advance of any such use,\nmodification, change, display, performance, copy or distribution,\nshall constitute an irrevocable and conclusive waiver of any and all\nreliance on any doctrine, by the Governmental Entity, that is not\nincluded or that is omitted from the required written notice (failure\nto provide any written notice means all reliance on any doctrine is\nirrevocably waived). Any Governmental Entity that provides written\nnotice under this subsection is prohibited, as are all of the\nGovernmental Persons of such Governmental Entity, from making any use,\nchange, display, performance, copy, modification or distribution of\nthe Software or any part thereof, until such time as a License\nAgreement is in place, agreed upon by the Author and by the\nGovernmental Entity, that such entity concedes is\nfully-enforceable. Any use, modification, change, display,\nperformance, copy, or distribution following written notice under this\nParagraph, but without the implementation of an agreement as provided\nherein, shall constitute an irrevocable and conclusive waiver by the\nGovernmental Entity (and any and all Governmental Persons of such\nGovernmental Entity) of any and all reliance on any legal doctrine\neither referenced in such written notice or omitted from it.\n\n14.2 Any Governmental Entity that uses, copies, changes, modifies, or\ndistributes, the Software or any part or portion thereof, or any\nGovernmental Person who does so (whether that person's Governmental\nEntity contends the person's action was, or was not, authorized or\nofficial), permanently and irrevocably waives any defense based on\nsovereign immunity, official immunity, the Act of State Doctrine, or\nany other form of immunity, that might otherwise apply as a defense\nto, or a bar against, any legal action based on the terms of this\nLicense Agreement.\n\n14.2.1 With respect to any enforcement action brought by the Author in\na United States court against a foreign Governmental Entity, the\nwaiver by any Governmental Entity as provided in Subparagraphs 14.1\nand 14.2 is hereby expressly acknowledged by each such Governmental\nEntity to constitute a \"case . . . in which the foreign state has\nwaived its immunity,\" within the scope of 28 U.S.C. � 1605(a)(1) of\nthe Foreign Sovereign Immunities Act of 1976 (as amended). Each such\nGovernmental Entity also specifically agrees and concedes that the\n\"commercial activity\" exceptions to the FSIA, 28 U.S.C. � 1605(a)(2),\n(3) are also applicable. With respect to an action brought against the\nUnited States or any United States Governmental Entity, in the courts\nof any country, the U.S. Governmental Entity shall be understood to\nhave voluntarily agreed to a corresponding waiver of immunity from\nactions in the courts of any other sovereign.\n\n14.2.2 With respect to any enforcement action brought by an authorized\nend-user (as a third-party beneficiary, under the terms of\nSubparagraphs 14.3 and 14.10) in a United States court against a\nforeign Governmental Entity, the waiver by any Governmental Entity as\nprovided in Subparagraphs 14.1 and 14.2 is hereby expressly\nacknowledged by each such Governmental Entity to constitute a \"case\n. . . in which the foreign state has waived its immunity,\" within the\nscope of 28 U.S.C. � 1605(a)(1) of the Foreign Sovereign Immunities\nAct of 1976 (as amended). . Each such Governmental Entity also\nspecifically agrees and concedes that the \"commercial activity\"\nexceptions to the FSIA, 28 U.S.C. � 1605(a)(2), (3) are also\napplicable. With respect to an action brought against the United\nStates or any United States Governmental Entity, in the courts of any\ncountry, the U.S. Governmental Entity shall be understood to have\nvoluntarily agreed to a corresponding waiver of immunity from actions\nin the courts of any other sovereign.\n\n14.2.3 With respect to any action or effort by the Author in the\nUnited States to execute a judgment against a foreign Governmental\nEntity, by attaching or executing process against the property of such\nGovernmental Entity, the waiver by any Governmental Entity as provided\nin Subparagraphs 14.1 and 14.2 is hereby expressly acknowledged by\neach such Governmental Entity to constitute a case in which \"the\nforeign state has waived its immunity from attachment in aid of\nexecution or from execution,\" in accordance with 28 U.S.C. �\n1610(a)(1) of the Foreign Sovereign Immunities Act of 1976 (as\namended). Each such Governmental Entity also specifically agrees and\nconcedes that the \"commercial activity\" exceptions to the FSIA, 28\nU.S.C. � 1610(a)(2), (d) are also applicable. With respect to an\naction brought against the United States or any United States\nGovernmental Entity, in the courts of any country, the\nU.S. Governmental Entity shall be understood to have voluntarily\nagreed to a corresponding waiver of immunity from actions in the\ncourts of any other sovereign.\n\n14.2.4 With respect to any action or effort brought by an authorized\nend-user (as a third-party beneficiary, in accordance with\nSubparagraphs 14.3 and 14.10) in the United States to execute a\njudgment against a foreign Governmental Entity, by attaching or\nexecuting process against the property of such Governmental Entity,\nthe waiver by any Governmental Entity as provided in Subparagraphs\n14.1 and 14.2 is hereby expressly acknowledged by each such\nGovernmental Entity to constitute a case in which \"the foreign state\nhas waived its immunity from attachment in aid of execution or from\nexecution,\" in accordance with 28 U.S.C. � 1610(a)(1) of the Foreign\nSovereign Immunities Act of 1976 (as amended). Each such Governmental\nEntity also specifically agrees and concedes that the \"commercial\nactivity\" exceptions to the FSIA, 28 U.S.C. � 1610(a)(2), (d) are\nalso applicable. With respect to an action brought against the United\nStates or any United States Governmental Entity, in the courts of any\ncountry, the U.S. Governmental Entity shall be understood to have\nvoluntarily agreed to a corresponding waiver of immunity from actions\nin the courts of any other sovereign.\n\n14.3 Any Governmental Entity that uses, copies, changes, modifies,\ndisplays, performs, or distributes the Software or any part thereof,\nor any Governmental Person who does so (whether that person's\nGovernmental Entity contends the person's action was, or was not,\nauthorized or official), and thereby violates any terms and conditions\nof Section 9 (restrictions on modification), or Paragraph 10 (use\nrestrictions), agrees that the person or entity is subject not only to\nan action by the Author, for the enforcement of this License Agreement\nand for money damages and injunctive relief (as well as attorneys'\nfees, additional and statutory damages, and other remedies as provided\nby law), but such Governmental Entity and/or Person also shall be\nsubject to a suit for money damages and injunctive relief by any\nperson whose human rights have been violated or infringed, in\nviolation of this License Agreement, or through the use of any\nSoftware in violation of this License Agreement. Any person who brings\nan action under this section against any Governmental Person or Entity\nmust notify the Author promptly of the action and provide the Author\nthe opportunity to intervene to assert the Author's own\nrights. Damages in such a third-party action shall be measured by the\nseverity of the human rights violation and the copyright infringement\nor License Agreement violation, combined, and not merely by reference\nto the copyright infringement. All end-users, to the extent that they\nare entitled to bring suit against such Governmental Entity by way of\nthis License Agreement, are intended third-party beneficiaries of this\nLicense Agreement. Punitive damages may be awarded in such a\nthird-party action against a Governmental Entity or Governmental\nPerson, and each and every such Governmental Entity or Person\nconclusively waives all restrictions on the amount of punitive\ndamages, and all defenses to the award of punitive damages to the\nextend such limitations or defenses depend upon or are a function of\nsuch person or entity's status as a Governmental Person or\nGovernmental Entity.\n\n14.4 Any State of the United States, or any subunit or Governmental\nEntity thereof, that uses, copies, changes, modifies, displays,\nperforms, or distributes the Software of any part thereof, or any of\nwhose Governmental Persons does so (whether that person's Governmental\nEntity contends the person's action was, or was not, authorized or\nofficial), unconditionally and irrevocably waives for purposes of any\nlegal action (i) to enforce this License Agreement, (ii) to remedy\ninfringement of the Author's copyright, or (iii) to invoke any of the\nthird-party beneficiary rights set forth in Section 14.3 -- any\nimmunity under the Eleventh Amendment of the United States\nConstitution or any other immunity doctrine (such as sovereign\nimmunity or qualified, or other, official immunity) that may apply to\nstate governments, subunits, or to their Governmental Persons.\n\n14.5 Any Governmental Entity (including, without limitation, any State\nof the United States), that uses, copies, changes, modifies, performs,\ndisplays, or distributes the Software or any part thereof, or any of\nwhose Governmental Persons does so (whether that person's Governmental\nEntity contends the person's action was, or was not, authorized or\nofficial), unconditionally and irrevocably waives for purposes of any\nlegal action (i) to enforce this License Agreement, (ii) to remedy\ninfringement of the Author's copyright, or (iii) to invoke any of the\nthird-party beneficiary rights set forth in Section 14.3 any doctrine\n(such as, but not limited to, the holding in the United States Supreme\nCourt decision of Ex Parte Young) that might purport to limit remedies\nsolely to prospective injunctive relief. Also explicitly and\nirrevocably waived is any underlying immunity doctrine that would\nrequire the recognition of such a limited exception for purposes of\nremedies. The remedies against such governmental entities and persons\nshall explicitly include money damages, additional damages, statutory\ndamages, consequential damages, exemplary damages, punitive damages,\ncosts and fees that might otherwise be barred or limited in amount on\naccount of governmental status.\n\n14.6 Any Governmental Entity that uses, copies, changes, modifies,\ndisplays, performs, or distributes the Software or any part thereof,\nor any of whose Governmental Persons does so (whether that person's\nGovernmental Entity contends the person's action was, or was not,\nauthorized or official), unconditionally and irrevocably waives for\npurposes of any legal action (i) to enforce this License Agreement,\n(ii) to remedy infringement of the Author's copyright, or (iii) to\ninvoke any of the third-party beneficiary rights set forth in Section\n14.3 any and all reliance on the Act of State doctrine, sovereign\nimmunity, international comity, or any other doctrine of immunity\nwhether such doctrine is recognized in that government's own courts,\nor in the courts of any other government or nation.\n\n14.6.1 Consistent with Subparagraphs 14.2.1 through 14.2.4, this\nwaiver shall explicitly be understood to constitute a waiver not only\nagainst suit, but also against execution against property, for\npurposes of the Foreign Sovereign Immunities Act of 1976 (as\namended). All United States Governmental Entities shall be understood\nto have agreed to a corresponding waiver of immunity against (i) suit\nin the courts of other sovereigns, and (ii) execution against property\nof the United States located within the territory of other countries.\n\n14.7 Governmental Persons, (i) who violate this License Agreement\n(whether that person's Governmental Entity contends the person's\naction was, or was not, authorized or official), or (ii) who are\npersonally involved in any activity, policy or practice of a\ngovernmental entity that violates this License Agreement (whether that\nperson's Governmental Entity contends the person's action was, or was\nnot, authorized or official), or (iii) that use, copy, change, modify,\nperform, display or distribute, the Software or any part thereof, when\ntheir Governmental Entity is not permitted to do so, or is not a\nQualified Licensee, or has violated the terms of this License\nAgreement, each and all individually waive and shall not be permitted\nto assert any defense of official immunity, \"good faith\" immunity,\nqualified immunity, absolute immunity, or other immunity based on his\nor her governmental status.\n\n14.8 No Governmental Entity, nor any Governmental Person thereof may,\nby legislative, regulatory, or other action, exempt such Governmental\nEntity, subunit, or person, from the terms of this License Agreement,\nif the Governmental Entity or any such person has voluntarily used,\nmodified, copied, displayed, performed, or distributed the Software or\nany part thereof.\n\n14.9 Enforcement In Courts of Other Sovereigns Permitted. By using,\nmodifying, changing, displaying, performing or distributing any\nSoftware covered by this License Agreement, any Governmental Entity\nhereby voluntarily and irrevocably consents, for purposes of (i) any\naction to enforce the terms of this License Agreement, and (ii) any\naction to enforce the Author's copyright (whether such suit be for\ninjunctive relief, damages, or both) to the jurisdiction of any court\nor tribunal in any other country (or a court of competent jurisdiction\nof a subunit, province, or state of such country) in which the terms\nof this License Agreement are believed by the Author to be\nenforceable. Each such Governmental Entity hereby waives all\nobjections to personal jurisdiction, all objections based on\ninternational comity, all objections based on the doctrine of forum\nnon conveniens, and all objections based on sovereign or governmental\nstatus or immunity that might otherwise be asserted in the courts of\nsome other sovereign.\n\n14.9.1 The Waiver by any Governmental Entity of a country other than\nthe United States shall be understood explicitly to constitute a\nwaiver for purposes of the Foreign Sovereign Immunities Act of 1976\n(see Subparagraphs 14.2.1to 14.2.4, inclusive, supra), and all United\nStates Governmental Entities shall be understood to have agreed to a\nwaive correspondingly broad in scope with respect to actions brought\nin the courts of other sovereigns.\n\n14.9.2 Forum Selection Non-U.S. Governmental Entities. Governmental\nEntities that are not United States Governmental Entities shall be\nsubject to suit, and agree to be subject to suit, in the United States\nDistrict Court for the District of Columbia. The Author or an\nauthorized end-user may bring an action in another court in another\ncountry, but the United States District Court for the District of\nColumbia, shall always be available as an agreed-upon forum for such\nan action. At the optional election of any Author (or, in the case of\na third-party claim, any end-user asserting rights under Subparagraphs\n14.3 and 14.10), such a suit against a non-U.S. Governmental Entity or\nPerson may be brought in the United States District Court for the\nSouthern District of New York, or the United States District Court for\nthe Northern District of California, as a direct substitute for the\nUnited States District Court for the District of Columbia, for all\npurposes of this Subparagraph.\n\n14.9.3 Forum Selection U.S. Governmental Entities. All United States\nGovernmental Entities shall be subject to suit, and agree to be\nsubject to suit, in the following (non-exclusive) list of fora:\nOttawa, Canada, London, England, and Paris, France. The Author or an\nauthorized end-user may bring action in another court that can\nexercise jurisdiction. But the courts in these three locations shall\nalways be available (at the option of the Author or an authorized\nend-user) as a forum for resolving any dispute with the United States\nor a governmental subunit thereof. Except as provided in Subparagraph\n14.10, any and all United States Governmental Persons shall be subject\nto suit wherever applicable rules of personal jurisdiction and venue\nshall permit such suit to be filed, but no such United States\nGovernmental Person may assert any defense based on forum non\nconveniens or international comity, to the selection of any particular\nlawful venue.\n\n14.10 Enforcement Of Claims For Human Rights Violations. By using,\ncopying, modifying, changing, performing, displaying or distributing\nthe Software covered by this License Agreement, any Governmental\nEntity, or Governmental Person hereby voluntarily and irrevocably\nconsents -- for purposes of any third-party action to remedy human\nrights violations and other violations of this License Agreement (as\nreflected in Section 14.3) -- to the jurisdiction of any court or\ntribunal in any other country (or a court of competent jurisdiction of\na subunit, province, or state of such country) in which the\nthird-party beneficiary reasonably believes the relevant terms of this\nLicense Agreement are enforceable. The Governmental Entity or Person\nhereby waives all objections to personal jurisdiction, all objections\nbased on international comity, all objections based on the doctrine of\nforum non conveniens, and all objections based on sovereign or\ngovernmental status or immunity that might otherwise be asserted in\nthe courts of some other sovereign.\n\n14.10.1 Waiver of Immunity and Forum Selection. The presumptively\nvalid and preferred fora identified in Subparagraphs 14.9.2 and 14.9.3\nshall also apply for purposes of Subparagraph 14.10. All Governmental\nEntities are subject to the same Waiver of Immunity as set forth in\nSubparagraphs 14.2.1 to 14.2.4, inclusive.\n\n15. Subsequent Versions of HESSLA. Hacktivismo may publish revised\nand/or new versions of the Hacktivismo Enhanced-Source Software\nLicense Agreement from time to time. Such new versions will be similar\nin spirit to the present version, but may differ in detail to address\nnew problems or concerns.\n\nEach version is given a distinguishing version number. Any Program\nreleased by Hacktivismo under a version of this License Agreement\nprior to Version 1.0, shall be considered released under Version 1.0\nof the Hacktivismo Enhanced-Source Software License Agreement, once\nVersion 1.0 is formally released. Prior to Version 1.0, any Software\nreleased by Hacktivismo or a Licensee of Hacktivismo under a\nlower-numbered version of the HESSLA shall be considered automatically\nto be subject to a higher-number version of the HESSLA, whenever a\nlater-numbered version has been released.\n\nConcerning the work of any other Author, if the Program specifies a\nversion number of this License Agreement which applies to it and \"any\nlater version,\" You have the option of following the terms and\nconditions either of that version or of any later version published by\nHacktivismo. If the Program does not specify a version number of this\nLicense Agreement, You may choose any version after 1.0, once version\n1.0 is published by Hacktivismo, and prior to publication of version\n1.0, You may choose any version of the Hacktivismo Software License\nAgreement then published by Hacktivismo. If the Program released by\nanother Author, specifies only a version number, then that version\nnumber only shall apply. If \"the latest version,\" is specified, then\nthe latest version of the HESSLA published on the Hacktivismo Website\nshall always apply at all times.\n\n16. DISCLAIMER OF WARRANTY. THE SOFTWARE IS PROVIDED UNDER THIS\nLICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY, EITHER EXPRESS OR\nIMPLIED, INCLUDING, WITHOUT LIMITATION, THE WARRANTY OF\nNON-INFRINGEMENT AND WARRANTIES THAT THE ORIGINAL WORK IS MERCHANTABLE\nOR FIT FOR A PARTICULAR PURPOSE. THE SOFTWARE IS PROVIDED WITH ALL\nFAULTS. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH\nYOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL\nNECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY\nCONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO LICENSE TO ORIGINAL\nWORK IS GRANTED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n17. LIMITATION OF LIABILITY. UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL\nTHEORY, WHETHER TORT (INCLUDING THE AUTHOR'S NEGLIGENCE), CONTRACT, OR\nOTHERWISE, SHALL THE AUTHOR BE LIABLE TO ANY PERSON FOR ANY DIRECT,\nINDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY\nCHARACTER ARISING AS A RESULT OF THIS LICENSE OR THE USE OF THE\nSOFTWARE INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL,\nWORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER\nCOMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PERSON SHALL HAVE BEEN\nINFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF\nLIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY\nRESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW\nPROHIBITS SUCH LIMITATION, BUT SHALL EXCLUDE SUCH LIABILITY TO THE\nEXTENT PERMITTED BY LAW. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION\nOR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS\nEXCLUSION AND LIMITATION MAY NOT APPLY TO YOU.\n\n18. ENCRYPTION KEYS AND PUBLIC KEY INFRASTRUCTURE. SOFTWARE RELEASED\nUNDER THIS LICENSE AGREEMENT MAY REQUIRE A DIGITAL CERTIFICATE, OR AN\nENCRYPTION KEY \"SIGNED\" BY A TRUSTED PARTY, TO FUNCTION. AUTHOR\nUNDERTAKES NO RESPONSIBILITY FOR THE PROPER, SECURE, AND ADEQUATE\nFUNCTIONING OF ANY CRYPTOGRAPHIC SYSTEMS, OF ANY CRYPTOGRAPHIC KEYS,\nOR FOR THE TRUSTWORTHINESS OF ANY END-USER, ANY ISSUER OF\nCERTIFICATES, OR OF ANY SIGNER OF ENCRYPTION KEYS. USE OF THIS\nSOFTWARE IS AT THE END-USER'S SOLE AND EXCLUSIVE RISK. IN ANY\nPUBLIC-KEY INFRASTRUCTURE (\"PKI\") SYSTEM, AN END-USER'S LEGAL\nRELATIONSHIP WITH THE END-USER'S CERTIFICATION AUTHORITY DOES NOT\nINCLUDE OR ENCOMPASS ANY LEGAL RELATIONSHIP WITH THE AUTHOR, AND IS\nGOVERNED SOLELY AND EXCLUSIVELY BY THE CERTIFICATION AUTHORITY'S\nCERTIFICATION PRACTICE STATEMENT AND CERTIFICATION AGREEMENTS. AUTHOR\nASSUMES NO RESPONSIBILITY FOR THE ACTIONS OR OMISSIONS OF ANY END-USER\nOR ANY CERTIFICATION AUTHORITY.\n\n18. Saving Clause. If any portion of this License Agreement is held\ninvalid or unenforceable under any particular circumstance, the\nbalance of the License Agreement is intended to apply and the License\nAgreement as a whole is intended to apply in other circumstances.\n\nEND OF TERMS AND CONDITIONS"
}