{
  "key": "hfoil-1.0",
  "short_name": "HFOILv1.0",
  "name": "Hugging Face Optimized Inference License 1.0",
  "category": "Source-available",
  "owner": "HuggingFace",
  "homepage_url": "https://github.com/huggingface/text-generation-inference/blob/bde25e62b33b05113519e5dbf75abda06a03328e/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-hfoil-1.0",
  "text": "Hugging Face Optimized Inference License 1.0 (HFOILv1.0)\n\n\nThis License Agreement governs the use of the Software and its Modifications. It is a\nbinding agreement between the Licensor and You.\n\nThis License Agreement shall be referred to as Hugging Face Optimized Inference License\n1.0 or HFOILv1.0. We may publish revised versions of this License Agreement from time to\ntime. Each version will be given a distinguished number.\n\nBy downloading, accessing, modifying, distributing or otherwise using the Software, You\nconsent to all of the terms and conditions below. So, if You do not agree with those,\nplease do not download, access, modify, distribute, or use the Software.\n\n\n1. PERMISSIONS\n\nYou may use, modify and distribute the Software pursuant to the following terms and\nconditions:\n\nCopyright License. Subject to the terms and conditions of this License Agreement and where\nand as applicable, each Contributor hereby grants You a perpetual, worldwide,\nnon-exclusive, royalty-free, copyright license to reproduce, prepare, publicly display,\npublicly perform, sublicense under the terms herein, and distribute the Software and\nModifications of the Software.\n\nPatent License. Subject to the terms and conditions of this License Agreement and where\nand as applicable, each Contributor hereby grants You a perpetual, worldwide,\nnon-exclusive, royalty-free patent license to make, have made, Use, offer to sell, sell,\nimport, and otherwise transfer the Software, where such license applies only to those\npatent claims licensable by such Contributor that are necessarily infringed by their\nContribution(s) alone or by combination of their Contribution(s) with the Software to\nwhich such Contribution(s) was submitted. If You institute patent litigation against any\nentity (including a cross-claim or counterclaim in a lawsuit) alleging that the Software\nor a Contribution incorporated within the Software constitutes direct or contributory\npatent infringement, then any rights granted to You under this License Agreement for the\nSoftware shall terminate as of the date such litigation is filed.\n\nNo other rights. All rights not expressly granted herein are retained.\n\n\n2. RESTRICTIONS\n\nYou may not distribute the Software as a hosted or managed, and paid service, where the\nservice grants users access to any substantial set of the features or functionality of the\nSoftware. If you wish to do so, You will need to be granted additional rights from the\nLicensor which will be subject to a separate mutually agreed agreement.\n\nYou may not sublicense the Software under any other terms than those listed in this\nLicense.\n\n\n3. OBLIGATIONS\n\nWhen You modify the Software, You agree to: - attach a notice stating the Modifications of\nthe Software You made; and - attach a notice stating that the Modifications of the\nSoftware are released under this License Agreement.\n\nWhen You distribute the Software or Modifications of the Software, You agree to: - give\nany recipients of the Software a copy of this License Agreement; - retain all Explanatory\nDocumentation; and if sharing the Modifications of the Software, add Explanatory\nDocumentation documenting the changes made to create the Modifications of the Software; -\nretain all copyright, patent, trademark and attribution notices.\n\n\n4. MISCELLANEOUS\n\nTermination. Licensor reserves the right to restrict Use of the Software in violation of\nthis License Agreement, upon which Your licenses will automatically terminate.\n\nContributions. Unless You explicitly state otherwise, any Contribution intentionally\nsubmitted for inclusion in the Software by You to the Licensor shall be under the terms\nand conditions of this License, without any additional terms or conditions.\nNotwithstanding the above, nothing herein shall supersede or modify the terms of any\nseparate license agreement you may have executed with Licensor regarding such\nContributions.\n\nTrademarks and related. Nothing in this License Agreement permits You (i) to make Use of\nLicensors’ trademarks, trade names, or logos, (ii) otherwise suggest endorsement by\nLicensor, or (iii) misrepresent the relationship between the parties; and any rights not\nexpressly granted herein are reserved by the Licensors.\n\nOutput You generate. Licensor claims no rights in the Output. You agree not to contravene\nany provision as stated in the License Agreement with your Use of the Output.\n\nDisclaimer of Warranty. Except as expressly provided otherwise herein, and to the fullest\nextent permitted by law, Licensor provides the Software (and each Contributor provides its\nContributions) AS IS, and Licensor disclaims all warranties or guarantees of any kind,\nexpress or implied, whether arising under any law or from any usage in trade, or otherwise\nincluding but not limited to the implied warranties of merchantability, non-infringement,\nquiet enjoyment, fitness for a particular purpose, or otherwise. You are solely\nresponsible for determining the appropriateness of the Software and Modifications of the\nSoftware for your purposes (including your use or distribution of the Software and\nModifications of the Software), and assume any risks associated with Your exercise of\npermissions under this License Agreement.\n\nLimitation of Liability. In no event and under no legal theory, whether in tort (including\nnegligence), contract, or otherwise, unless required by applicable law (such as deliberate\nand grossly negligent acts) or agreed to in writing, shall any Contributor be liable to\nYou for damages, including any direct, indirect, special, incidental, or consequential\ndamages of any character arising as a result of this License Agreement or out of the Use\nor inability to Use the Software (including but not limited to damages for loss of\ngoodwill, work stoppage, computer failure or malfunction, model failure or malfunction, or\nany and all other commercial damages or losses), even if such Contributor has been advised\nof the possibility of such damages.\n\nAccepting Warranty or Additional Liability. While sharing the Software or Modifications of\nthe Software thereof, You may choose to offer and charge a fee for, acceptance of support,\nwarranty, indemnity, or other liability obligations and/or rights consistent with this\nLicense Agreement. However, in accepting such obligations, You may act only on Your own\nbehalf and on Your sole responsibility, not on behalf of Licensor or any other\nContributor, and you hereby agree to indemnify, defend, and hold Licensor and each other\nContributor (and their successors or assigns) harmless for any liability incurred by, or\nclaims asserted against, such Licensor or Contributor (and their successors or assigns) by\nreason of your accepting any such warranty or additional liability.\n\nSeverability. This License Agreement is a license of copyright and patent rights and an\nagreement in contract between You and the Licensor. If any provision of this License\nAgreement is held to be invalid, illegal or unenforceable, the remaining provisions shall\nbe unaffected thereby and remain valid as if such provision had not been set forth herein.\n\n\n5. DEFINITIONS\n\n“Contribution” refers to any work of authorship, including the original version of the\nSoftware and any Modifications of the Software that is intentionally submitted to Licensor\nfor inclusion in the Software by the copyright owner or by an individual or entity\nauthorized to submit on behalf of the copyright owner. For the purposes of this\ndefinition, “submitted” means any form of electronic, verbal, or written communication\nsent to the Licensor or its representatives, including but not limited to communication on\nelectronic mailing lists, source code control systems, and issue tracking systems that are\nmanaged by, or on behalf of, the Licensor for the purpose of discussing and improving the\nSoftware, but excluding communication that is conspicuously marked or otherwise designated\nin writing by the copyright owner as “Not a Contribution.”\n\n“Contributor” refers to Licensor and any individual or entity on behalf of whom a\nContribution has been received by Licensor and subsequently incorporated within the\nSoftware.\n\n“Data” refers to a collection of information extracted from the dataset used with the\nModel, including to train, pretrain, or otherwise evaluate the Model. The Data is not\nlicensed under this License Agreement.\n\n“Explanatory Documentation” refers to any documentation or related information including\nbut not limited to model cards or data cards dedicated to inform the public about the\ncharacteristics of the Software. Explanatory documentation is not licensed under this\nLicense.\n\n\"License Agreement\" refers to these terms and conditions.\n\n“Licensor” refers to the rights owners or entity authorized by the rights owners that are\ngranting the terms and conditions of this License Agreement.\n\n“Model” refers to machine-learning based assemblies (including checkpoints), consisting of\nlearnt weights and parameters (including optimizer states), corresponding to a model\narchitecture as embodied in Software source code. Source code is not licensed under this\nLicense Agreement.\n\n“Modifications of the Software” refers to all changes to the Software, including without\nlimitation derivative works of the Software.\n\n“Output” refers to the results of operating the Software.\n\n“Share” refers to any transmission, reproduction, publication or other sharing of the\nSoftware or Modifications of the Software to a third party, including providing the\nSoftwaire as a hosted service made available by electronic or other remote means,\nincluding - but not limited to - API-based or web access.\n\n“Software” refers to the software and Model (or parts of either) that Licensor makes\navailable under this License Agreement.\n\n“Third Parties” refers to individuals or legal entities that are not under common control\nwith Licensor or You.\n\n“Use” refers to anything You or your representatives do with the Software, including but\nnot limited to generating any Output, fine tuning, updating, running, training, evaluating\nand/or reparametrizing the Model.\n\n\"You\" (or \"Your\")  refers to an individual or Legal Entity exercising permissions granted\nby this License Agreement and/or making Use of the Software for whichever purpose and in\nany field of Use."
}