{
  "key": "hp-proliant-essentials",
  "short_name": "hp-proliant-essentials",
  "name": "hp-proliant-essentials EULA",
  "category": "Commercial",
  "owner": "HP - Hewlett Packard",
  "homepage_url": "http://www.calculate-linux.org/packages/licenses/hp-proliant-essentials",
  "spdx_license_key": "LicenseRef-scancode-hp-proliant-essentials",
  "ignorable_copyrights": [
    "copyrighted by Hewlett-Packard Development Company, L.P., HP's intellectual property management company"
  ],
  "ignorable_holders": [
    "Hewlett-Packard Development Company, L.P., HP's intellectual property management company"
  ],
  "ignorable_urls": [
    "http://www.hp.com/"
  ],
  "text": "hp-proliant-essentials\n\n\n\t\tPROLIANT ESSENTIALS SOFTWARE\n\n\t\tEND USER LICENSE AGREEMENT\n\nPLEASE READ THIS END USER LICENSE AGREEMENT (\"AGREEMENT\") CAREFULLY.  THIS\nAGREEMENT IS A LEGAL AGREEMENT BETWEEN YOU (EITHER AN INDIVIDUAL OR SINGLE\nENTITY) (\"YOU\") AND HEWLETT-PACKARD COMPANY (\"HP\").  BY CLICKING THE \"AGREE\"\nBUTTON BELOW, COPYING, INSTALLING, OR OTHERWISE USING THE SOFTWARE,\n(i) YOU DO SO WITH THE INTENT TO ELECTRONICALLY \"EXECUTE\" THIS AGREEMENT, AND\n(ii) YOU AGREE TO BE BOUND BY AND COMPLY WITH THE FOLLOWING TERMS AND\nCONDITIONS, INCLUDING THE WARRANTY STATEMENT, AS WELL AS ANY TERMS AND\nCONDITIONS CONTAINED IN THE \"ANCILLARY SOFTWARE\" LIST.\n\nIF YOU DO NOT AGREE TO THE TERMS AND CONDITIONS OF THIS AGREEMENT,\n(A) IF THIS AGREEMENT IS DISPLAYED ELECTRONICALLY, YOU MAY INDICATE REJECTION\n    OF THIS AGREEMENT BY CLICKING THE \"DISAGREE\" BUTTON;\n(B) YOU SHALL NOT INSTALL THE SOFTWARE; AND\n(C) HP DOES NOT GRANT YOU ANY RIGHTS TO USE THE SOFTWARE.\nNOTWITHSTANDING THE FOREGOING, INSTALLING OR OTHERWISE USING THE SOFTWARE\nINDICATES YOUR ACCEPTANCE OF THE TERMS AND CONDITIONS OF THIS AGREEMENT.\nIF YOU PURCHASED THE SOFTWARE, YOU MAY RETURN THE SOFTWARE TO THE PLACE OF\nPURCHASE FOR A FULL REFUND.\n\nTHE SOFTWARE PROVIDED HEREIN, IS PROVIDED BY HP AND BY THIRD PARTIES, INCLUDING\nTHE OPEN SOURCE COMMUNITY (\"ANCILLARY SOFTWARE\").  USE OF THE HP SOFTWARE, THE\nANCILLARY SOFTWARE, ACCOMPANYING PRINTED MATERIALS, AND THE \"ONLINE\" OR\nELECTRONIC DOCUMENTATION (COLLECTIVELY THE \"PRODUCT\") IS CONDITIONED UPON AND\nLIMITED BY THE FOLLOWING TERMS AND CONDITIONS, INCLUDING THE \"AS IS WARRANTY\nSTATEMENT\" AND THE TERMS AND CONDITIONS OF THE ANCILLARY SOFTWARE LICENSE\nAGREEMENTS (\"ANCILLARY SOFTWARE LICENSES\").\n\nUSE OF ANCILLARY SOFTWARE SHALL BE GOVERNED BY THE ANCILLARY SOFTWARE LICENSE,\nEXCEPT THAT THE DISCLAIMER OF WARRANTIES AND LIMITATION OF LIABILITIES\nPROVISIONS CONTAINED IN THE \"AS-IS WARRANTY STATEMENT\" OF THIS AGREEMENT SHALL\nALSO APPLY TO SUCH ANCILLARY SOFTWARE.  HP HAS IDENTIFIED ANCILLARY SOFTWARE\nBY EITHER NOTING THE ANCILLARY SOFTWARE PROVIDER\"S OWNERSHIP WITHIN EACH\nANCILLARY SOFTWARE PROGRAM FILE AND/OR BY PROVIDING LICENSING INFORMATION IN\nTHE \"ANCILLARY SOFTWARE\" LIST. BY ACCEPTING THE TERMS AND CONDITIONS OF THIS\nAGREEMENT, YOU ARE ALSO ACCEPTING THE TERMS AND CONDITIONS OF EACH ANCILLARY\nSOFTWARE LICENSE IN THE ANCILLARY SOFTWARE LIST.\n\nIF AND ONLY IF THE PRODUCT INCLUDES SOFTWARE LICENSED UNDER THE GNU GENERAL\nPUBLIC LICENSE (\"GPL SOFTWARE\"), YOU MAY OBTAIN A COMPLETE MACHINE-READABLE\nCOPY OF THE GPL SOFTWARE SOURCE CODE (\"GPL SOURCE CODE\") BY DOWNLOAD FROM A\nSITE SPECIFIED IN THE FOLLOWING HP WEBSITE:\nHTTP://H18004.WWW1.HP.COM/PRODUCTS/SERVERS/PROLIANTESSENTIALS/VALUEPACK/LICENSING.HTML.\nUPON YOUR WRITTEN REQUEST, HP WILL PROVIDE, FOR A FEE COVERING THE COST OF\nDISTRIBUTION, A COMPLETE MACHINE-READABLE COPY OF THE GPL SOURCE CODE, BY MAIL,\nTO YOU.  INFORMATION ABOUT HOW TO MAKE A WRITTEN REQUEST FOR GPL SOURCE CODE\nMAY BE FOUND AT THE FOLLOWING WEBSITE:\nHTTP://H18004.WWW1.HP.COM/PRODUCTS/SERVERS/PROLIANTESSENTIALS/VALUEPACK/LICENSING.HTML .\n\n\nLICENSE TERMS\n\nSUBJECT TO THE TERMS AND CONDITIONS OF THIS AGREEMENT AND ANY RIGHTS,\nLIMITATIONS AND OBLIGATIONS SET FORTH IN THE ANCILLARY SOFTWARE LICENSES:\n\n1.\tLICENSE GRANT\n\na.\tIF SOFTWARE DOES NOT REQUIRE AN ACTIVATION KEY.  If the Software does\nnot require an Activation Key and provided that You comply with all the terms\nand conditions of this Agreement, HP grants You a non-exclusive,\nnon-transferable (except as provided in Section 16), worldwide (except for the\ncountries referenced  in Section 12) license under HP's copyrights, to install,\ncopy on as many computers as you need for your business, use, execute, make\narchival or backup copies, and display (\"Use\") the object code version of the\nProduct on the computer(s) on which this Product is installed and in the\noperating environment as identified by HP in the accompanying materials.\n\nb.\tIF SOFTWARE REQUIRES AN ACTIVATION KEY.  If the Software requires an\nActivation Key, and provided that You comply with all terms and conditions of\nthis Agreement, then depending upon the specific hardware configuration You\nemploy, HP grants You the following license  (\"License Type\") and rights:\n\n\tAuthorized Copies.  You are licensed to install, make Authorized Copies\nof (as defined in this section), execute, and display (\"Use\") the object code\nversion of the Product on an equivalent number of Computers, Host/Client Pairs,\nComputer Nodes, or Clustered Computers (as defined in the table below) as you\nhave Authorized Copies.  Authorized Copies is defined as the number of copies\nthat you have paid for as stated in the invoice or comparable document\nevidencing an authorized quantity.\n\nLICENSE TYPE \tSOFTWARE INSTALLS TO:\t\tLICENSED RIGHTS\n\t\t(hardware configuration)\n------------------------------------------------------------------------------\nComputer\tA computer \t\t\tYou have a right to install\n\t\t\t\t\t\tand Use the Product on a single\n\t\t\t\t\t\tcomputer. The installed copy\n\t\t\t\t\t\tmay not be transferred to or\n\t\t\t\t\t\tused on any other computer.\n\n------------------------------------------------------------------------------\nNode/Client\tA set of computers with a\tYou have a right to install and\n\t\tminimum of one host and one\tUse the Product on a Host/Client\n\t\tclient connected to each\tPair or a Single Node.  Copies\n\t\tother (\"Host/Client Pair\"),\tof the Product installed on a\n\t\tor in certain instances, a\tHost/Client Pair or Single Node\n\t\tsingle computer\t\t\tmay not be transferred to any\n\t\t(\"Single Node\")\t\t\tother host or client computers\n\t\t\t\t\t\tor other single nodes. You can\n\t\t\t\t\t\tcontinue to Use the Product on\n\t\t\t\t\t\tlicensed clients when a new\n\t\t\t\t\t\tserver is introduced to the\n\t\t\t\t\t\tlicensed clients.\n\n------------------------------------------------------------------------------\nCluster\t\tMore than two computers\t\tYou have a right to install and\n\t\tphysically connected together\tUse the Product on each\n\t\tin a cluster configuration\tClustered Computer. The\n\t\t(each of which is referred to\tinstalled copy may not be\n\t\tas \"Clustered Computer\")\ttransferred to or used on any\n\t\t\t\t\t\tother computer.\n\n\t\t\n\tStorage.  You may copy the Product into the local memory or storage\ndevice of the hardware configuration loaded with the Authorized Copies. You may\ncopy the Product onto a reasonable number of network servers or a secure\nintranet for the sole purpose of distributing the Product to the Computers,\nHost/Client Pairs, Computer Nodes, or Clustered Computers.  You may make\narchival or back-up copies of the Product. You shall keep the activation key\nwith the hardware configuration to which the activation key is licensed. You\nshould keep copies of the activation key information for future retrieval\npurposes.\n\n2.\t NEW RELEASES.  \"New Release\" means a release of the Product that may\ncontain fixes, corrections, or minor improvements to the Product.  New Releases\nare distributed from time to time solely at the option of HP.  If HP offers a\nNew Release, it may come with its own terms and conditions, however if it does\nnot, You may use the New Release only under the terms and conditions of this\nAgreement.\n3.\tNEW VERSIONS.  \"New Version\" means a version of the Product that may\ncontain significant changes, enhancements, and/or functional improvements to\nthe Product.  New Versions are distributed solely at the option of HP.  If HP\noffers a New Version, it may come with its own terms and conditions, however\nif it does not, You may use the New Version only under the terms and conditions\nof this Agreement.\n4.\tOWNERSHIP.   The Product is owned and copyrighted by Hewlett-Packard\nDevelopment Company, L.P., HP's intellectual property management company, and\nby third party suppliers, except for the Ancillary Software, which is owned and\ncopyrighted by the Ancillary Software providers indicated in the ANCILLARY\nSOFTWARE list.  Your right to Use the Product confers no title or ownership and\nis not a sale of the Product or any part thereof.  Third party suppliers and\nAncillary Software providers are intended beneficiaries under this Agreement\nand may protect their rights in their respective portions of the Product\ndirectly against You.\n5.\tTRANSFER. Without the prior written consent of HP, or unless\nspecifically permitted in the Ancillary Software License,  You have no right\n(a) to rent, lease, lend, or otherwise transfer the rights to the Product to\nanyone else; (b) to Use the Product for commercial timesharing or bureau use;\nor (c) to copy the Product onto any public or distributed network.\n6.\t COPYRIGHT.  United States copyright laws, other countries' copyright\nlaws, and international treaty provisions protect the Product.  You shall not\nremove any product identification, copyright notices, or proprietary notices\nfrom the Product.\n7.\tSUPPORT.  Support terms and conditions and contact information are\ndetailed in the Worldwide Limited Warranty and Technical Support for Industry\nStandard Server Products statement (\"Support Statement\"), a copy of which is\navailable on the HP web site at www.hp.com.  Subject to the terms of the\nSupport Statement, for HP software products installed on HP computers,\ntechnical support for questions regarding media and Product installation may\nbe available for a ninety (90) day period from the date of purchase of the HP\ncomputer on which this Product is installed (\"Support Term\").  To access this\nsupport in North America, call the HP Technical Support Phone Center at\n1-800-652-6672.  This service is available during normal business hours,\nMonday through Friday, during the Support Term.  Outside North America, call\nthe nearest HP Technical Support Center.  No other support, including\nwithout limitation any on-site support, is provided under this Agreement.\n8.\tLIMITATION ON REVERSE ENGINEERING.  Reverse engineering of Ancillary\nSoftware shall be governed by its respective Ancillary Software License. As\nfor the remainder of the Product, You shall not modify, disassemble, reverse\nengineer, decompile, decrypt, or otherwise attempt to access or determine the\nsource code of the Product without HP's prior written consent.  Where You have\nother statutory rights with regard to software, You shall provide HP with\nreasonably detailed information regarding any intended disassembly or\ndecompilation of the Product prior to performing such disassembly or\ndecompilation.  You shall not decrypt the Product unless necessary for the\nlicensed Use of the Product.\n9.\tRESERVATION OF RIGHTS.  HP, its third party suppliers, and Ancillary\nSoftware providers reserve all rights not expressly granted to You in this\nAgreement.\n10.\tTERM AND TERMINATION.  You may exercise the rights of this Agreement\nand of the Ancillary Software Licenses for a period of time starting at Your\nacceptance of the terms and conditions of this Agreement and for so long as\nYou meet such terms and conditions (\"Term\").  Notwithstanding the foregoing,\nHP may terminate Your right to Use the Product, upon notice, for Your failure\nto comply with any such term or condition.  Immediately upon termination, You\nshall remove, destroy, or return to HP all copies of the Product, including\nthose copies of the Product that are merged into Your adaptations, except for\nindividual pieces of data in Your database.  With HP's prior written consent,\none copy of the Product may be retained, for archival purposes only, subsequent\nto termination.  You may terminate this Agreement at any time by returning or\ndestroying the Product together with merged portions in any form.\n11.\tCONFIDENTIAL COMPUTER SOFTWARE.  Valid license from HP required for\npossession, use, or copying.  Consistent with FAR 12.211 and 12.212, Commercial\nComputer Software, Computer Software Documentation, and Technical Data for\nCommercial Items are licensed to the U.S. Government under vendor's standard\ncommercial license.\n12.\tCOMPLIANCE WITH LAW.  The Product and any associated hardware,\nsoftware, technology or services may not be exported, reexported, transferred\nor downloaded to persons or entities listed on the U.S. Department of Commerce\nDenied Persons List, Entity List of proliferation concern, or on any U.S.\nTreasury Department Designated Nationals exclusion list, any country under\nU.S. economic embargo, or to parties directly or indirectly involved in the\ndevelopment or production of nuclear, chemical, biological weapons or in\nmissile technology programs as specified in the U.S. Export Administration\nRegulations (15 CFR 744).  By accepting this Agreement You confirm that You\nare not (i) located in (or a national resident of) any country under U.S.\neconomic embargo, (ii) identified on any U.S. Department of Commerce Denied\nPersons List, Entity List or Treasury Department Designated Nationals exclusion\nlist, and (iii) directly or indirectly involved in the development or\nproduction of nuclear, chemical, biological weapons or in missile technology\nprograms as specified in the U.S. Export Administration Regulations.\n13.\tAPPLICABLE LAW. This Agreement shall be construed in accordance with\nthe laws of the State of Texas, without regard to conflict of laws principles.\nThe United Nations Convention on Contracts for the International Sale of Goods\nis specifically disclaimed.  If the Product was acquired outside the United\nStates, then local law may apply.\n14.\tSEVERABILITY.  If any term or provision of this Agreement is determined\nto be illegal or unenforceable, the validity or enforceability of the remainder\nof the terms or provisions herein will remain valid and in full force and\neffect. Failure or delay in enforcing any right or provision of this Agreement\nshall not be deemed a waiver of such right or provision with respect to any\nsubsequent breach. Provisions herein, which by their nature extend beyond the\ntermination of the license in the Product, will remain in effect until\nfulfilled.\n15.\tCONSENT TO USE OF DATA. You agree that HP may collect and use technical\ninformation that You provide in connection with Your Use and request for\ntechnical support of the Product from HP, however, HP will not use this\ninformation in a form that personally identifies You.\n16.\tASSIGNMENT.  You may not assign, sublicense or transfer this Agreement,\nthe Product, or any rights or obligations hereunder without the prior written\nconsent of HP.  Any such attempted assignment, sublicense, or transfer will be\nnull and void, and in such event, HP may terminate this Agreement immediately.\nNotwithstanding the foregoing, You may assign this Agreement and the rights\ngranted hereunder with the transfer of all or substantially all of Your\nbusiness.  The right to assign or transfer Ancillary Software is governed by\nthe terms and conditions of the Ancillary Software Licenses.\n17.\tENTIRE AGREEMENT.  This Agreement, including all Ancillary Software\nLicenses in the ANCILLARY SOFTWARE list, is the final, complete and exclusive\nagreement between You and HP relating to the Product, and supersedes any\nprevious communications, representations, or agreements between the parties,\nwhether oral or written, regarding the subject matter hereof.  Any additional\nor different terms and conditions not expressly set forth herein will not\napply.  This Agreement may not be changed except by an amendment signed by an\nauthorized representative of both You and HP.  To the extent the terms of any\nHP policies or programs for support services conflict with the terms of this\nAgreement, the terms of this Agreement shall control.\n18.\tWARRANTY\n\n\ta.\tNO ACTIVATION KEY REQUIRED SOFTWARE - AS-IS WARRANTY STATEMENT:\n\n\tDISCLAIMER.  TO THE EXTENT ALLOWED BY APPLICABLE LAW, THIS PRODUCT AND\nSUPPORT SERVICES, IF ANY, ARE PROVIDED TO YOU \"AS IS\" WITHOUT WARRANTIES OF\nANY KIND, WHETHER ORAL OR WRITTEN, EXPRESS OR IMPLIED.  HP SPECIFICALLY\nDISCLAIMS ANY IMPLIED WARRANTIES OF ANY KIND, INCLUDING WITHOUT LIMITATION,\nWARRANTY OF MERCHANTABILITY, SATISFACTORY QUALITY, NON-INFRINGEMENT, TITLE,\nACCURACY OF INFORMATIONAL CONTENT, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY\nOR COMPLETENESS OF RESPONSES, RESULTS, OR WORKMANLIKE EFFORT, LACK OF VIRUSES,\nAND LACK OF NEGLIGENCE, ALL WITH REGARD TO THE PRODUCT, AND THE PROVISION OF\nOR FAILURE TO PROVIDE SUPPORT SERVICES.  IN ADDITION, WITHOUT LIMITATION,\nTHERE IS NO WARRANTY OF QUIET ENJOYMENT, QUIET POSSESSION AND CORRESPONDENCE\nTO DESCRIPTION WITH REGARD TO THE PRODUCT.  YOU ASSUME THE ENTIRE RISK AS TO\nTHE RESULTS AND PERFORMANCE OF THE PRODUCT.  NO ORAL OR WRITTEN INFORMATION OR\nADVICE GIVEN BY HP, HP\"S AUTHORIZED REPRESENTATIVES, OR ANY OTHER PARTY SHALL\nCREATE A WARRANTY OR AMEND THIS \"AS IS\" WARRANTY.  Some jurisdictions do not\nallow exclusions of implied warranties or conditions, so the above exclusion\nmay not apply to You to the extent prohibited by such local laws. You may have\nother rights that vary from country to country, state to state, or province to\nprovince.\n\n\tb.\tACTIVATION KEY REQUIRED SOFTWARE - LIMITED WARRANTY.\n\nHP warrants that the Product will perform substantially in accordance with the\naccompanying materials for a period of ninety (90) days from the date of\npurchase.  If an implied warranty or condition is created by Your\nstate/jurisdiction and federal or state/provincial law prohibits disclaimer of\nit, You also have an implied warranty or condition, BUT ONLY AS TO DEFECTS FOR\nWHICH CLAIMS ARE MADE WITHIN NINETY (90) DAYS FROM THE DATE OF PURCHASE. AS TO\nANY DEFECTS DISCOVERED FOR WHICH A CLAIM IS NOT MADE WITHIN THE NINETY-DAY\nPERIOD, THERE IS NO WARRANTY OR CONDITION OF ANY KIND.\nSome states/jurisdictions do not allow limitations on how long an implied\nwarranty or condition lasts, so the above limitation may not apply to You.\n\n\tDISCLAIMER.  The Limited Warranty that appears above is the only\nexpress warranty made to You and is provided in lieu of any other express\nwarranties or implied warrantees (if any) created by any documentation,\npackaging or otherwise.  EXCEPT FOR THE LIMITED WARRANTY, AND TO THE MAXIMUM\nEXTENT PERMITTED BY APPLICABLE LAW, HP AND ITS SUPPLIERS PROVIDE THE PRODUCT\nAND SUPPORT SERVICES (IF ANY) \"AS IS\" AND WITH ALL FAULTS, AND HEREBY DISCLAIM\nALL OTHER WARRANTIES AND CONDITIONS, EITHER EXPRESS, IMPLIED OR STATUTORY,\nINCLUDING, BUT NOT LIMITED TO, ANY (IF ANY) IMPLIED WARRANTIES, DUTIES OR\nCONDITIONS OF MERCHANTABILITY, OF FITNESS FOR A PARTICULAR PURPOSE,\nSATISFACTORY QUALITY, NON-INFRINGEMENT OF TITLE, OF ACCURACY OR COMPLETENESS\nOF RESPONSES, OF RESULTS, OF WORKMANLIKE EFFORT, OF LACK OF VIRUSES, AND OF\nLACK OF NEGLIGENCE, ALL WITH REGARD TO THE PRODUCT, AND THE PROVISIONS OF OR\nFAILURE TO PROVIDE SUPPORT SERVICES.  ALSO, THERE IS NO WARRANTY OR CONDITION\nOF TITLE, QUIET ENJOYMENT, QUIET POSSESSION, CORRESPONDENCE TO DESCRIPTION,\nOR NON-INFRINGEMENT WITH REGARD TO THE PRODUCT.\n\n19.\tLIMITATION OF LIABILITY.\n\n\ta.\t FOR ALL SOFTWARE WHETHER OR NOT AN ACTIVATION KEY IS REQUIRED\n\nEXCEPT TO THE EXTENT PROHIBITED BY LOCAL LAW, IN NO EVENT WILL HP OR ITS\nSUBSIDIARIES, AFFILIATES, DIRECTORS, OFFICERS, EMPLOYEES, AGENTS OR SUPPLIERS\nBE LIABLE FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE,\nOR OTHER DAMAGES (INCLUDING LOST PROFIT, LOST DATA, OR DOWNTIME COSTS) ARISING\nOUT OF THE USE, THE INABILITY TO USE, OR THE RESULTS OF USE OF THE PRODUCT,\nWHETHER BASED IN WARRANTY, CONTRACT, TORT OR OTHER LEGAL THEORY, AND WHETHER\nOR NOT HP WAS ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.  THE PRODUCT IS NOT\nDESIGNED, MANUFACTURED OR INTENDED FOR USE IN THE PLANNING, CONSTRUCTION,\nMAINTENANCE, OR OPERATION OF A NUCLEAR FACILITY, AIRCRAFT NAVIGATION OR\nAIRCRAFT COMMUNICATION SYSTEMS, AIR TRAFFIC CONTROL, LIFE SUPPORT MACHINES,\nOR WEAPONS SYSTEMS (COLLECTIVELY \"HIGH RISK APPLICATIONS\").  YOU ARE SOLELY\nLIABLE IF THE PRODUCT IS USED FOR HIGH RISK APPLICATIONS, AND YOU SHALL\nINDEMNIFY, DEFEND AND HOLD HP HARMLESS FROM ALL LOSS, DAMAGE, EXPENSE OR\nLIABILITY IN CONNECTION WITH SUCH USE.   YOU ASSUME THE ENTIRE RISK AS TO YOUR\nUSE OF THE PRODUCT.  SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR\nLIMITATION OF LIABILITY FOR INCIDENTIAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE\nLIMITATION MAY NOT APPLY TO YOU TO THE EXTENT PROHIBITED BY SUCH LOCAL LAWS.\n\n\tb.\tFOR SOFTWARE REQUIRING AN ACTIVATION KEY\n\nNotwithstanding any damages that You might incur for any reason whatsoever\n(including, without limitation, all damages referenced above and all direct\nor general damages), the entire liability of HP and any of its suppliers under\nany provision of this EULA and Your exclusive remedy for all of the foregoing\n(except for any remedy of repair or replacement if elected by HP with respect\nto any breach of the Limited Warranty) shall be limited to the greater of the\namount actually paid by You for the Product or U.S. $5.00.  The foregoing\nlimitations, exclusions and disclaimers (including Warranty above) shall apply\nto the maximum extent permitted by applicable law, even if any remedy fails of\nits essential purpose.\n\nREV08/51/03\tEnd User License Agreement"
}