{
  "key": "hp-ux-java",
  "short_name": "HP-UX 11i Java Technology Software",
  "name": "HP-UX 11i Java Technology Software",
  "category": "Proprietary Free",
  "owner": "HP - Hewlett Packard",
  "homepage_url": "http://www.hp.com/products1/unix/java/java2/sdkrte1_3/downloads/license_rte_1-3-1-17_pa-risc.html",
  "spdx_license_key": "LicenseRef-scancode-hp-ux-java",
  "text_urls": [
    "http://www.hp.com/products1/unix/java/java2/sdkrte1_3/downloads/license_rte_1-3-1-17_pa-risc.html"
  ],
  "ignorable_copyrights": [
    "copyrighted by HP"
  ],
  "ignorable_holders": [
    "HP"
  ],
  "text": "HP-UX Runtime Environment, for the Java(tm) 2 Platform\n\nATTENTION:  USE OF THE SOFTWARE IS SUBJECT TO THE HP SOFTWARE LICENSE TERMS\nAND SUPPLEMENTAL RESTRICTIONS SET FORTH BELOW, THIRD PARTY SOFTWARE LICENSE\nTERMS FOUND IN THE THIRDPARTYLICENSEREADME.TXT FILE AND THE WARRANTY\nDISCLAIMER ATTACHED.  IF YOU DO NOT ACCEPT THESE TERMS FULLY, YOU MAY NOT\nINSTALL OR OTHERWISE USE THE SOFTWARE.  NOTWITHSTANDING ANYTHING TO THE\nCONTRARY IN THIS NOTICE, INSTALLING OR OTHERWISE USING THE SOFTWARE INDICATES\nYOUR ACCEPTANCE OF THESE LICENSE TERMS.\n\nHP SOFTWARE LICENSE TERMS\n\nThe following terms govern your use of the Software unless you have a separate\nwritten agreement with HP.  HP has the right to change these terms and\nconditions at any time, with or without notice.\n\n\nLicense Grant\n\nHP grants you a license to Use one copy of the Software.  \"Use\" means storing,\nloading, installing, executing or displaying the Software.  You may not modify\nthe Software or disable any licensing or control features of the Software.  If\nthe Software is licensed for \"concurrent use\", you may not allow more than the\nmaximum number of authorized users to Use the Software concurrently.\n\nOwnership\n\nThe Software is owned and copyrighted by HP or its third party suppliers.\nYour license confers no title or ownership in the Software and is not a sale\nof any rights in the Software.  HPs third party suppliers may protect their\nrights in the event of any violation of these License Terms.\n\nThird Party Code\n\nSome third-party code embedded or bundled with the Software is licensed to you\nunder different terms and conditions as set forth in the\nTHIRDPARTYLICENSEREADME.txt file.  In addition to any terms and conditions of\nany third party license identified in the THIRDPARTYLICENSEREADME.txt file,\nthe disclaimer of warranty and limitation of liability provisions in this\nlicense shall apply to all code distributed as part of or bundled with the\nSoftware.\n\nSource Code\n\nSoftware may contain source code that, unless expressly licensed for other\npurposes, is provided solely for reference purposes pursuant to the terms of\nthis license.  Source code may not be redistributed unless expressly provided\nfor in these License Terms.\n\nCopies and Adaptations\n\nYou may only make copies or adaptations of the Software for archival purposes\nor when copying or adaptation is an essential step in the authorized Use of\nthe Software.  You must reproduce all copyright notices in the original\nSoftware on all copies or adaptations.  You may not copy the Software onto any\nbulletin board or similar system.\n\nNo Disassembly or Decryption\n\nYou may not disassemble or decompile the Software unless HPs prior written\nconsent is obtained.  In some jurisdictions, HPs consent may not be required\nfor disassembly or decompilation.  Upon request, you will provide HP with\nreasonably detailed information regarding any disassembly or decompilation.\nYou may not decrypt the Software unless decryption is a necessary part of the\noperation of the Software.\n\nTransfer\n\nYour license will automatically terminate upon any transfer of the Software.\nUpon transfer, you must deliver the Software, including any copies and related\ndocumentation, to the transferee.  The transferee must accept these License\nTerms as a condition to the transfer.\n\nTermination\n\nHP may terminate your license upon notice for failure to comply with any of\nthese License Terms.  Upon termination, you must immediately destroy the\nSoftware, together with all copies, adaptations and merged portions in any\nform.\n\nExport Requirements\n\nYou may not export or re-export the Software or any copy or adaptation in\nviolation of any applicable laws or regulations.\n\nThis software or any copy or adaptation may not be exported, reexported or\ntransferred to or within countries under U.S.  economic embargo including the\nfollowing countries:  Afghanistan (Taliban-controlled areas), Cuba, Iran,\nIraq, Libya, North Korea, Serbia, Sudan and Syria.  This list is subject to\nchange.\n\nThis software or any copy or adaptation may not be exported, reexported or\ntransferred to persons or entities listed on the U.S.  Department of Commerce\nDenied Parties List or on any U.S.  Treasury Department Designated Nationals\nexclusion list, or to any party directly or indirectly involved in the\ndevelopment or production of nuclear, chemical, biological weapons or related\nmissile technology programs as specified in the U.S.  Export Administration\nRegulations (15 CFR 730).\n\nU.S. Government Contracts\n\nIf the Software is licensed for use in the performance of a U.S. government\nprime contract or subcontract, you agree that, consistent with FAR 12.211 and\n12.212, commercial computer Software, computer Software documentation and\ntechnical data for commercial items are licensed under HPs standard\ncommercial license.\n\nSUPPLEMENTAL RESTRICTIONS\n\nYou acknowledge the Software is not designed or intended for use in on-line\ncontrol of aircraft, air traffic, aircraft navigation, or aircraft\ncommunications; or in the design, construction, operation or maintenance of\nany nuclear facility.  HP disclaims any express or implied warranty of fitness\nfor such uses.\n\nADDITIONAL SUPPLEMENTAL RESTRICTIONS FOR HP-UX RUNTIME ENVIRONMENT,\nFOR THE JAVA(TM) 2 PLATFORM\n\n* License to Distribute HP-UX Runtime Environment, for the Java(tm) 2\n  Platform.  You are granted a royalty-free right to reproduce and distribute\n  the HP-UX Runtime Environment, for Java provided that you distribute the\n  HP-UX Runtime Environment, for the Java 2 Platform complete and unmodified,\n  only as a part of, and for the sole purpose of running your Java compatible\n  applet or application (\"Program\") into which the HP-UX Runtime Environment,\n  for the Java 2 Platform is incorporated.\n\n* Java Platform Interface.  Licensee may not modify the Java Platform\n  Interface (\"JPI\", identified as classes contained within the \"java\" package\n  or any subpackages of the \"java\" package), by creating additional classes\n  within the JPI or otherwise causing the addition to or modification of the\n  classes in the JPI.  In the event that Licensee creates any Java-related API\n  and distributes such API to others for applet or application development,\n  Licensee must promptly publish broadly, an accurate specification for such\n  API for free use by all developers of Java-based software.\n\n* You may make the HP-UX Runtime Environment, for the Java 2 Platform\n  accessible to application programs developed by you provided that the\n  programs allow such access only through the Invocation Interface specified\n  and provided that you shall not expose or document other interfaces that\n  permit access to such HP-UX Runtime Environment, for the Java 2 Platform.\n  You shall not be restricted hereunder from exposing or documenting\n  interfaces to software components that use or access the HP-UX Runtime\n  Environment, for the Java 2 Platform.\n\n\nHP WARRANTY STATEMENT\n\nDURATION OF LIMITED WARRANTY: 90 DAYS\n\nHP warrants to you, the end customer, that HP hardware, accessories, and\nsupplies will be free from defects in materials and workmanship after the date\nof purchase for the period specified above.  If HP receives notice of such\ndefects during the warranty period, HP will, at its option, either repair or\nreplace products which prove to be defective.  Replacement products may be\neither new or equivalent in performance to new.\n\nHP warrants to you that HP Software will not fail to execute its programming\ninstructions after the date of purchase, for the period specified above, due\nto defects in materials and workmanship when properly installed and used.  If\nHP receives notice of such defects during the warranty period, HP will replace\nSoftware which does not execute its programming instructions due to such\ndefects.\n\nHP does not warrant that the operation of HP products will be uninterrupted or\nerror free.  If HP is unable, within a reasonable time, to repair or replace\nany product to a condition warranted, you will be entitled to a refund of the\npurchase price upon prompt return of the product.  Alternatively, in the case\nof HP Software, you will be entitled to a refund of the purchase price upon\nprompt delivery to HP of written notice from you confirming destruction of the\nHP Software, together with all copies, adaptations, and merged portions in any\nform.\n\nHP products may contain remanufactured parts equivalent to new in performance\nor may have been subject to incidental use.\n\nWarranty does not apply to defects resulting from: (a) improper or inadequate\nmaintenance or calibration; (b) software, interfacing, parts or supplies not\nsupplied by HP, (c) unauthorized modification or misuse; (d) operation outside\nof the published environmental specifications for the product, (e) improper\nsite preparation or maintenance, or (f) the presence of code from HP suppliers\nembedded in or bundled with any HP product.\n\nTO THE EXTENT ALLOWED BY LOCAL LAW, THE ABOVE WARRANTIES ARE EXCLUSIVE AND NO\nOTHER WARRANTY OR CONDITION, WHETHER WRITTEN OR ORAL, IS EXPRESSED OR IMPLIED\nAND HP SPECIFICALLY DISCLAIMS ANY IMPLIED WARRANTIES OR CONDITIONS OF\nMERCHANTABILITY, SATISFACTORY QUALITY, AND FITNESS FOR A PARTICULAR PURPOSE.\nSome countries, states, or provinces do not allow limitations on the duration\nof an implied warranty, so the above limitation or exclusion may not apply to\nyou.  This warranty gives you specific legal rights and you might also have\nother rights that vary from country to country, state to state, or province to\nprovince.\n\nTO THE EXTENT ALLOWED BY LOCAL LAW, THE REMEDIES IN THIS WARRANTY STATEMENT\nARE YOUR SOLE AND EXCLUSIVE REMEDIES.  EXCEPT AS INDICATED ABOVE, IN NO EVENT\nWILL HP OR ITS SUPPLIERS BE LIABLE FOR LOSS OF DATA OR FOR DIRECT, SPECIAL,\nINCIDENTAL, CONSEQUENTIAL (INCLUDING LOST PROFIT OR DATA), OR OTHER DAMAGE,\nWHETHER BASED IN CONTRACT, TORT, OR OTHERWISE.  Some countries, states, or\nprovinces do not allow the exclusion or limitation of incidental or\nconsequential damages, so the above limitation may not apply to you."
}