{
  "key": "ibm-glextrusion",
  "short_name": "IBM glextrusion License",
  "name": "IBM glextrusion License",
  "category": "Permissive",
  "owner": "IBM",
  "homepage_url": "https://github.com/linas/glextrusion/blob/master/src/COPYING.src",
  "spdx_license_key": "LicenseRef-scancode-ibm-glextrusion",
  "text_urls": [
    "https://raw.githubusercontent.com/linas/glextrusion/master/src/COPYING.src"
  ],
  "text": "This software is owned by International Business Machines Corporation\n(\"IBM\"), or its subsidiaries or IBM's suppliers, and is copyrighted and\nlicensed, not sold.  IBM retains title to the software, and grants you a\nnonexclusive license for the software.\n\nUnder this license, you may:\n\n1) use the software on one or more machines at a time;\n2) make copies of the software for use or backup purposes within your\n   enterprise;\n3) modify this software and merge it with another program; and\n4) make copies of the original file you downloaded and distribute it,\n   provided that you transfer a copy of this license to the other party.\n   The other party agrees to these terms by its first use of this software.\n\nYou must reproduce the copyright notice and any other legend of\nownership on each copy or partial copy of the software.\n\nThis software, as provided by IBM, is only intended to assist in the\ndevelopment of a working software program. The software may not function\nas written: additional code is required. In addition, the software may\nnot compile and/or bind successfully as written.\n\nIBM PROVIDES THE SOFTWARE \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER\nEXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO THE IMPLIED WARRANTIES\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK\nAS TO THE QUALITY AND PERFORMANCE OF THE SOFTWARE IS WITH YOU.  SHOULD\nANY PART OF THE SOFTWARE PROVE DEFECTIVE, YOU ASSUME THE ENTIRE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION. IN NO EVENT, UNLESS\nREQUIRED BY APPLICABLE LAW, SHALL IBM BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OR INABILITY TO USE THE SOFTWARE (INCLUDING BUT\nNOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES\nSUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE SOFTWARE TO\nOPERATE WITH ANY OTHER PROGRAMS), EVEN IF IBM HAS BEEN ADVISED IN\nADVANCE OF THE POSSIBILITY OF SUCH DAMAGES.\n\nIBM does not warrant that the contents of the software will meet your\nrequirements, that the software is error-free or that the software does\nnot infringe on any intellectual property rights of any third party.\n\nIBM may make improvements and/or changes in the software at any time.\n\nChanges may or may not be made periodically to the information in the\nsoftware; these changes may be reported, for the software included\nherein, in new editions.\n\nReferences, if any, in the software to IBM products, programs, or\nservices do not imply that IBM intends to make these available in all\ncountries in which IBM operates. Any reference to an IBM licensed\nprogram in the software is not intended to state or imply that only\nIBM's  licensed program may be used. Any functionally equivalent program\nmay be used.\n\nThe laws of New York State govern this agreement."
}