{
  "key": "info-zip-2003-05",
  "short_name": "Info-Zip License 2003-05",
  "name": "Info-Zip License 2003-05",
  "category": "Permissive",
  "owner": "info-zip",
  "homepage_url": "http://www.info-zip.org/",
  "spdx_license_key": "LicenseRef-scancode-info-zip-2003-05",
  "text_urls": [
    "http://web.archive.org/web/20030409023329/http://www.info-zip.org/doc/LICENSE",
    "http://web.archive.org/web/20030601142019/http://www.info-zip.org/license.html"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 1990-2003 Info-ZIP."
  ],
  "ignorable_holders": [
    "Info-ZIP"
  ],
  "ignorable_urls": [
    "ftp://ftp.info-zip.org/pub/infozip/license.html"
  ],
  "text": "This is version 2003-May-08 of the Info-ZIP copyright and license.\nThe definitive version of this document should be available at\nftp://ftp.info-zip.org/pub/infozip/license.html indefinitely.\n\n\nCopyright (c) 1990-2003 Info-ZIP.  All rights reserved.\n\nFor the purposes of this copyright and license, \"Info-ZIP\" is defined as\nthe following set of individuals:\n\n   Mark Adler, John Bush, Karl Davis, Harald Denker, Jean-Michel Dubois,\n   Jean-loup Gailly, Hunter Goatley, Ian Gorman, Chris Herborth, Dirk Haase,\n   Greg Hartwig, Robert Heath, Jonathan Hudson, Paul Kienitz, David Kirschbaum,\n   Johnny Lee, Onno van der Linden, Igor Mandrichenko, Steve P. Miller,\n   Sergio Monesi, Keith Owens, George Petrov, Greg Roelofs, Kai Uwe Rommel,\n   Steve Salisbury, Dave Smith, Christian Spieler, Antoine Verheijen,\n   Paul von Behren, Rich Wales, Mike White\n\nThis software is provided \"as is,\" without warranty of any kind, express\nor implied.  In no event shall Info-ZIP or its contributors be held liable\nfor any direct, indirect, incidental, special or consequential damages\narising out of the use of or inability to use this software.\n\nPermission is granted to anyone to use this software for any purpose,\nincluding commercial applications, and to alter it and redistribute it\nfreely, subject to the following restrictions:\n\n    1. Redistributions of source code must retain the above copyright notice,\n       definition, disclaimer, and this list of conditions.\n\n    2. Redistributions in binary form (compiled executables) must reproduce\n       the above copyright notice, definition, disclaimer, and this list of\n       conditions in documentation and/or other materials provided with the\n       distribution.  The sole exception to this condition is redistribution\n       of a standard UnZipSFX binary (including SFXWiz) as part of a\n       self-extracting archive; that is permitted without inclusion of this\n       license, as long as the normal SFX banner has not been removed from\n       the binary or disabled.\n\n    3. Altered versions--including, but not limited to, ports to new operating\n       systems, existing ports with new graphical interfaces, and dynamic,\n       shared, or static library versions--must be plainly marked as such\n       and must not be misrepresented as being the original source.  Such\n       altered versions also must not be misrepresented as being Info-ZIP\n       releases--including, but not limited to, labeling of the altered\n       versions with the names \"Info-ZIP\" (or any variation thereof, including,\n       but not limited to, different capitalizations), \"Pocket UnZip,\" \"WiZ\"\n       or \"MacZip\" without the explicit permission of Info-ZIP.  Such altered\n       versions are further prohibited from misrepresentative use of the\n       Zip-Bugs or Info-ZIP e-mail addresses or of the Info-ZIP URL(s).\n\n    4. Info-ZIP retains the right to use the names \"Info-ZIP,\" \"Zip,\" \"UnZip,\"\n       \"UnZipSFX,\" \"WiZ,\" \"Pocket UnZip,\" \"Pocket Zip,\" and \"MacZip\" for its\n       own source and binary releases."
}