{
  "key": "intel-acpi",
  "short_name": "Intel ACPI SLA",
  "name": "Intel ACPI Software License Agreement",
  "category": "Permissive",
  "owner": "Intel Corporation",
  "homepage_url": "https://fedoraproject.org/wiki/Licensing/Intel_ACPI_Software_License_Agreement",
  "notes": "Per Fedora, this license is no longer available at its original URL\nhttp://www.intel.com/technology/iapc/acpi/license2.htm. A copy was taken\nfrom the last available version at archive.org.\n",
  "spdx_license_key": "Intel-ACPI",
  "ignorable_copyrights": [
    "Copyright (c) 1999-2005, Intel Corp."
  ],
  "ignorable_holders": [
    "Intel Corp."
  ],
  "text": "ACPI - Software License Agreement\n\nSoftware License Agreement IMPORTANT - READ BEFORE COPYING, INSTALLING\nOR USING.\n\nDo not use or load this software and any associated materials\n(collectively, the \"Software\") until you have carefully read the\nfollowing terms and conditions. By loading or using the Software, you\nagree to the terms of this Agreement. If you do not wish to so agree, do\nnot install or use the Software.\n\n1. COPYRIGHT NOTICE Some or all of this work - Copyright © 1999-2005,\nIntel Corp. All rights reserved.\n\n2. LICENSE\n\n2.1. This is your license from Intel Corp. under its intellectual\nproperty rights. You may have additional license terms from the party\nthat provided you this software, covering your right to use that party's\nintellectual property rights.\n\n2.2. Intel grants, free of charge, to any person (\"Licensee\") obtaining\na copy of the source code appearing in this file (\"Covered Code\") an\nirrevocable, perpetual, worldwide license under Intel's copyrights in\nthe base code distributed originally by Intel (\"Original Intel Code\") to\ncopy, make derivatives, distribute, use and display any portion of the\nCovered Code in any form, with the right to sublicense such rights; and\n\n2.3. Intel grants Licensee a non-exclusive and non-transferable patent\nlicense (with the right to sublicense), under only those claims of Intel\npatents that are infringed by the Original Intel Code, to make, use,\nsell, offer to sell, and import the Covered Code and derivative works\nthereof solely to the minimum extent necessary to exercise the above\ncopyright license, and in no event shall the patent license extend to\nany additions to or modifications of the Original Intel Code. No other\nlicense or right is granted directly or by implication, estoppel or\notherwise; The above copyright and patent license is granted only if the\nfollowing conditions are met:\n\n3. CONDITIONS\n\n3.1. Redistribution of Source with Rights to Further Distribute Source.\nRedistribution of source code of any substantial portion of the Covered\nCode or modification with rights to further distribute source must\ninclude the above Copyright Notice, the above License, this list of\nConditions, and the following Disclaimer and Export Compliance\nprovision. In addition, Licensee must cause all Covered Code to which\nLicensee contributes to contain a file documenting the changes Licensee\nmade to create that Covered Code and the date of any change. Licensee\nmust include in that file the documentation of any changes made by any\npredecessor Licensee. Licensee must include a prominent statement that\nthe modification is derived, directly or indirectly, from Original Intel\nCode.\n\n3.2. Redistribution of Source with no Rights to Further Distribute\nSource. Redistribution of source code of any substantial portion of the\nCovered Code or modification without rights to further distribute source\nmust include the following Disclaimer and Export Compliance provision in\nthe documentation and/or other materials provided with distribution. In\naddition, Licensee may not authorize further sublicense of source of any\nportion of the Covered Code, and must include terms to the effect that\nthe license from Licensee to its licensee is limited to the intellectual\nproperty embodied in the software Licensee provides to its licensee, and\nnot to intellectual property embodied in modifications its licensee may\nmake.\n\n3.3. Redistribution of Executable. Redistribution in executable form of\nany substantial portion of the Covered Code or modification must\nreproduce the above Copyright Notice, and the following Disclaimer and\nExport Compliance provision in the documentation and/or other materials\nprovided with the distribution.\n\n3.4. Intel retains all right, title, and interest in and to the Original\nIntel Code.\n\n3.5. Neither the name Intel nor any other trademark owned or controlled\nby Intel shall be used in advertising or otherwise to promote the sale,\nuse or other dealings in products derived from or relating to the\nCovered Code without prior written authorization from Intel.\n\n4. DISCLAIMER AND EXPORT COMPLIANCE\n\n4.1. INTEL MAKES NO WARRANTY OF ANY KIND REGARDING ANY SOFTWARE PROVIDED\nHERE. ANY SOFTWARE ORIGINATING FROM INTEL OR DERIVED FROM INTEL SOFTWARE\nIS PROVIDED \"AS IS,\" AND INTEL WILL NOT PROVIDE ANY SUPPORT, ASSISTANCE,\nINSTALLATION, TRAINING OR OTHER SERVICES. INTEL WILL NOT PROVIDE ANY\nUPDATES, ENHANCEMENTS OR EXTENSIONS. INTEL SPECIFICALLY DISCLAIMS ANY\nIMPLIED WARRANTIES OF MERCHANTABILITY, NONINFRINGEMENT AND FITNESS FOR A\nPARTICULAR PURPOSE.\n\n4.2. IN NO EVENT SHALL INTEL HAVE ANY LIABILITY TO LICENSEE, ITS\nLICENSEES OR ANY OTHER THIRD PARTY, FOR ANY LOST PROFITS, LOST DATA,\nLOSS OF USE OR COSTS OF PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, OR\nFOR ANY INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THIS\nAGREEMENT, UNDER ANY CAUSE OF ACTION OR THEORY OF LIABILITY, AND\nIRRESPECTIVE OF WHETHER INTEL HAS ADVANCE NOTICE OF THE POSSIBILITY OF\nSUCH DAMAGES. THESE LIMITATIONS SHALL APPLY NOTWITHSTANDING THE FAILURE\nOF THE ESSENTIAL PURPOSE OF ANY LIMITED REMEDY.\n\n4.3. Licensee shall not export, either directly or indirectly, any of\nthis software or system incorporating such software without first\nobtaining any required license or other approval from the U. S.\nDepartment of Commerce or any other agency or department of the United\nStates Government. In the event Licensee exports any such software from\nthe United States or re-exports any such software from a foreign\ndestination, Licensee shall ensure that the distribution and export/re-\nexport of the software is in compliance with all laws, regulations,\norders, or other restrictions of the U.S. Export Administration\nRegulations. Licensee agrees that neither it nor any of its subsidiaries\nwill export/re-export any technical data, process, software, or service,\ndirectly or indirectly, to any country for which the United States\ngovernment or any agency thereof requires an export license, other\ngovernmental approval, or letter of assurance, without first obtaining\nsuch license, approval or letter."
}