{
  "key": "intel",
  "short_name": "Intel Limited Patent License",
  "name": "Intel Limited Patent License",
  "category": "Proprietary Free",
  "owner": "Intel Corporation",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.IntcSST2",
  "spdx_license_key": "LicenseRef-scancode-intel",
  "text_urls": [
    "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.adsp_sst"
  ],
  "other_urls": [
    "http://web.archive.org/web/20060924155349/http://www.mepis.org/node/10358"
  ],
  "ignorable_urls": [
    "http://opensource.org/licenses"
  ],
  "text": "Redistribution.\nRedistribution and use in binary form, without modification, are\npermitted provided that the following conditions are met:\n\nRedistributions must reproduce the above copyright notice and the\nfollowing disclaimer in the documentation and/or other materials\nprovided with the distribution.\n\nNeither the name of Intel Corporation\nnor the names of its suppliers may be used to endorse or promote\nproducts derived from this software without specific prior written\npermission.\n\nNo reverse engineering, decompilation, or disassembly of this\nsoftware is permitted.\n\nLimited patent license. Intel Corporation grants a world-wide,\nroyalty-free, non-exclusive license under patents it now or hereafter\nowns or controls to make, have made, use, import, offer to sell and\nsell (\"Utilize\") this software, but solely to the extent that any\nsuch patent is necessary to Utilize the software alone, or in\ncombination with an operating system licensed under an approved Open\nSource license as listed by the Open Source Initiative at\nhttp://opensource.org/licenses.  The patent license shall not apply to\nany other combinations which include this software.  No hardware per\nse is licensed hereunder.\n\nDISCLAIMER.  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND \nCONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, \nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND \nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE \nCOPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, \nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, \nBUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS \nOF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND \nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR \nTORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE \nUSE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH \nDAMAGE."
}