{
  "key": "ipca",
  "short_name": "IPCA",
  "name": "IPFire Project Contributor Agreement",
  "category": "CLA",
  "owner": "IPFire",
  "homepage_url": "https://wiki.ipfire.org/legal/ipca",
  "spdx_license_key": "LicenseRef-scancode-ipca",
  "other_urls": [
    "https://www.ipfire.org/legal"
  ],
  "ignorable_urls": [
    "http://creativecommons.org/licenses/by-sa/3.0/legalcode",
    "http://wiki.ipfire.org/en/legal/licenses",
    "https://opensource.org/licenses/MIT"
  ],
  "ignorable_emails": [
    "legal@ipfire.org"
  ],
  "text": "The IPFire Project Contributor Agreement\n\nGoal\n----\n\nWe require that contributors to IPFire (as defined below) agree to\nthis IPFire Project Contributor Agreement (IPCA) to ensure that\ncontributions to IPFire have acceptable licensing terms.\n\nNon-Goals\n---------\n\nThe IPCA is not a copyright assignment agreement.\n\nThe IPCA does not somehow supersede the existing licensing terms\nthat apply to IPFire contributions. There are two important subpoints\nhere. First, the IPCA does not apply to upstream code (or other\nmaterial) that you didn't write; indeed, it would be preposterous for\nit to attempt to do so. Note the narrow way in which we have defined\ncapital-c \"Contribution\". Second, the main provision of the IPCA\nspecifies that a default license will apply to code that you wrote,\nbut only to the extent that you have not bothered to put an explicit\nlicense on it. Therefore, the IPCA is not some sort of special\npermissive license granted to any party, despite the explicit choice\nof a more restrictive license by you or by upstream developers.\n\nTerms\n-----\n\n0. Definitions.\n\n\"Acceptable License For IPFire\" means a license selected from the\nappropriate categorical sublist of the full list of acceptable\nlicenses for IPFire, currently located at\nhttp://wiki.ipfire.org/en/legal/licenses, as that list may be revised\nfrom time to time by the IPFire Core Developers. \"Acceptable Licenses\nFor IPFire\" means that full list.\n\n\"CC-BY-SA\" means the Creative Commons Attribution-ShareAlike 3.0\nUnported license, as published at\n<http://creativecommons.org/licenses/by-sa/3.0/legalcode>.\n\n\"Code\" means (i) software code, (ii) any other functional material\nwhose principal purpose is to control or facilitate the building of\npackages, such as a Pakfire makefile, (iii) font files, and (iv) other\nkinds of copyrightable material that the IPFire Core Developers has\nclassified as \"code\" rather than \"content\".\n\n\"Content\" means any copyrightable material that is not Code, such as,\nwithout limitation, (i) non-functional data sets, (ii) documentation,\n(iii) wiki edits, (iv) music files, (v) graphic image files, (vi) help\nfiles, and (vii) other kinds of copyrightable material that the IPFire\nCore Developers has classified as \"content\" rather than \"code\".\n\n\"Contribution\" means a Work that You created, excluding any portion\nthat was created by someone else. (For example, if You Submit a\npackage to IPFire, the Pakfire Makefile You write may be a Contribution,\nbut all the upstream code in the associated Source Package that You did not\nwrite is not a Contribution for purposes of this IPCA.)\nA Contribution consists either of Code or of Content.\n\n\"Current Default License\", with respect to a Contribution, means (i)\nif the Contribution is Code, the MIT License, and (ii) if the\nContribution is Content, CC-BY-SA supplemented by Moral Rights Clause\nWaiver and GPL Relicensing Permission.\n\n\"IPFire\" means the community project led by the IPFire Core Developers.\n\n\"IPFire Community\" means (i) all IPFire participants, and (ii) all\npersons receiving Contributions directly or indirectly from or through\nIPFire.\n\n\"GPL\" means the GNU General Public License, version 2 or any later\nversion published by the Free Software Foundation, or the GNU Affero\nGeneral Public License, version 3 or any later version published by\nthe Free Software Foundation.\n\n\"GPL-Covered Derivative\" of a Contribution means an adaptation or\nderivative work of the Contribution, or a compilation that includes\nthe Contribution (or such adaptation or derivative work), where such\nadaptation, derivative work, or compilation, if distributed or made\navailable to the public, would be required to be licensed under the\nGPL because it is based on or includes a Work governed by the GPL.\n\n\"GPL Relicensing Permission\", with respect to a Contribution licensed\nunder CC-BY-SA, means a grant of additional copyright permission to\ndistribute or make available to the public a copy of a GPL-Covered\nDerivative of the Contribution under the terms of the applicable\nversion of the GPL, with no conditions of CC-BY-SA that would be\ntreated as \"further restrictions\" within the meaning of the applicable\nversion of the GPL surviving such distribution with respect to that\ncopy.\n\n\"Licensed\" means covered by explicit licensing terms that are\nconspicuous and readily discernible to recipients.\n\n\"MIT License\" means the license identified as \"Modern Style with\nsublicense\" at <https://opensource.org/licenses/MIT>.\n\n\"Moral Rights Clause Waiver\" means a waiver of the right to enforce,\nand an agreement not to assert, Section 4d of CC-BY-SA against the\nIPFire Community, to the fullest extent permitted by applicable law.\n\n\"Submit\" means to use some mode of digital communication (for example,\nwithout limitation, mailing lists, bug tracking systems, and source\ncode version control systems administered by IPFire) to voluntarily\nprovide a Contribution to IPFire.\n\n\"Unlicensed\" means not Licensed.\n\n\"Work\" means a copyrightable work of authorship. A Work may be a\nportion of a larger Work, and a Work may be a modification of or\naddition to another Work.\n\n\"You\" means the individual accepting this instance of the IPCA.\n\n1. Copyright Permission Required for All Contributions.\n\nIf You are not the copyright holder of a given Contribution that You\nwish to Submit to IPFire (for example, if Your employer or university\nholds copyright in it), it is Your responsibility to first obtain\nauthorization from the copyright holder to Submit the Contribution\nunder the terms of this IPCA on behalf of, or otherwise with the\npermission of, that copyright holder. One form of such authorization\nis for the copyright holder to place, or permit You to place, an\nAcceptable License For IPFire on the Contribution.\n\n2. Licensed Contributions.\n\nIf Your Contribution is Licensed, Your Contribution will be governed\nby the terms under which it has been licensed.\n\n3. Default Licensing of Unlicensed Contributions.\n\nIf You Submit an Unlicensed Contribution to IPFire, the license to the\nIPFire Community for that Contribution shall be the Current Default\nLicense.\n\nThe IPFire Core Developers may, by public announcement, subsequently\ndesignate an additional or alternative default license for a given\ncategory of Contribution (a \"Later Default License\"). A Later Default\nLicense shall be chosen from the appropriate categorical sublist of\nAcceptable Licenses For IPFire.\n\nOnce a Later Default License has been designated, Your Unlicensed\nContribution shall also be licensed to the IPFire Community under that\nLater Default License. Such designation shall not affect the\ncontinuing applicability of the Current Default License to Your\nContribution.\n\nYou consent to having IPFire provide reasonable notice of Your\nlicensing of Your Contribution under the Current Default License (and,\nif applicable, a Later Default License) in a manner determined by\nIPFire.\n\n4. Public Domain United States Government Works.\n\nSections 1 through 3 of this IPCA do not apply to any Contribution to\nthe extent that it is a work of the United States Government for which\ncopyright is unavailable under 17 U.S.C. 105.\n\n5. Acceptance.\n\nYou must signify Your assent to the terms of this IPCA through\nspecific electronic means established by IPFire (such as by\nclick-through acceptance means).\n\nYou may also, at Your option, and without eliminating the requirement\nset forth in the preceding paragraph, send a copy of this IPCA,\nbearing Your written signature indicating Your acceptance of its\nterms, by email to legal@ipfire.org, by fax to +49 2363 6035 9\nor by postal mail to:\n\nIPFire Legal Team\nc/o Michael Tremer\nGerhardstraße 8\n45711 Datteln\nGERMANY"
}