{
  "key": "irfanview-eula",
  "short_name": "IrfanView EULA",
  "name": "IrfanView EULA",
  "category": "Commercial",
  "owner": "Irfan Skiljan",
  "homepage_url": "http://www.irfanview.com/eula.htm",
  "spdx_license_key": "LicenseRef-scancode-irfanview-eula",
  "ignorable_copyrights": [
    "Copyright (c) 2016 by Irfan Skiljan, Wiener Neustadt, Austria"
  ],
  "ignorable_holders": [
    "Irfan Skiljan, Wiener Neustadt, Austria"
  ],
  "ignorable_urls": [
    "http://www.irfanview.com/",
    "http://www.irfanview.net/"
  ],
  "ignorable_emails": [
    "irfanview@gmx.net"
  ],
  "text": "IrfanView Software License Agreement. \n\nThis is a legal agreement between you and IrfanView Software (Irfan Skiljan) covering your use of IrfanView (the \"Software\"). \n\n1) IrfanView is provided as freeware, but only for private, non-commercial use (that means at home). \n\n1a) IrfanView is free for educational use (schools, universities, museums and libraries) and for use in charity or humanitarian organisations. \n\n1b) If you intend to use IrfanView at your place of business or for commercial purposes, please register and purchase it.\nCommercial users: please contact me by E-Mail for prices, discounts and payment methods. \n\n1c) If you buy IrfanView license(s), Irfanview hereby grants to you a perpetual, worldwide, fully paid-up, non-exclusive license to use the Software solely for your internal business purposes. \n\n2) IrfanView Software is owned by Irfan Skiljan and is protected by copyright laws\nand international treaty provisions. Therefore, you must treat the Software like any other\ncopyrighted material. \n\n3) You may not distribute, rent, sub-license or otherwise make available to others the Software\nor documentation or copies thereof, except as expressly permitted in this License without prior\nwritten consent from IrfanView (Irfan Skiljan). In the case of an authorized transfer, the\ntransferee must agree to be bound by the terms and conditions of this License Agreement. \n\n4) You may not remove any proprietary notices, labels, trademarks on the Software or\ndocumentation. You may not modify, de-compile, disassemble or reverse engineer the Software. \n\n5) Limited warranty: IrfanView, IrfanView PlugIns and documentation are \"as is\" without any\nwarranty as to their performance, merchantability or fitness for any particular purpose.\nThe licensee assumes the entire risk as to the quality and performance of the software.\nIn no event shall IrfanView or anyone else who has been involved in the creation, development,\nproduction, or delivery of this software be liable for any direct, incidental or consequential\ndamages, such as, but not limited to, loss of anticipated profits, benefits, use, or data resulting\nfrom the use of this software, or arising out of any breach of warranty. \n\nCopyright (C) 2016 by Irfan Skiljan, Wiener Neustadt, Austria. \n\nInternet: http://www.irfanview.com, http://www.irfanview.net \nEmail: irfanview@gmx.net \n\nAll rights reserved."
}