{
  "key": "ja-sig",
  "short_name": "JA-SiG License",
  "name": "JA-SiG License",
  "category": "Permissive",
  "owner": "JA-SIG Collaborative",
  "homepage_url": "http://web.archive.org/web/20040402030132/http://uportal.org/license.html",
  "notes": "this is an old and rare license, replaced since by an Apache 2.0. This is a\nBSD variant. See original at\nhttp://web.archive.org/web/20040402030132/http://uportal.org/license.html\n",
  "spdx_license_key": "LicenseRef-scancode-ja-sig",
  "ignorable_authors": [
    "the JA-SIG Collaborative (http://www.ja-sig.org/)"
  ],
  "ignorable_urls": [
    "http://www.ja-sig.org/"
  ],
  "text": "Redistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n\n3. Redistributions of any form whatsoever must retain the following\nacknowledgment:\n\"This product includes software developed by the JA-SIG Collaborative \n(http://www.ja-sig.org/).\"\n\nThis software is provided by the JA-SIG collaborative \"as is\" and any expressed\nor implied warranties, including, but not limited to, the implied warranties of\nmerchantability and fitness for a particular purpose are disclaimed. In no event\nshall the JA-SIG collaborative or its contributors be liable for any direct,\nindirect, incidental, special, exemplary, or consequential damages (including,\nbut not limited to, procurement of substitute goods or services; loss of use,\ndata, or profits; or business interruption) however caused and on any theory of\nliability, whether in contract, strict liability, or tort (including negligence\nor otherwise) arising in any way out of the use of this software, even if\nadvised of the possibility of such damage."
}