{
  "key": "jahia-1.3.1",
  "short_name": "JCSL 1.3.1",
  "name": "Jahia Collaborative Source License v1.3.1",
  "category": "Copyleft",
  "owner": "JAHIA Community",
  "homepage_url": "http://www.jahia.org/cms/home/Jahiapedia/Jahia_Licensing",
  "spdx_license_key": "LicenseRef-scancode-jahia-1.3.1",
  "text_urls": [
    "http://www.jahia.org/cms/home/Jahiapedia/Jahia_Licensing"
  ],
  "faq_url": "http://www.jahia.org/cms/home/Jahiapedia/Jahia_Licensing",
  "ignorable_urls": [
    "http://www.collaborativesource.org/",
    "http://www.jahia.org/",
    "http://www.opensource.org/"
  ],
  "text": "***** Jahia Collaborative Source License *****\n    * Recitals\n      JAHIA COLLABORATVE SOURCE LICENSE\n      Version 1.3.1\n      (Rev. Date May 17, 2004)\n\n      RECITALS\n\n      Original Contributor has developed Specifications and Source Code\n      implementations of certain Technology; and\n      Original Contributor desires to license the Technology to a large\n      community to facilitate research, innovation and product development\n      while maintaining compatibility of such products with the Technology as\n      delivered by Original Contributor; and\n      You desire to license the Technology from Original Contributor on the\n      terms and conditions specified in this License.\n      In consideration of the mutual covenants contained herein, You and\n      Original Contributor agree as follows:\n\n***** Research and Development Use *****\n      1. Introduction. The JAHIA Collaborative Source License and effective\n      attachments (\"License\") may include three distinct licenses: 1) Research\n      and Development Use, 2) Internal Deployment Use, 3) Contribution\n      Agreement. The Research and Development Use license is effective when You\n      execute this License. You have agreed to the terms of the JCSL by\n      selecting the \"Accept\" button at the end of the JCSL or executing a\n      hardcopy JCSL with Original Contributor.\n\n      The Internal Deployment Use (Attachment C) and the Contribution Agreement\n      (Attachment D) must be signed by You and Original Contributor in order to\n      become effective. Once effective, these licenses and the associated\n      requirements and responsibilities are cumulative. Capitalized terms used\n      in this License are defined in the Glossary.\n\n      2. License Grants.\n\n      2.1. Original Contributor Grant. Subject to Your compliance with Sections\n      3, 8.10 and Attachment A of this License, Original Contributor grants to\n      You a worldwide, royalty-free, non-exclusive license, to the extent of\n      Original Contributor's Intellectual Property Rights covering the Original\n      Code, Upgraded Code and Specifications, to do the following:\n\n      a) Research and Development Use License:\n      (i) use, reproduce and modify the Original Code, Upgraded Code and\n      Specifications to create Modifications and Reformatted Specifications for\n      Research and Development Use by You,\n      (ii) publish and display Original Code, Upgraded Code and Specifications\n      with, or as part of Modifications, as permitted under Section 3.1 b)\n      below,\n      (iii) reproduce and distribute copies of Original Code and Upgraded Code\n      with, or as part of Modifications, to other Licensees and students for\n      Research and Development Use by You,\n      (iv) compile, reproduce and distribute Original Code and Upgraded Code\n      with, or as part of Modifications, in Executable form, and Reformatted\n      Specifications to anyone for Research and Development Use by You.\n      b) Other than the licenses expressly granted in this License, Original\n      Contributor retains all right, title, and interest in Original Code and\n      Upgraded Code and Specifications.\n\n      2.2. Your Grants.\n\n      a) To Other Licensees. You hereby grant to each Licensee a license to\n      Your Error Corrections and Shared Modifications, of the same scope and\n      extent as Original Contributor's licenses under Section 2.1 a) above\n      relative to Research and Development Use, Attachment C relative to\n      Internal Deployment Use, and Attachment D relative to Contribution in\n      kind.\n\n      b) To Original Contributor. You hereby grant to Original Contributor a\n      worldwide, royalty-free, non-exclusive, perpetual and irrevocable\n      license, to the extent of Your Intellectual Property Rights covering Your\n      Error Corrections, Shared Modifications and Reformatted Specifications,\n      to use, reproduce, modify, display and distribute Your Error Corrections,\n      Shared Modifications and Reformatted Specifications, in any form,\n      including the right to sublicense such rights through multiple tiers of\n      distribution.\n      c) Other than the licenses expressly granted in Sections 2.2 a) and b)\n      above, and the restriction set forth in Section 3.1 d) (iv) below, You\n      retain all right, title, and interest in Your Error Corrections, Shared\n      Modifications and Reformatted Specifications.\n\n      2.3. Contributor Modifications. You may use, reproduce, modify, display\n      and distribute Contributor Error Corrections, Shared Modifications and\n      Reformatted Specifications, obtained by You under this License, to the\n      same scope and extent as with Original Code, Upgraded Code and\n      Specifications.\n\n      2.4. Subcontracting Error Corrections or Shared Modifications. You may\n      deliver the Source Code of Community Code to other Licensees having at\n      least a Research and Development Use license, for the purpose of\n      furnishing development services to You in connection with Your rights\n      granted in this License. All such Licensees must execute appropriate\n      documents with respect to such work consistent with the terms of this\n      License, and acknowledging their work-made-for-hire status or assigning\n      exclusive right to the work product and associated Intellectual Property\n      Rights to You.\n\n      3. Requirements and Responsibilities.\n\n      3.1. Research and Development Use License. As a condition of exercising\n      the rights granted under Section 2.1 a) above, You agree to comply with\n      the following:\n\n      a) Your Contribution to the Community. All Error Corrections and Shared\n      Modifications which You create or contribute to are automatically subject\n      to the licenses granted under Section 2.2 above. You are encouraged to\n      license all of Your other Modifications under Section 2.2 as Shared\n      Modifications, but are not required to do so. You agree to notify\n      Original Contributor of any errors in the Specification.\n\n      b) Source Code Availability. You agree to provide all Your Error\n      Corrections to Original Contributor as soon as reasonably practicable\n      and, in any event, prior to Internal Deployment Use or Commercial Use, if\n      applicable. Original Contributor may, at its discretion, post Source Code\n      for Your Error Corrections and Shared Modifications on the Community Web\n      Server. You may also post Error Corrections and Shared Modifications on a\n      web-server of Your choice; provided, that You inform the Original\n      Contributor and that You must take reasonable precautions to ensure that\n      only Licensees have access to such Error Corrections and Shared\n      Modifications. Such precautions shall include, without limitation and at\n      least, a click-on, download certification of Licensee status required of\n      those attempting to download from the server. An example of an acceptable\n      certification is attached as Attachment A-2.\n\n      c) Notices. All Error Corrections and Shared Modifications You create or\n      contribute to must include a file documenting the additions and changes\n      You made and the date of such additions and changes. If it is not\n      possible to put the notice in a particular Source Code file due to its\n      structure, then You must include the notice in a location (such as a\n      relevant directory file), where a recipient would be most likely to look\n      for such a notice.\n\n      d) Redistribution.\n      (i) Community Code. Community Code may be distributed in Source Code or\n      Executable form to anybody that accepts the JCSL License conditions and\n      becomes a licensee. You may not offer or impose any terms on any\n      Community Code that alter the rights, requirements, or responsibilities\n      of such Licensee.\n      (ii) Community Code Compatibility. All Community Code must be Compliant\n      Community Code prior to any Redistribution, whether originating from You\n      or acquired from a third party. So if You plan to make any further Shared\n      Modifications to any Community Code previously determined to be Compliant\n      Community Code, you must ensure that it continues to be Compliant\n      Community Code.\n      (iii) Derivative Work. If You make any non shared Modifications to any\n      Community Code without contributing them as Shared Modifications, You\n      must clearly indicate that your distribution is a modified version of the\n      official Community Code and must clearly remind to your Licensees that\n      they also have to accept the JCSL License conditions on your Derivative\n      Work.\n      (iv) Modified Executable. You may distribute Executable version(s) of a\n      Derivative Work to Licensees and other third parties only for the purpose\n      of evaluation and comment in connection with Research and Development Use\n      by You. You must ensure that the Executable distribution based on a\n      Derivative Work carries a different mark than the JAHIA Trademarks. You\n      may distribute a Derivative Work under a license of Your choice, which\n      may contain terms different from this License, provided (a) that You are\n      in compliance with the terms of this License, and (b) You must make it\n      absolutely clear that any terms which differ from this License are\n      offered by You alone, not by Original Contributor or any other\n      Contributor. Any other type of use must be subject to the execution of a\n      complementary license agreement by You and Original Contributor.\n      (v) Modified Class, Interface and Package Naming. In connection with\n      Research and Development Use by You only, You may use Original\n      Contributor's class, interface and package names only to accurately\n      reference or invoke the Source Code files You modify. Original\n      Contributor grants to You a limited license to the extent necessary for\n      such purposes.\n      (vi) Copyrights and other Attribution Notices. You must retain, in the\n      Source form of any Derivative Works that You distribute, all copyright,\n      patent, trademark, and attribution notices from Community Code, excluding\n      those notices that do not pertain to any part of the Derivative Works.\n      You may add Your own copyright statement to Your Modifications.\n\n      (vii) You expressly agree that any distribution, in whole or in part, of\n      Modifications developed by You shall only be done pursuant to the terms\n      and conditions of this License.\n\n      e) Extensions.\n      (i) Community Code. You may not include any Source Code of Community Code\n      in any Extensions without the prior consent of the Original Contributor;\n      (ii) Open. You agree to refrain from enforcing any Intellectual Property\n      Rights You may have covering any interface(s) of Your Extension, which\n      would prevent the implementation of such interface(s) by Original\n      Contributor or any Licensee. This obligation does not prevent You from\n      enforcing any Intellectual Property Right You have that would otherwise\n      be infringed by an implementation of Your Extension.\n      (iii) Class, Interface and Package Naming. You may not add any packages,\n      or any public or protected classes or interfaces with names that\n      originate or might appear to originate from Original Contributor\n      including, without limitation, package or class names which begin with\n      \"com.jahia\", org.jahia or its equivalents in any subsequent class,\n      interface and/ or package naming convention adopted by Original\n      Contributor. It is specifically suggested that You name any new packages\n      using the \"Unique Package Naming Convention\" as described in \"The Java\n      Language Specification\" by James Gosling, Bill Joy, and Guy Steele, ISBN\n      0-201-63451-1, August 1996. Section 7.7 \"Unique Package Names\", on page\n      125 of this specification which states, in part:\n      \"You form a unique package name by first having (or belonging to an\n      organization that has) an Internet domain name, such as \"sun.com\". You\n      then reverse the name, component by component, to obtain, in this\n      example, \"com.sun\", and use this as a prefix for Your package names,\n      using a convention developed within Your organization to further\n      administer package names.\"\n\n      3.2. Additional Requirements and Responsibilities. Any additional\n      requirements and responsibilities relating to the Technology are listed\n      in Attachment F (Additional Requirements and Responsibilities), if\n      applicable only, and are hereby incorporated into this Section 3.\n\n      4. Versions of the License.\n\n      4.1. License Versions. Original Contributor may publish revised versions\n      of the License from time to time. Each version will be given a\n      distinguishing version number.\n\n      4.2. Effect. Once a particular version of Community Code has been\n      provided under a version of the License, You may always continue to use\n      such Community Code under the terms of that version of the License. You\n      may also choose to use such Community Code under the terms of any\n      subsequent version of the License. No one other than Original Contributor\n      has the right to promulgate License versions.\n\n      4.3. Conditional Open Sourcing : If Original Contributor decides to stop\n      supporting a collaborative source compliant license policy as defined by\n      the Collaborative Source Initiative (www.collaborativesource.org), goes\n      bankrupt or does not want to adjust this license consequently, Original\n      Contributor shall release the last version available under a\n      collaborative source license under an open source license of his choice\n      as defined by the Open Source Initiative (www.opensource.org).\n\n      5. Disclaimer of Warranty.\n\n      5.1. COMMUNITY CODE IS PROVIDED UNDER THIS LICENSE \"AS IS,\" WITHOUT\n      WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT\n      LIMITATION, WARRANTIES THAT THE COMMUNITY CODE IS FREE OF DEFECTS,\n      MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. YOU AGREE\n      TO BEAR THE ENTIRE RISK IN CONNECTION WITH YOUR USE AND DISTRIBUTION OF\n      COMMUNITY CODE UNDER THIS LICENSE. THIS DISCLAIMER OF WARRANTY\n      CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COMMUNITY\n      CODE IS AUTHORIZED HEREUNDER EXCEPT SUBJECT TO THIS DISCLAIMER.\n\n      5.2. You acknowledge that Original Code, Upgraded Code and Specifications\n      are not designed or intended for use in (i) on-line control of aircraft,\n      air traffic, aircraft navigation or aircraft communications; or (ii) in\n      the design, construction, operation or maintenance of any nuclear\n      facility. Original Contributor disclaims any express or implied warranty\n      of fitness for such uses.\n\n      6. Termination.\n\n      6.1. By You. You may terminate this Research and Development Use license\n      at any time.\n\n      6.2. By Original Contributor. This License and the rights granted\n      hereunder will terminate:\n      (i) automatically if You fail to comply with the terms of this License\n      and fail to cure such breach within 30 days of receipt of written notice\n      of the breach;\n      (ii) immediately in the event of circumstances specified in Sections 7.1\n      or 8.4; or\n      (iii) at Original Contributor's discretion upon any action initiated in\n      the first instance by You alleging that use or distribution by Original\n      Contributor or any Licensee, of Original Code, Upgraded Code, Error\n      Corrections or Shared Modifications contributed by You, or\n      Specifications, infringe a patent owned or controlled by You.\n\n      6.3. Effect of Termination. Upon termination, You agree to discontinue\n      use and return or destroy all copies of Community Code in your\n      possession. All sublicenses to the Community Code which you have properly\n      granted shall survive any termination of this License. Provisions which,\n      by their nature, should remain in effect beyond the termination of this\n      License shall survive including, without limitation, Sections 2.2, 3, 5,\n      7 and 8.\n\n      6.4. Each party waives and releases the other from any claim to\n      compensation or indemnity for permitted or lawful termination of the\n      business relationship established by this License.\n\n      7. Liability.\n\n      7.1. Infringement. Should any of the Original Code, Upgraded Code or\n      Specifications (\"Materials\") become the subject of a claim of\n      infringement, Original Contributor may, at its sole option, (i) attempt\n      to procure the rights necessary for You to continue using the Materials,\n      (ii) modify the Materials so that they are no longer infringing, or (iii)\n      terminate Your right to use the infringing code, immediately upon written\n      notice, while retaining your rights to continue using the Materials that\n      are not the subject of a claim of infringement.\n\n      7.2. LIMITATION OF LIABILITY. TO THE FULL EXTENT ALLOWED BY APPLICABLE\n      LAW, ORIGINAL CONTRIBUTOR'S LIABILITY TO YOU FOR CLAIMS RELATING TO THIS\n      LICENSE, WHETHER FOR BREACH OR IN TORT, SHALL BE LIMITED TO ONE HUNDRED\n      PERCENT (100%) OF THE AMOUNT HAVING THEN ACTUALLY BEEN PAID BY YOU TO\n      ORIGINAL CONTRIBUTOR FOR ALL COPIES LICENSED HEREUNDER OF THE PARTICULAR\n      ITEMS GIVING RISE TO SUCH CLAIM, IF ANY. IN NO EVENT WILL YOU (RELATIVE\n      TO YOUR SHARED MODIFICATIONS OR ERROR CORRECTIONS) OR ORIGINAL\n      CONTRIBUTOR BE LIABLE FOR ANY INDIRECT, PUNITIVE, SPECIAL, INCIDENTAL OR\n      CONSEQUENTIAL DAMAGES IN CONNECTION WITH OR ARISING OUT OF THIS LICENSE\n      (INCLUDING, WITHOUT LIMITATION, LOSS OF PROFITS, USE, DATA, OR OTHER\n      ECONOMIC ADVANTAGE), HOWEVER IT ARISES AND ON ANY THEORY OF LIABILITY,\n      WHETHER IN AN ACTION FOR CONTRACT, STRICT LIABILITY OR TORT (INCLUDING\n      NEGLIGENCE) OR OTHERWISE, WHETHER OR NOT YOU OR ORIGINAL CONTRIBUTOR HAS\n      BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE AND NOTWITHSTANDING THE\n      FAILURE OF ESSENTIAL PURPOSE OF ANY REMEDY.\n\n      8. Miscellaneous.\n\n      8.1. Trademark. You agree to comply with the then current JAHIA Trademark\n      & logo usage requirements accessible through the Jahia Web Server. Except\n      as expressly provided in the License, You are granted no right, title or\n      license to, or interest in, any JAHIA Trademarks. You agree not to (i)\n      challenge Original Contributor's ownership or use of JAHIA Trademarks;\n      (ii) attempt to register any JAHIA Trademarks, or any mark or logo\n      substantially similar thereto; or (iii) incorporate any JAHIA Trademarks\n      into your own trademarks, product names, service marks, company names, or\n      domain names.\n\n      8.2. Integration. This License represents the complete agreement\n      concerning the subject matter hereof.\n\n      8.3. Assignment. Original Contributor may assign this License, and its\n      rights and obligations hereunder, in its sole discretion. You may assign\n      the Research and Development Use portions of this License to a third\n      party. You may not assign the Internal Deployment Use or Commercial Use\n      license, including by way of merger (regardless of whether You are the\n      surviving entity) or acquisition, without Original Contributor's prior\n      written consent.\n\n      8.4. Severability. If any provision of this License is held to be\n      unenforceable, such provision shall be reformed only to the extent\n      necessary to make it enforceable. Notwithstanding the foregoing, if You\n      are prohibited by law from fully and specifically complying with Sections\n      2.2 or 3, this License will immediately terminate and You must\n      immediately discontinue any use of Community Code.\n\n\n\n      8.5. Governing Law. This License shall be exclusively governed by the\n      laws of Switzerland. The application of the United Nations Convention on\n      Contracts for the International Sale of Goods is expressly excluded.\n\n      8.6. Dispute Resolution. All disputes arising out of or in connection\n      with the present License, including disputes on its conclusion, binding\n      effect, amendment and termination shall be resolved, to the exclusion of\n      the ordinary courts by a single Arbitrator in accordance with the\n      International Arbitration Rules of the Geneva Chamber of Commerce. The\n      decision of the Arbitrator shall be final, and the parties waive all\n      challenge of the award in accordance with art. 192 of the Swiss Private\n      International Law Statute.\n\n      8.7. Construction. Any law or regulation which provides that the language\n      of a contract shall be construed against the drafter shall not apply to\n      this License.\n\n      8.8. U.S. Government End Users. The Community Code is a \"commercial\n      item,\" as that term is defined in 48 C.F.R. 2.101 (Oct. 1995), consisting\n      of \"commercial computer software\" and \"commercial computer software\n      documentation,\" as such terms are used in 48 C.F.R. 12.212 (Sept. 1995).\n      Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through\n      227.7202-4 (June 1995), all U.S. Government End Users acquire Community\n      Code with only those rights set forth herein. You agree to pass this\n      notice to Your licensees.\n\n      8.9. Press Announcements. All press announcements relative to the\n      execution of this License must be reviewed and approved by Original\n      Contributor and You prior to release.\n\n      8.10. International Use.\n      a) Export/Import Laws. Community Code is subject to Swiss export control\n      laws and may be subject to export or import regulations in other\n      countries. Each party agrees to comply strictly with all such laws and\n      regulations and acknowledges their responsibility to obtain such licenses\n      to export, re-export, or import as may be required. You agree to pass\n      these obligations to Your licensees.\n      b) Intellectual Property Protection. Due to limited intellectual property\n      protection and enforcement in certain countries, You agree not to\n      redistribute the Original Code, Upgraded Code, and Specifications to any\n      country other than the list of restricted countries on the JCSL Web\n      Server.\n\n      8.11. Language. This License is in the English language only, which\n      language shall be controlling in all respects, and all versions of this\n      License in any other language shall be for accommodation only and shall\n      not be binding on the parties to this License. All communications and\n      notices made or given pursuant to this License, and all documentation and\n      support to be provided, unless otherwise noted, shall be in the English\n      language.\n\n      GLOSSARY\n\n      1. \"Commercial Use\" means any use of a Derivative Work by You to any\n      third party, alone or bundled with any other software or hardware, for\n      direct or indirect commercial or strategic gain or advantage, is subject\n      to execution of a purchase or reselling agreement by You and Original\n      Contributor.\n      2. \"Community Code\" means the Original Code, Upgraded Code, Error\n      Corrections, Shared Modifications, or any combination thereof.\n      3. \"Community Web Server(s)\" means the web server(s) designated by\n      Original Contributor for posting Error Corrections and Shared\n      Modifications and/or accessing documentation.\n      4. \"Compliant Community Code\" means Shared Modifications that have been\n      submitted to Original Contributor for review and have been accepted as\n      valid and correct Community Code.\n      5. \"Contributor\" means each Licensee that creates or contributes to the\n      creation of any Error Correction or Shared Modification.\n      6. \"Derivative Work\" means any work, whether in Source or Object form,\n      that is based on (or derived from) Community Code and for which the\n      editorial revisions, annotations, elaborations, or other Modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Community Code and Derivative Works thereof.\n      7. \"Error Correction\" means any change made to Community Code which\n      conforms to the Specification and corrects the adverse effect of a\n      failure of Community Code to perform any function set forth in or\n      required by the Specifications.\n      8. \"Executable\" means the Original Code, Upgraded Code, Modifications, or\n      any combination thereof that has been converted to a form other than\n      Source Code.\n      9. \"Extension(s)\" means any additional classes or other programming code\n      and/or interfaces developed by or for You which: (i) are designed for use\n      with the Technology; (ii) constitute an API for a library of computing\n      functions or services; and (iii) are disclosed to third party software\n      developers for the purpose of developing software which invokes such\n      additional classes or other programming code and/or interfaces. The\n      foregoing shall not apply to software development by Your subcontractors\n      to be exclusively used by You.\n      10. \"Intellectual Property Rights\" means worldwide statutory and common\n      law rights associated solely with (i) patents and patent applications;\n      (ii) works of authorship including copyrights, copyright applications,\n      copyright registrations and \"moral rights\"; (iii) the protection of trade\n      and industrial secrets and confidential information; ; (iv) trademarks,\n      trade names, service marks and logos (whether the same is registered or\n      unregistered), and (v) divisions, continuations, renewals, and re-\n      issuances of the foregoing now existing or acquired in the future.\n      11. \"Internal Deployment Use\" means use of the Original Code, Upgraded\n      Code, Modifications, or any combination thereof (excluding Research and\n      Development Use) within Your business or organization only by Your\n      employees and/or agents, subject to execution of Attachment C by You and\n      Original Contributor, if required.\n      12. \"Licensee\" means any party that has entered into and has in effect a\n      version of this License with Original Contributor.\n      13. \"Modification(s)\" means (i) any change to Community Code; (ii) any\n      new file or other representation of computer program statements that\n      contains any portion of Community Code; and/or (iii) any new Source Code\n      implementing any portion of the Specifications.\n      14. \"Original Code\" means the initial Source Code for the Technology as\n      described on the Technology Download Site.\n      15. \"Original Contributor\" means Jahia Ltd., 45, rue de la Gare, 1260\n      Nyon, Switzerland.\n      16. \"Reformatted Specifications\" means any revision to the Specifications\n      which translates or reformats the Specifications (as for example in\n      connection with Your documentation) but which does not alter, subset or\n      superset the functional or operational aspects of the Specifications.\n      17. \"Research and Development Use\" means use and distribution of the\n      Original Code, Upgraded Code, Modifications, or any combination thereof\n      only for Your research, development, educational or personal and\n      individual use, and expressly excludes Internal Deployment Use and\n      Commercial Use.\n      18. \"JCSL Webpage\" means the JAHIA Collaborative Source license webpage\n      located at http://www.jahia.org/ or such other URL that Original\n      Contributor may designate from time to time.\n      19. \"Shared Modifications\" means Modifications provided by You, at Your\n      option, pursuant to Section 2.2, or received by You from a Contributor\n      pursuant to Section 2.3.\n      20. \"Source Code\" means computer program statements written in any high-\n      level, readable form suitable for modification and development.\n      21. \"Specifications\" means the specifications for the Technology and\n      other documentation, as designated on the Jahia WebServer, as may be\n      revised by Original Contributor and other Contributors from time to time.\n\n      22. \"JAHIA Trademarks\" means Original Contributor's JAHIA trademarks and\n      logos, whether now used or adopted in the future.\n      23. \"Technology\" means the technology described in Attachment B, and\n      Upgrades.\n      24. \"Technology Download Site\" means the site(s) designated by Original\n      Contributor for access to the Original Code, Upgraded Code and\n      Specifications.\n      25. \"Upgrade(s)\" means new versions of Technology designated exclusively\n      by Original Contributor as an \"Upgrade\" and released by Original\n      Contributor from time to time.\n      26. \"Upgraded Code\" means the Source Code for Upgrades, possibly\n      including Error Corrections and Shared Modifications made by\n      Contributors.\n      27. \"You(r)\" means an individual, or a legal entity acting by and through\n      an individual or individuals, exercising rights either under this License\n      or under a future version of this License issued pursuant to Section 4.1.\n      For legal entities, \"You(r)\" includes any entity that by majority voting\n      interest controls, is controlled by, or is under common control with You."
}