{
  "key": "java-research-1.6",
  "short_name": "Java Research License 1.6",
  "name": "Java Research License Version 1.6",
  "category": "Proprietary Free",
  "owner": "Oracle Corporation",
  "homepage_url": "https://web.archive.org/web/20070112020225/http://www.java.net/jrl.csp",
  "spdx_license_key": "LicenseRef-scancode-java-research-1.6",
  "ignorable_urls": [
    "http://www.sun.com/its",
    "http://www.sun.com/policies/trademarks"
  ],
  "text": "JAVA RESEARCH LICENSE Version 1.6\n\nI.  DEFINITIONS.\n\n\"Licensee\" means You and any other party that has entered into and has\nin effect a version of this License.\n\n\"Modifications\" means any change or addition to the Technology.\n\n\"Sun\" means Sun Microsystems, Inc. and its successors and assignees.\n\n\"Research Use\" means research, evaluation, or development for the\npurpose of advancing knowledge, teaching, learning, or customizing the\nTechnology or Modifications for personal use. Research Use expressly\nexcludes use or distribution for direct or indirect commercial\n(including strategic) gain or advantage.\n\n\"Technology\" means the source code and object code of the technology\nmade available by Sun pursuant to this License.\n\n\"Technology Site\" means the website designated by Sun for accessing\nthe Technology.\n\n\"You\" means the individual executing this License or the legal entity\nor entities represented by the individual executing this License.\n\nII.  PURPOSE.\n\nSun is licensing the Technology under this Java Research License (the\n\"License\") to promote research, education, innovation, and development\nusing the Technology.  This License is not intended to permit or\nenable access to the Technology for active consultation as part of\ncreating an independent implementation of the Technology.\n\nCOMMERCIAL USE AND DISTRIBUTION OF TECHNOLOGY AND MODIFICATIONS IS\nPERMITTED ONLY UNDER A SUN COMMERCIAL LICENSE.\n\nIII.  RESEARCH USE RIGHTS.\n\nA.  License Grant. Subject to the conditions contained herein, Sun\ngrants to You a non-exclusive, non-transferable, worldwide, and\nroyalty-free license to do the following for Your Research Use only:\n\n1.  Reproduce, create Modifications of,  and use the Technology\nalone, or with Modifications;\n\n2.  Share source code of the Technology alone, or with\nModifications, with other Licensees; and\n\n3.  Distribute object code of the Technology, alone, or with\nModifications, to any third parties for Research Use only, under a\nlicense of Your choice that is consistent with this License; and\npublish papers and books discussing the Technology which may include\nrelevant excerpts that do not in the aggregate constitute a\nsignificant portion of the Technology.\n\nB.  Residual Rights.  If You examine the Technology after accepting\nthis License and remember anything about it later, You are not\n\"tainted\" in a way that would prevent You from creating or\ncontributing to an independent implementation, but this License grants\nYou no rights to Sun's copyrights or patents for use in such an\nimplementation.\n\nC.  No Implied Licenses.  Other than the rights granted herein, Sun\nretains all rights, title, and interest in Technology, and You retain\nall rights, title, and interest in Your Modifications and associated\nspecifications, subject to the terms of this License.\n\nD.  Third Party Software.  Portions of the Technology may be\nprovided with licenses or other notices from third parties that govern\nthe use of those portions. Any licenses granted hereunder do not alter\nany rights and obligations You may have under such licenses, however,\nthe disclaimer of warranty and limitation of liability provisions in\nthis License will apply to all Technology in this distribution.\n\nIV.  INTELLECTUAL PROPERTY REQUIREMENTS\n\nAs a condition to Your License, You agree to comply with the following\nrestrictions and responsibilities:\n\nA.  License and Copyright Notices. You must include a copy of this\nJava Research License in a Readme file for any Technology or\nModifications you distribute. You must also include the following\nstatement, \"Use and distribution of this technology is subject to the\nJava Research License included herein\", (a) once prominently in the\nsource code tree and/or specifications for Your source code\ndistributions, and (b) once in the same file as Your copyright or\nproprietary notices for Your binary code distributions. You must cause\nany files containing Your Modification to carry prominent notice\nstating that You changed the files. You must not remove or alter any\ncopyright or other proprietary notices in the Technology.\n\nB.  Licensee Exchanges.  Any Technology and Modifications You\nreceive from any Licensee are governed by this License.\n\nV.  GENERAL TERMS.\n\nA.  Disclaimer Of Warranties.\n\nTHE TECHNOLOGY IS PROVIDED \"AS IS\", WITHOUT WARRANTIES OF ANY KIND,\nEITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, WARRANTIES\nTHAT THE TECHNOLOGY IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A\nPARTICULAR PURPOSE, OR NON-INFRINGING OF THIRD PARTY RIGHTS.  YOU\nAGREE THAT YOU BEAR THE ENTIRE RISK IN CONNECTION WITH YOUR USE AND\nDISTRIBUTION OF ANY AND ALL TECHNOLOGY  UNDER THIS LICENSE.\n\nB.  Infringement; Limitation Of Liability.\n\n1.  If any portion of, or functionality implemented by, the\nTechnology becomes the subject of a claim or threatened claim of\ninfringement (\"Affected Materials\"), Sun may, in its unrestricted\ndiscretion, suspend Your rights to use and distribute the Affected\nMaterials under this License. Such suspension of rights will be\neffective immediately upon Sun's posting of notice of suspension on\nthe Technology Site.\n\n2.  IN NO EVENT WILL SUN BE LIABLE FOR ANY DIRECT, INDIRECT,\nPUNITIVE, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES IN CONNECTION\nWITH OR ARISING OUT OF THIS LICENSE (INCLUDING, WITHOUT LIMITATION,\nLOSS OF PROFITS, USE, DATA, OR ECONOMIC ADVANTAGE OF ANY SORT),\nHOWEVER IT ARISES AND ON ANY THEORY OF LIABILITY (including\nnegligence), WHETHER OR NOT SUN HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.  LIABILITY UNDER THIS SECTION V.B.2 SHALL BE SO LIMITED\nAND EXCLUDED, NOTWITHSTANDING FAILURE OF THE ESSENTIAL PURPOSE OF ANY\nREMEDY.\n\nC.  Termination.\n\n1.  You may terminate this License at any time by notifying Sun in a\nwriting addressed to Sun Microsystems, Inc., 4150 Network Circle,\nSanta Clara, California 95054, Attn.: Legal Department/Products and\nTechnology Law.\n\n2.  All Your rights will terminate under this License if You fail to\ncomply with any of its material terms or conditions and do not cure\nsuch failure within thirty (30) days after becoming aware of such\nnoncompliance.\n\n3.  Upon termination, You must discontinue all uses and distribution\nunder this agreement, and all provisions of this Section V (\"General\nTerms\") shall survive termination.\n\nD.  Miscellaneous.\n\n\n1.  Trademark.  You agree to comply with Sun's Trademark & Logo\nUsage Requirements, as modified from time to time, available at\nhttp://www.sun.com/policies/trademarks/.  Except as expressly provided\nin this License, You are granted no rights in or to any Sun trademarks\nnow or hereafter used or licensed by Sun.\n\n2.  Integration.  This License represents the complete agreement of\nthe parties concerning the subject matter hereof.\n\n3.  Severability.  If any provision of this License is held\nunenforceable, such provision shall be reformed to the extent\nnecessary to make it enforceable unless to do so would defeat the\nintent of the parties, in which case, this License shall terminate.\n\n4.  Governing Law.  This License is governed by the laws of the\nUnited States and the State of California, as applied to contracts\nentered into and performed in California between California residents.\nIn no event shall this License be construed against the drafter.\n\n5.  Export Control.  As further described at\nhttp://www.sun.com/its, you agree to comply with the U.S. export\ncontrols and trade laws of other countries that apply to Technology\nand Modifications."
}