{
  "key": "jdbm-1.00",
  "short_name": "JDBM License v1.00",
  "name": "JDBM License v1.00",
  "category": "Permissive",
  "owner": "JovalCM",
  "homepage_url": "https://github.com/joval/jdbm/blob/master/LICENSE.txt",
  "spdx_license_key": "LicenseRef-scancode-jdbm-1.00",
  "ignorable_urls": [
    "http://jdbm.sourceforge.net/"
  ],
  "ignorable_emails": [
    "cg@cdegroot.com"
  ],
  "text": "JDBM LICENSE v1.00\n\nRedistribution and use of this software and associated documentation\n(\"Software\"), with or without modification, are permitted provided\nthat the following conditions are met:\n\n1. Redistributions of source code must retain copyright\n   statements and notices.  Redistributions must also contain a\n   copy of this document.\n\n2. Redistributions in binary form must reproduce the\n   above copyright notice, this list of conditions and the\n   following disclaimer in the documentation and/or other\n   materials provided with the distribution.\n\n3. The name \"JDBM\" must not be used to endorse or promote\n   products derived from this Software without prior written\n   permission of Cees de Groot.  For written permission,\n   please contact cg@cdegroot.com.\n\n4. Products derived from this Software may not be called \"JDBM\"\n   nor may \"JDBM\" appear in their names without prior written\n   permission of Cees de Groot.\n\n5. Due credit should be given to the JDBM Project\n   (http://jdbm.sourceforge.net/).\n\nTHIS SOFTWARE IS PROVIDED BY THE JDBM PROJECT AND CONTRIBUTORS\n``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT\nNOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL\nCEES DE GROOT OR ANY CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\nSTRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\nOF THE POSSIBILITY OF SUCH DAMAGE."
}