{
  "key": "jelurida-public-1.1",
  "short_name": "Jeulurida Public License 1.1",
  "name": "Jeulurida Public License 1.1",
  "category": "Copyleft",
  "owner": "Jelurida",
  "homepage_url": "https://github.com/mrv777/NXT/blob/master/LICENSE.txt",
  "spdx_license_key": "LicenseRef-scancode-jelurida-public-1.1",
  "standard_notice": "This program is distributed under the terms of the Jelurida Public License\nversion 1.1\n",
  "ignorable_authors": [
    "Jelurida Swiss SA"
  ],
  "text": "JELURIDA PUBLIC LICENSE\n\nPreamble:\n\nBeing a company engaged predominantly in the creation of blockchain technology,\nJelurida IP B.V. has prepared the following “coinleft” license whose goal is to\nimplement new requirements consistent with the specific nature of the blockchain\nsoftware. We recognize the fundamental advantages that the decentralized ledger\ntechnology has to offer and we truly believe in its potential to change the\nworld for the better. Therefore we wish to continue the already established\ntradition to publish blockchain software as an open source and in this way to\ngive our contribution to the further development of the blockchain technology\nworld-wide. At the same time we wish to protect our IP rights and to address the\nfact that our software was copied many times during its existence and as a\nresult a lot of “clones” have been created which dilute the value of the tokens\nwith no significant technological improvements behind them.\n\nThe exact terms and conditions for using, copying and modification follow:\n\n\nTERMS AND CONDITIONS\n\n\nI. General Conditions\n\n\nIntroduction\n\nThe existent copyleft licensing models were designed to protect the value of the\ncode which is created in open source projects. They make sure anyone who builds\non top of this code also releases their code under the same copyleft license,\nthus sharing back with the community and the developers of the original project\nthe added value of the derived work.\n\nCopyleft licenses however were created long before crypto currency and\nblockchain technologies appeared, and could not have anticipated the fact that\ntoday the value of an open source distributed ledger project is contained not\nonly in the program code being written, but in the unique public blockchain\ninstance or crypto currency token, maintained by this project, with its\ndevelopers, community and holders sharing the common interest to preserve and\nincrease the value of this blockchain token.\n\nCrypto currency tokens today have value of their own, people can buy, sell and\ninvest in them and the unlimited permission of cloning the existing blockchain\nplatforms and creating new coins inevitably results in decreasing the value of\nthe original tokens.\n\nCrypto currency tokens are also an inseparable part of each distributed ledger\nsoftware, without which such software cannot really be used. Ensuring that a\nclone project shares back the modified source code is no longer sufficient to\nallow the users of the original project access to that derived work, unless they\nare also allocated some of the newly created tokens in the clone blockchain\ninstance. Thus such allocation is important in order to preserve not only the\nvalue of the original tokens, but also to preserve the users freedom to use any\nworks derived from the original software.\n\nWith the above being said, the terms and conditions for using, copying and\nmodification of distributed ledger software programs are outlined below, called\nthe Jelurida Public License (JPL). The JPL is inspired by the GNU General Public\nLicense versions 2 and 3, with adaptations specifically aimed at application of\nthe license to distributed ledger software programs; as such the GNU General\nPublic License and any other license terms and conditions other than this JPL\nare explicitly excluded.\n\n\nJPL version: 1.1\n\n\nArticle 0. Definitions:\n\n“based on [the Program/Covered Work/…]” means derived from the original Covered\nWork (or part thereof) by the act(s) of copying it, modifying it, including it\n(in whole or in part) or by linking to the original Covered Work (or part\nthereof).\n\n“to convey”: To convey a work means any kind of propagation that enables other\nparties to make or receive copies. Mere interaction with a user through a\ncomputer network, with no transfer of a copy, is not conveying.\n\nCopyright Holder, Licensor: The owner of the IP rights over the software as\ndetermined by applicable national law and international treaty provisions\nregulating this subject matter.\n\nCorresponding Source: The Corresponding Source for a work in Object Code form\nmeans all the Source Code needed to generate, install, and (for an executable\nwork) run the Object Code and to modify the work, including scripts to control\nthose activities. However, it does not include the work's System Libraries, or\ngeneral-purpose tools or generally available free programs which are used\nunmodified in performing those activities but which are not part of the work.\nFor example, Corresponding Source includes interface definition files associated\nwith source files for the work, and the Source Code for shared libraries and\ndynamically linked subprograms that the work is specifically designed to\nrequire, such as by intimate data communication or control flow between those\nsubprograms and other parts of the work. The Corresponding Source need not\ninclude anything that users can regenerate automatically from other parts of the\nCorresponding Source. The Corresponding Source for a work in Source Code form is\nthat same work.\n\nCovered Work: A DLT Software or another Program based on a DLT or otherwise, or\nbased on another Covered Work, their Object Code and Source Code, and any other\nwork covered by this License according to their terms.\n\nDLT Instance: Unique instance of distributed ledger consisting of a network of\none or more participants (nodes) running a particular DLT Software and which\nnodes are in a state of consensus with each other within the permitted\ntolerances of the applicable consensus algorithm. An example of such DLT\ninstance is the Nxt public blockchain.\n\nDLT Software: Any distributed ledger computer technology including but not\nlimited to blockchain technology regardless of the way the consensus is\nestablished.\n\nGeneral Conditions: Chapter I. General Conditions of this License.\n\nLicense: This Jelurida Public License (JPL) consisting of both General\nConditions and Special Conditions.\n\nLicensee, You: Everyone (natural person or legal entity) who wants to use, copy,\ndistribute, modify or build on top of the Program.\n\n“to modify”: To modify a work means to copy from or adapt all or part of the\nwork in a fashion requiring copyright permission, other than the making of an\nexact copy. The resulting work is called a “modified version” of the earlier\nwork or a “work based on” the earlier work. Modification also includes\ntranslation into another programming language or human language.\n\nObject Code: Any non-Source Code form of a work.\n\nProgram: Any copyrightable work licensed under this License.\n\n“to propagate”: To propagate a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for infringement under\napplicable copyright law, except executing it on a computer or modifying a\nprivate copy. Propagation includes copying, distribution (with or without\nmodification), making available to the public, and in some countries other\nactivities as well.\n\nSource Code: The Source Code for a work means the preferred form of the work for\nmaking modifications to it.\n\nSpecial Conditions: Chapter II. Special Conditions of this License which\ncontains additional provisions required and adapted by the Licensor according to\nthe specific Covered Work they are applicable to.\n\nStandard Interface: An interface that either is an official standard defined by\na recognized standards body, or, in the case of interfaces specified for a\nparticular programming language, one that is widely used among developers\nworking in that language.\n\nSystem Libraries: Libraries of an executable work, other than the work as a\nwhole, that (a) are included in the normal form of packaging a Major Component,\nbut which are not part of that Major Component, and (b) serve only to enable use\nof the work with that Major Component, or to implement a Standard Interface for\nwhich an implementation is available to the public in Source Code form. A Major\nComponent, in this context, means a major essential component (kernel, window\nsystem, and so on) of the specific operating system (if any) on which the\nexecutable work runs, or a compiler used to produce the work, or an Object Code\ninterpreter used to run it.\n\n\nArticle 1. Scope of the License:\n\n1.1 This License applies to any Covered Work or other work which contains a\nnotice placed by the Copyright Holder saying it may be used, propagated,\nconveyed or modified only under the terms of this License. It also applies to\nany work which is not a DLT per se but is still a Covered Work because it is\nbased on the covered DLT Software or contains a portion of it. This is to ensure\nthat if such work is included into another DLT Software that DLT Software must\nsatisfy the below stated airdrop requirement and other terms of this License.\n\n1.2. All rights granted under this License are granted for the term of copyright\non the Covered Work, and are irrevocable provided the conditions of this License\nare met.\n\n1.3 The act of running a Program is not restricted as long as it does not\nviolate Article 3.4 of the General Conditions, and the output from a Program is\ncovered only if its contents constitute a work based on the Program (independent\nof having been made by running the Program). Whether that is true depends on\nwhat the Program does.\n\n1.4 Conveying is permitted solely under the conditions stated herein.\nSublicensing is not allowed; Article 7 of the General Conditions makes it\nunnecessary.\n\n1.5 No Covered Work shall be deemed part of an effective technological measure\nunder any applicable law fulfilling obligations under article 11 of the WIPO\ncopyright treaty adopted on 20 December 1996, or similar laws prohibiting or\nrestricting circumvention of such measures. When you convey a Covered Work, you\nwaive any legal power to forbid circumvention of technological measures to the\nextent such circumvention is effected by exercising rights under this License\nwith respect to the Covered Work, and you disclaim any intention to limit\noperation or modification of the work as a means of enforcing, against the\nwork's users, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n\nArticle 2.\n\n2.1 You may copy and distribute verbatim copies of the Covered Work’s Source\nCode as you receive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice and\ndisclaimer of warranty; keep intact all the notices that refer to this License\nand to the absence of any warranty; and give any other recipients of the Covered\nWork a copy of this License along with the Covered Work.\n\n2.2 You must keep intact all authorship and copyright notices and when conveying\nor offering to convey copies (verbatim or modified) you must also avoid any\nmisrepresentation of the origin of the Covered Work. You must make sure that any\nmodified versions of such Covered Work are marked in reasonable ways as\ndifferent from the original version and they do not imply any endorsement or\nsupport by the Copyright Holder regarding this modified work.\n\n2.3 You may charge a fee for the physical act of transferring a copy (for the\navoidance of doubt, such physical act of transfer may include making the copy\navailable on your website or otherwise), and you may at your discretion and\nresponsibility offer support or warranty protection in exchange for a fee. You\nare not allowed to charge any fee for granting the right to further use,\npropagate, convey or modify the copy then obtained by the acquirer, as such\nwould be against the intention of this License.\n\n\nArticle 3. You may modify your copy or copies of the Covered Work or any portion\nof it, thus forming a work based on the Covered Work, and copy and distribute\nsuch modifications or work under the terms of Article 2 above, provided that you\nalso meet all of these conditions:\n\n3.1 You must cause the modified files to carry prominent notices stating that\nyou changed the files and the date of any change.\n\n3.2 You must cause any work that you distribute or publish, that in whole or in\npart contains or is derived from the Covered Work or any part thereof, to be\nlicensed as a whole at no charge to all third parties under the terms of this\nLicense.\n\n3.3 If the modified program normally reads commands interactively when run, you\nmust cause it, when started running for such interactive use in the most\nordinary way, to print or display an announcement including an appropriate\ncopyright notice and a notice that there is no warranty (or else, saying that\nyou provide a warranty) and that users may redistribute the program under the\nconditions of this License, and telling the user how to view a copy of this\nLicense. (Exception: if the Covered Work itself is interactive but does not\nnormally print such an announcement, your work based on the Covered Work is not\nrequired to print an announcement.) If the program has graphical user interface\nany such notices should be placed in an about dialog or similar.\n\n3.4 If the Covered Work is a DLT Software, after your modifications it must\ncontinue to work with the original DLT Instance without violating the consensus\nalgorithm or resulting in a permanent fork. For the purpose of this clause\nmodification also includes changing the configuration or network environment in\nwhich the Covered Work is run that results in permanent disconnection, fork or\nisolation from the original DLT Instance. If your modifications result in a\ndifferent DLT Instance you must satisfy the following airdrop requirement:\n\n3.4.1 The token holders from the original distributed ledger instance shall be\nallocated a portion (an \"airdrop\") of the tokens in that new DLT Instance\nproportional to their token balances. This shall also apply to anyone who\nintends to make a copy of your copy, i.e. any such person needs to allocate the\nsame airdrop of the newly created tokens to the account holders from the\noriginal DLT Instance (not to your copy). If the Covered Work is not a DLT\nSoftware per se this requirement still applies to any other work based on or\nincluding this work or portions of it which is a DLT Software or in any other\nway distributes tokens to its users. The specific percentage of the airdrop\nand the tokens to which it applies, which may also depend on how the new DLT\nInstance relates to the original one, are defined in the Special Conditions.\n\n3.5 All other provisions, designated in the Special Conditions and consistent\nwith the specific requirements arising from the architecture of each particular\ndecentralized ledger/consensus platform, are observed as well.\n\n3.6 These requirements apply to the modified work as a whole. If identifiable\nsections of that work are not derived from the Covered Work, and can be\nreasonably considered independent and separate works in themselves, then this\nLicense, and its terms, do not apply to those sections when you convey them as\nseparate works. But when you convey the same sections as part of a whole which\nis a work based on the Covered Work, the conveyance of the whole must be on the\nterms of this License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it. Mere\naggregation of another work not based on the Covered Work with the Covered Work\n(or with a work based on the Covered Work) on a volume of a storage or\ndistribution medium does not bring the other work under the scope of this\nLicense.\n\n\nArticle 4. You may convey a Covered Work in Object Code form under the terms of\nArticles 2 and 3 of the General Conditions, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License, in one of\nthese ways:\n\n4.1 Convey the Object Code in, or embodied in, a physical product (including a\nphysical distribution medium), accompanied by the Corresponding Source fixed on\na durable physical medium customarily used for software interchange.\n\n4.2 Convey the Object Code in, or embodied in, a physical product (including a\nphysical distribution medium), accompanied by a written offer, valid for at\nleast three years and valid for as long as you offer spare parts or customer\nsupport for that product model, to give anyone who possesses the Object Code\neither (1) a copy of the Corresponding Source for all the software in the\nproduct that is covered by this License, on a durable physical medium\ncustomarily used for software interchange, for a price no more than your\nreasonable cost of physically performing this conveying of source, or (2) access\nto copy the Corresponding Source from a network server at no charge.\n\n4.3 Convey individual copies of the Object Code with a copy of the written offer\nto provide the Corresponding Source. This alternative is allowed only\noccasionally and non-commercially, and only if you received the Object Code with\nsuch an offer, in accord with Article 4.2 above.\n\n4.4 Convey the Object Code by offering access from a designated place (gratis or\nfor a charge), and offer equivalent access to the Corresponding Source in the\nsame way through the same place at no further charge. You need not require\nrecipients to copy the Corresponding Source along with the Object Code. If the\nplace to copy the Object Code is a network server, the Corresponding Source may\nbe on a different server (operated by you or a third party) that supports\nequivalent copying facilities, provided you maintain clear directions next to\nthe Object Code saying where to find the Corresponding Source. Regardless of\nwhat server hosts the Corresponding Source, you remain obligated to ensure that\nit is available for as long as needed to satisfy these requirements.\n\n4.5 Convey the Object Code using peer-to-peer transmission, provided you inform\nother peers where the Object Code and Corresponding Source of the work are being\noffered to the general public at no charge under Article 4.4 above.\n\n4.6 A separable portion of the Object Code, whose Source Code is excluded from\nthe Corresponding Source as a System Library, need not be included in conveying\nthe Object Code work.\n\n\nArticle 5. You may not use, copy, modify, or propagate the Covered Work except\nas expressly provided under this License. Any attempt otherwise to use, copy,\nmodify or  propagate the Covered Work is void, and will automatically terminate\nyour rights under this License. However, parties who have received copies, or\nrights, from you under this License will not have their licenses terminated so\nlong as such parties remain in full compliance.\n\n\nArticle 6. You are not required to accept this License, since you have not\nsigned it. However, nothing else grants you permission to copy, use, modify or\npropagate Covered Works. These actions are prohibited if you do not accept this\nLicense. Therefore, by modifying or propagating the Covered Work, you indicate\nyour acceptance of this License to do so, and all its terms and conditions for,\nas specified in the General Conditions and Special Conditions, copying, using,\npropagating or modifying the Covered Work.\n\n\nArticle 7. Each time you convey the Covered Work, the recipient automatically\nreceives a license from the original Licensor to use, copy, propagate or modify\nthe Covered Work subject to terms and conditions at least equal and in\naccordance with this License. In this regard, the license granted on behalf of\nthe original Licensor by the propagator of the Covered Work may amend this\nLicense only to the following extent:\n\n7.1 You can add additional airdrop requirements towards the holders of your\nunique DLT Instance as long as those do not in any way reduce or interfere with\nthe airdrop owed to the original DLT Instance account holders.\n\n7.2 If the distribution and/or use of the Covered Work is restricted in certain\ncountries either by patents, by copyrighted interfaces or by law, the original\ncopyright holder who places the Covered Work under this License may add an\nexplicit geographical distribution limitation excluding those countries, so that\ndistribution is permitted only in or among countries not thus excluded. In such\ncase, this License incorporates the limitation as if written in the body of this\nLicense.\n\n\nArticle 8. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues), conditions\nare imposed on you (whether by court order, agreement or otherwise) that\ncontradict the conditions of this License, they do not excuse you from the\nconditions of this License. If you cannot distribute so as to satisfy\nsimultaneously your obligations under this License and any other pertinent\nobligations, then as a consequence you may not propagate the Covered Work at\nall. For example, if a patent license would not permit royalty-free\nredistribution of the Covered Work by all those who receive copies directly or\nindirectly through you, then the only way you could satisfy both it and this\nLicense would be to refrain entirely from distribution of the Covered Work.\n\n\nArticle 9. Jelurida IP B.V. may publish revised and/or new versions of the\nJelurida Public License from time to time. Such new versions will be similar in\nspirit to the present version, but may differ in detail to address new problems\nor concerns. To avoid ambiguity, everyone who wishes to use the text of the\nJelurida Public License must always specify under which version of the JPL\ntheir Covered Work is released.\n\n\nArticle 10. Every Copyright Holder is permitted to use the text of the Jelurida\nPublic License for their own Covered Work provided that they: (i) keep the name\nJelurida Public License (you can append the name of the specific DLT Instance,\ne.g. \"Jelurida Public License version 1.0 for the Nxt Public Blockchain\"),\n(ii) remove the Preamble and (iii) do not change the General Conditions. Every\nCopyright Holder is permitted to adapt the Special Conditions to their specific\ncase under (i), (ii) and (iii) above to the extent that they do not contradict\nthe General Conditions nor the spirit of the Jelurida Public License.\n\n\nArticle 11. If the Special Conditions contradict the General Conditions or any\npart of them, the provisions of the General Conditions shall take precedence.\n\n\nArticle 12. If you cannot satisfy Article 3.4 and 3.4.1 of the General\nConditions or you are not willing to do so, or if you require a customized DLT\nInstance for internal use (i.e. a private blockchain) based on the DLT Software\nyou must obtain permission or purchase a commercial license from the original\nCopyright Holder however he is not in any way obliged to grant permission or\nsell such a license.\n\n\nArticle 13. No warranty\n\nTHE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE COVERED WORK \"AS IS\"\nWITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nCOVERED WORK IS WITH YOU. SHOULD THE COVERED WORK PROVE DEFECTIVE, YOU ASSUME\nTHE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n\nArticle 14.\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY\nCOPYRIGHT HOLDER OR ANY OTHER PARTY  WHO MAY MODIFY AND/OR REDISTRIBUTE THE\nCOVERED WORK AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL INCIDENTAL  OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR\nINABILITY TO USE THE COVERED WORK (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR\nDATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE COVERED WORK TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH\nHOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. YOU\nINDEMNIFY THE COPYRIGHT HOLDER OR CONVEYOR OF THE COVERED WORK OF ANY LIABILITY\nVIS-À-VIS ANY THIRD PARTY IN CONNECTION WITH THE COVERED WORK AS USED, COPIED,\nPROPAGATED OR MODIFIED BY YOU.\n\n\nArticle 15.\n\nIf the disclaimer of warranty and limitation of liability provided above cannot\nbe given local legal effect according to their terms, reviewing courts shall\napply local law that most closely approximates an absolute waiver of all civil\nliability in connection with the Covered Work, unless a warranty or assumption\nof liability accompanies a copy of the Covered Work in return for a fee.\n\n\nII. Special Conditions\n\nArticle 0. The Copyright Holder of the Nxt Reference Software (NRS) is Jelurida\nIP B.V.\n\n\nArticle 1. The airdrop requirement of Article 3.4.1 of the General Conditions,\nas related to the Nxt Reference Software (NRS) is the following:\n\n1.1 The NXT holders from the original Nxt Public Blockchain Platform as\nmaintained by Jelurida Swiss SA must be allocated at least 10% (ten percent) of\nthe forging tokens in the new DLT Instance, proportional to their NXT holdings,\n\nOR\n\n1.2 The forging token holders from a DLT Instance which is based on the NRS that\nhas already satisfied the JPL airdrop requirement, are allocated 100% (one\nhundred percent) of the forging tokens in that new DLT Instance, proportional to\ntheir forging token holdings.\n\nThe first case covers clones and forks of the Nxt platform, and ensures that NXT\nowners will receive an airdrop from any such clone or fork launched in the\nfuture, or any existing Nxt clone that decides to upgrade to this NRS version or\ncopy or backport code from it.\n\nThe second case is to cover forks of Nxt clones which have already satisfied the\nJPL airdrop, as by definition at the time of the hard fork all accounts start\nwith the same balances on either fork, and it would be difficult to make a hard\nfork satisfy the first condition. The Nxt holders who received the airdrop\nwould still have the same balances on either fork.\n\n\nArticle 2. In both cases (Articles 1.1 or 1.2 of the Special Conditions), token\nholdings must be calculated based on a snapshot taken not earlier than 3 months\nbefore the launch of the new DLT Instance. For a new DLT Instance, the snapshot\nshould also be taken not later than 24 h before the launch, to avoid the\nuncertainty due to the 720 blocks rolling checkpoint.\n\n\nArticle 3.\n\n3.1 There should be under no circumstances any restrictions or any type of\ndiscrimination against accounts receiving tokens as an airdrop.\n\n3.2 If token distribution must be restricted by some criteria that not all\nexisting NXT holders can potentially satisfy, a specific exemption from the full\nJPL airdrop requirements must be obtained in advance. The Copyright Holder\nreserves the right to not grant such exemption, or to require a commercial\nlicense in such situations, to be decided on a case by case basis.\n\n3.3 As internal (private) use of Nxt software for evaluating and testing\npurposes cannot satisfy the JPL airdrop requirement, any such use will also\nrequire an evaluation license agreement with the Copyright Holder if it lasts\nlonger than 3 months.\n\n3.4 Nothing in this license shall be understood as giving NXT token holders the\nright to hold the Licensor, its affiliate parties, or sublicensors, liable in\ncase the NXT holders do not obtain any airdrop, or liable for not taking action\nto enforce the airdrop requirement, or for not observing, verifying or\nmonitoring the compliance with any airdrop. The Licensor also retains the right\nto change the percentage of the airdrop requirement in Article 1.1 or to\ncompletely eliminate this airdrop requirement at any time.\n\n\nArticle 4. DLT Instances that by design do not use a fixed number of tokens\nissued all at once, or that have substituted the proof-of-stake algorithm with a\ndifferent one and as a result do not use forging tokens, have to contact the\nCopyright Holder for a custom license agreement. However the Copyright Holder is\nin no way obliged to provide such a custom license.\n\n\nArticle 5. Interpretation\nYou agree that you may not, for the purpose of interpretation of this License,\nrefer to, or construe this License on the basis of, or use as counterevidence,\nany prior agreements, arrangements, understandings and statements, or other\nbilateral or public licenses, and to this extent agree (i) that this License\nqualifies as an agreed rule of evidence within the meaning of article 153 Dutch\nCode of Civil Proceedings and (ii) that this clause serves as a determination\nagreement within the meaning of article 7:900 Dutch Civil Code, and that this\nLicense shall be interpreted or construed by assuming the most obvious\ngrammatical meaning of the wording of this License.\n\n\nArticle 6. Governing law\nThis License, the documents related to it and any agreement that incorporates\nany of these are governed by and shall be construed in accordance with the laws\nof the Netherlands. Any and all disputes arising out of or in connection with\nthis License, the documents related to it and any agreement that incorporates\nany of these shall be exclusively referred to the competent court in Amsterdam,\nthe Netherlands."
}