{
  "key": "jetty-ccla-1.1",
  "short_name": "Jetty CCLA 1.1",
  "name": "Jetty Project Corporate Contributor License Agreement V1.1",
  "category": "CLA",
  "owner": "Jetty Project",
  "homepage_url": "https://raw.githubusercontent.com/eclipse/jetty.project/jetty-9.4.x/LICENSE-CONTRIBUTOR/ccla-template.txt",
  "spdx_license_key": "LicenseRef-scancode-jetty-ccla-1.1",
  "text_urls": [
    "https://raw.githubusercontent.com/eclipse/jetty.project/jetty-9.4.x/LICENSE-CONTRIBUTOR/ccla-template.txt"
  ],
  "ignorable_urls": [
    "http://www.apache.org/licenses/",
    "ssh://svn.jetty.codehaus.org/home/projects/jetty/scm/jetty"
  ],
  "ignorable_emails": [
    "eclipse@eclipse.com"
  ],
  "text": "Jetty Project          \nCorporate Contributor License Agreement V1.1\nbased on http://www.apache.org/licenses/\n\nThank you for your interest in the Jetty project by Mort Bay Consulting\nPty. Ltd. Australia (\"MortBay\").  In order to clarify the intellectual\nproperty license granted with Contributions from any person or entity,\nMortBay must have a Contributor License Agreement (\"CLA\") that has been\nsigned by each Contributor, indicating agreement to the license terms\nbelow. This license is for your protection as a Contributor as well as\nthe protection of MortBay and its users; it does not change your rights\nto use your own Contributions for any other purpose.\n\nThis version of the Agreement allows an entity (the \"Corporation\") to\nsubmit Contributions to Mort Bay, to authorize Contributions submitted by\nits designated employees to Mort Bay, and to grant copyright and patent\nlicenses thereto.\n\nIf you have not already done so, please complete this agreement and \ncommit it to the Jetty repository at\nsvn+ssh://svn.jetty.codehaus.org/home/projects/jetty/scm/jetty at\nLICENSES/ccla-CORPORATE-NAME.txt. If you do not have commit privilege to the \nrepository, please email the file to eclipse@eclipse.com. If possible, \ndigitally sign the committed file, otherwise send a signed Agreement \nto MortBay.\n\nEach developer covered by this agreement should have their name appended \nthe Schedule A and the copy commited to LICENSES/ccla-CORPORATE-NAME.txt \nusing their authenticated codehaus ssh login.  If possible, digitally sign\nthe committed file, otherwise send a signed Agreement to MortBay.\n\nPlease read this document carefully before signing and keep a copy for\nyour records.\n\n  Corporation name:\n  Mailing Address:\n\n  Point of Contact:\n  Full name: \n  E-Mail:   \n  Fax:\n\nYou accept and agree to the following terms and conditions for Your\npresent and future Contributions submitted to MortBay. In return,\nMortBay shall not use Your Contributions in a way that is contrary\nto the software license in effect at the time of the Contribution.\nExcept for the license granted herein to MortBay and recipients of\nsoftware distributed by MortBay, You reserve all right, title, and\ninterest in and to Your Contributions.\n\n1. Definitions.\n\n   \"You\" (or \"Your\") shall mean the copyright owner or legal entity\n   authorized by the copyright owner that is making this Agreement with\n   MortBay. For legal entities, the entity making a Contribution and all\n   other entities that control, are controlled by, or are under common\n   control with that entity are considered to be a single Contributor. For\n   the purposes of this definition, \"control\" means (i) the power, direct\n   or indirect, to cause the direction or management of such entity,\n   whether by contract or otherwise, or (ii) ownership of fifty percent\n   (50%) or more of the outstanding shares, or (iii) beneficial ownership\n   of such entity.\n\n   \"Contribution\" shall mean any original work of authorship,\n   including any modifications or additions to an existing work, that\n   is intentionally submitted by You to MortBay for inclusion in, or\n   documentation of, any of the products owned or managed by MortBay (the\n   \"Work\"). For the purposes of this definition, \"submitted\" means any\n   form of electronic, verbal, or written communication sent to MortBay\n   or its representatives, including but not limited to communication\n   on electronic mailing lists, source code control systems, and issue\n   tracking systems that are managed by, or on behalf of, MortBay for\n   the purpose of discussing and improving the Work, but excluding\n   communication that is conspicuously marked or otherwise designated\n   in writing by You as \"Not a Contribution.\"\n\n2. Grant of Copyright License. Subject to the terms and conditions\n   of this Agreement, You hereby grant to MortBay and to recipients of\n   software distributed by MortBay a perpetual, worldwide, non-exclusive,\n   no-charge, royalty-free, irrevocable copyright license to reproduce,\n   prepare derivative works of, publicly display, publicly perform,\n   sublicense, and distribute Your Contributions and such derivative\n   works.\n\n3. Grant of Patent License. Subject to the terms and conditions of\n   this Agreement, You hereby grant to MortBay and to recipients of\n   software distributed by MortBay a perpetual, worldwide, non-exclusive,\n   no-charge, royalty-free, irrevocable (except as stated in this section)\n   patent license to make, have made, use, offer to sell, sell, import,\n   and otherwise transfer the Work, where such license applies only to\n   those patent claims licensable by You that are necessarily infringed by\n   Your Contribution(s) alone or by combination of Your Contribution(s)\n   with the Work to which such Contribution(s) were submitted. If any\n   entity institutes patent litigation against You or any other entity\n   (including a cross-claim or counterclaim in a lawsuit) alleging\n   that your Contribution, or the Work to which you have contributed,\n   constitutes direct or contributory patent infringement, then any\n   patent licenses granted to that entity under this Agreement for that\n   Contribution or Work shall terminate as of the date such litigation\n   is filed.\n\n4. You represent that You are legally entitled to grant the above\n   license. You represent further that each employee of the Corporation\n   designated on Schedule A below (or in a subsequent written modification\n   to that Schedule) is authorized to submit Contributions on behalf of\n   the Corporation.\n\n5. You represent that each of Your Contributions is Your original creation\n   (see section 7 for submissions on behalf of others).  You represent\n   that Your Contribution submissions include complete details of any\n   third-party license or other restriction (including, but not limited\n   to, related patents and trademarks) of which you are personally aware\n   and which are associated with any part of Your Contributions.\n\n6. You are not expected to provide support for Your Contributions, except\n   to the extent You desire to provide support. You may provide support\n   for free, for a fee, or not at all. Unless required by applicable\n   law or agreed to in writing, You provide Your Contributions on an\n   \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either\n   express or implied, including, without limitation, any warranties or\n   conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS\n   FOR A PARTICULAR PURPOSE.\n\n7. Should You wish to submit work that is not Your original creation,\n   You may submit it to MortBay separately from any Contribution,\n   identifying the complete details of its source and of any license or\n   other restriction (including, but not limited to, related patents,\n   trademarks, and license agreements) of which you are personally\n   aware, and conspicuously marking the work as \"Submitted on behalf of\n   a third-party: [named here]\".\n\n8. It is your responsibility to notify MortBay when any change is required\n   to the list of designated employees authorized to submit Contributions\n   on behalf of the Corporation, or to the Corporation's Point of Contact\n   with MortBay.\n\nDate: \n\nSignature:\n\nName:\n\nPositions:\n\n\n\nSchedule A\n\n    Name                                     Date added\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________\n\n    ______________________________________   ________________"
}