{
  "key": "jgraph",
  "short_name": "JGraph License",
  "name": "JGraph License",
  "category": "Permissive",
  "owner": "JGraph",
  "homepage_url": "http://www.jgraph.com/jgraphdownload.html",
  "spdx_license_key": "LicenseRef-scancode-jgraph",
  "other_urls": [
    "http://www.jgraph.com/jgraphdownload.html"
  ],
  "minimum_coverage": 70,
  "text": "Redistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list\nof conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice, this\nlist of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n\nNeither the name of JGraph Ltd nor the names of its contributors may be used\nto endorse or promote products derived from this software without specific prior written permission.\n\nTermination for Patent Action. This License shall terminate\nautomatically, as will all licenses assigned to you by the copyright\nholders of this software, and you may no longer exercise any of the\nrights granted to you by this license as of the date you commence an\naction, including a cross-claim or counterclaim, against the\ncopyright holders of this software or any licensee of this software\nalleging that any part of the JGraph, JGraphX and/or mxGraph software\nlibraries infringe a patent. This termination provision shall not\napply for an action alleging patent infringement by combinations of\nthis software with other software or hardware.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}