{
  "key": "jpl-image",
  "short_name": "JPL Image Use Policy",
  "name": "JPL Image Use Policy",
  "category": "Source-available",
  "owner": "Nasa Jet Propulsion Laboratory",
  "homepage_url": "https://www.jpl.nasa.gov/jpl-image-use-policy",
  "spdx_license_key": "JPL-image",
  "ignorable_emails": [
    "bert.ulrich@hq.nasa.gov",
    "instcomm@jpl.nasa.gov"
  ],
  "text": "JPL Image Use Policy\n\nUnless otherwise noted, images and video on JPL public web sites\n(public sites ending with a jpl.nasa.gov address) may be used\nfor any purpose without prior permission, subject to the special\ncases noted below. Publishers who wish to have authorization may\nprint this page and retain it for their records; JPL does not\nissue image permissions on an image by image basis.\n\nBy electing to download the material from this web site the user agrees:\n\n1. that Caltech makes no representations or warranties with respect to\n   ownership of copyrights in the images, and does not represent others\n   who may claim to be authors or owners of copyright of any of the images,\n   and makes no warranties as to the quality of the images. Caltech shall\n   not be responsible for any loss or expenses resulting from the use of\n   the images, and you release and hold Caltech harmless from all liability\n   arising from such use.\n2. to use a credit line in connection with images. Unless otherwise noted\n   in the caption information for an image, the credit line should be\n   \"Courtesy NASA/JPL-Caltech.\"\n3. that the endorsement of any product or service by Caltech, JPL or NASA\n   must not be claimed or implied.\n\nSpecial Cases:\n\n* Prior written approval must be obtained to use the NASA insignia logo\n  (the blue \"meatball\" insignia), the NASA logotype (the red \"worm\" logo)\n  and the NASA seal. These images may not be used by persons who are not\n  NASA employees or on products (including Web pages) that are not NASA\n  sponsored. In addition, no image may be used to explicitly or implicitly\n  suggest endorsement by NASA, JPL or Caltech of commercial goods or services.\n  Requests to use NASA logos may be directed to Bert Ulrich, Public Services\n  Division, NASA Headquarters, Code POS, Washington, DC 20546,\n  telephone (202) 358-1713, fax (202) 358-4331, email bert.ulrich@hq.nasa.gov.\n\n* Prior written approval must be obtained to use the JPL logo\n  (stylized JPL letters in red or other colors). Requests to use the JPL logo\n  may be directed to the Institutional Communications Office,\n  email instcomm@jpl.nasa.gov.\n\n* If an image includes an identifiable person, using the image for commercial\n  purposes may infringe that person's right of privacy or publicity,\n  and permission should be obtained from the person. NASA and JPL generally\n  do not permit likenesses of current employees to appear on commercial products.\n  For more information, consult the NASA and JPL points of contact listed above.\n\n* JPL/Caltech contractors and vendors who wish to use JPL images in advertising\n  or public relation materials should direct requests to the Institutional\n  Communications Office, email instcomm@jpl.nasa.gov.\n\n* Some image and video materials on JPL public web sites are owned by organizations\nother than JPL or NASA. These owners have agreed to make their images and video\navailable for journalistic, educational and personal uses, but restrictions are\nplaced on commercial uses. To obtain permission for commercial use, contact the\ncopyright owner listed in each image caption. Ownership of images and video by\nparties other than JPL and NASA is noted in the caption material with each image."
}