{
  "key": "jsel-2.0",
  "short_name": "JSEL 2.0",
  "name": "JAHIA Sustainable Enterprise License (JSEL) 2.0",
  "category": "Commercial",
  "owner": "Jahia",
  "homepage_url": "https://github.com/Jahia/jahia/blob/master/license/jsel.txt",
  "spdx_license_key": "LicenseRef-scancode-jsel-2.0",
  "text": "JAHIA SUSTAINABLE ENTERPRISE LICENSE (JSEL)\nVersion 2.0\n\nINTRODUCTION\n\nThe JAHIA Sustainable Enterprise License (\"License\") may include: 1) Test,\nResearch and Development Right of Usage and 2) Commercial Right of Usage. You\nhave agreed to the terms of this License by selecting the \"Accept\" button at the\nend of the JSEL or executing a hardcopy JSEL or a document that expressly\nreferred to the License with Jahia Solutions Group SA (\"JSG\").\n\nThe Commercial Use must be approved by You and JSG with the signature of a\nrelated document, delivered by JSG, in order to become effective. Capitalized\nterms used in this License are defined in the Definitions section.\n\n1. DEFINITIONS.\n\n1.1. \"Approved Counterpart\" means the Modification(s), which are identified by\nYou as potential Generic Elements, which you suggest as a counterpart to JSG and\nwhich were accepted, validated and developed by JSG.\n\n1.2. \"Commercial Use\" means any use of Original Software by You, alone or\nbundled with any other software or hardware, at the exclusion of any Test,\nResearch and Development Use.\n\n1.3. \"Contributor\" means each individual or entity that creates or contributes\nto the creation of Modifications.\n\n1.4. \"Covered Software\" means (a) the Original Software, or (b) Generic\nDevelopments, or (c) the combination of files containing Original Software with\nfiles containing Generic Developments, in each case including portions thereof.\n\n1.5. \"Executable\" means the Covered Software in any form other than Source Code.\n\n1.6. \"Generic Developments\" are defined as Modifications done at Your request by\nJSG as a contribution to the Original Software and identified as such on the JSG\nOrder Forms signed by You. Once incorporated into the Original Software, Generic\nDevelopments are by nature subject to the terms of the licenses used by JSG.\n\n1.7. \"Generic Elements\" means, without limitation: software, modules, patches,\nbug fixes, API, ideas, methods, concepts, know-how, structures, techniques,\ninventions, developments, processes, discoveries, improvements and other\ninformation and materials developed by JSG before or during the execution of JSG\nOffering.\n\n1.8. \"JSG Offering\": software and services proposed by JSG under JSG terms and\nconditions.\n\n1.9. \"JSG Terms and Conditions\": terms and conditions under which JSG is\nproviding JSG Offering to You.\n\n1.10. \"Larger Work\" means a work which combines Covered Software or portions\nthereof with code not governed by the terms of this License.\n\n1.11. \"License\" means this document.\n\n1.12. \"Licensable\" means having the right to grant, to the maximum extent\npossible, whether at the time of the initial grant or subsequently acquired, any\nand all of the rights conveyed herein.\n\n1.13. \"Modifications\" means the Source Code and Executable form of any of the\nfollowing:\n\nA. Any file that results from an addition to, deletion from or modification of\nthe contents of a file containing Original Software or previous Modifications;\n\nB. Any new file that contains any part of the Original Software or previous\nModification; or\n\nC. Any new file that is contributed or otherwise made available under the terms\nof this License.\n\n1.14. \"Original Software\" means the Source Code and Executable form of the Jahia\nEnterprise Edition software code that is released under this License.\n\n1.15. \"Patent Claims\" means any patent claim(s), now owned or hereafter\nacquired, including without limitation, method, process, and apparatus claims,\nin any patent Licensable by grantor.\n\n1.16. \"Source Code\" means (a) the common form of computer software code in which\nmodifications are made and (b) associated documentation included in or with such\ncode.\n\n1.17. \"Specific Developments\" are defined as the work performed at Your request\nand identified as such in the context of JSG Order Forms that are associated\nwith said Specific Developments and are signed by You before any work is done.\n\n1.18. \"Specific Elements\" are defined as all of the elements supplied to JSG by\nYou in the context of performance of the Services, for which You owns the\nintellectual property rights.\n\n1.19. \"Test, Research and Development Use\" means use of the Original Software\nonly for testing, researching and developing the Original Software and expressly\nexcludes any distribution rights and use for direct or indirect commercial or\nstrategic gain or advantage which is subject to execution of a purchase or\nreselling agreement by You and JSG.\n\n1.20. \"You\" (or \"Your\") means an individual or a legal entity exercising rights\nunder, and complying with all of the terms of, this License. For legal entities,\n\"You\" includes any entity which controls, is controlled by, or is under common\ncontrol with You. For purposes of this definition, \"control\" means (a) the\npower, direct or indirect, to cause the direction or management of such entity,\nwhether by contract or otherwise, or (b) ownership of more than fifty percent\n(50%) of the outstanding shares or beneficial ownership of such entity.\n\n2. LICENSE GRANTS FOR RESEARCH AND DEVELOPMENT USE.\n\nJSG hereby grants You a world-wide, royalty-free, non-exclusive Test, Research\nand Development Use license:\n\n(a) under intellectual property rights (other than patent or trademark),\nlicensable by JSG, to use, modify, display, and perform the Original Software\n(or portions thereof), with or without Modifications, and/or as part of a Larger\nWork, for Test, Research and Development Use by You; and\n\n(b) under Patent Claims infringed by the making or using of Original Software,\nto make, have made, use, practice and/or otherwise dispose of the Original\nSoftware (or portions thereof) for Test, Research and Development Use by You.\n\n(c) The licenses granted in Sections 2(a) and 2(b) are effective on the date JSG\nfirst distributes or otherwise makes the Original Software available to a third\nparty under the terms of this License for Test, Research and Development Use by\nYou.\n\n(d) Notwithstanding Section 2(b) above, no patent license is granted: (1) for\ncode that You delete from the Original Software, or (2) for infringements caused\nby: (i) the modification of the Original Software, or (ii) the combination of\nthe Original Software with other software or devices.\n\n(e) Execution of the Covered Software for all other purposes than mentioned in\nthis Section is subject to a fee, payable to JSG and to be mutually agreed upon\nby You and JSG. The grant explicitly does not apply to Commercial Use of the\nOriginal Software. Commercial Use of Original Software requires a signed\napproval explicitly issued for that purpose by JSG.\n\n(f) Other than the rights expressly granted in this License, JSG retains all\nrights, titles, and interests in the Original Software.\n\n3. LICENSE GRANTS FOR COMMERCIAL USE.\n\n3.1. Commercial Use of the Original Software requires the payment of a fee as\ndescribe by JSG in JSG Offering. The details of Your fees, payment schedule and\nscope of use (subscription, number of JVM, users, servers, modules, support\nscope,...) applicable have to be agreed on a document provided by JSG and signed\nby You according to JSG Offering.\n\n3.2. Conditioned upon the payment of the appropriate fee to JSG, the respect of\nthis License terms and limited to the scope of Commercial Use as defined by JSG,\nJSG hereby grants You a world-wide, non-exclusive and fee-bearing license:\n\n(a) under intellectual property rights (other than patent or trademark)\nLicensable by JSG, to use, display, perform the Original Software (or portions\nthereof), with or without Modifications, and/or as part of a Larger Work for\nCommercial Use; and\n\n(b) under Patent Claims infringed by the making or using of Original Software,\nto make, have made, use, practice, sell, and offer for sale, and/or otherwise\ndispose of the Original Software (or portions thereof) for Commercial Use.\n\n(c) The licenses granted are effective on the date JSG first distributes or\notherwise makes the Original Software available to a third party under the terms\nof this License.\n\n(d) Notwithstanding Section 3(b) above, no patent license is granted: (1) for\ncode that You delete from the Original Software, or (2) for infringements caused\nby: (i) the modification of the Original Software, or (ii) the combination of\nthe Original Software with other software or devices.\n\n(e) Other than the rights expressly granted in this License, JSG retains all\nrights, titles, and interests in Original Software\n\n3.3. Commercial Distribution Requirement / OEM Agreement\nYou may distribute copies for Commercial Use or integrate Original Software in a\nLarger Work under a license agreement of Your choice which is consistent with\nYour rights and obligations under the License including with the fact that you\nneed to pay fees to JSG for each copy of the Original Software you distribute\nfor Commercial Use according to a specific Agreement, You and JSG have to sign\nbefore the Distribution of the Larger work.  You may provide warranties,\nindemnities and/or other additional terms and conditions in Your license\nagreements, provided that it is clear that such additional terms and conditions\nare offered by You only. You hereby agree to indemnify JSG for any liability\nincurred by the Initial Developer as a result of any such terms You offer.\n\n4. AVAILABILITY AND POTENTIAL MODIFICATIONS OF SOURCE CODE.\n\n4.1. Conditioned upon Your compliance with this License, JSG hereby grants You\nan access to the Original Software Source Code. The Modifications of the Source\nCode that You may create or to which You may contribute, are, by nature,\ngoverned by the terms of this License. JSG Offering (for example, support\nservices) may not cover Modifications on the Original Software otherwise than\nthose explicitly accepted by JSG in a dedicated agreement as, for example, when\nthose Modifications are integrated in the Original Software and therefore\nconsidered as a Generic Development according to the term of paragraph 12 of\nthis License.\n\n4.2. JSG may optionally offer coverage on a Larger Work. Details of the related\nfees, payment schedule and scope of coverage have to be defined in a dedicated\nagreement signed between You and JSG.\n\n5. VERSION OF THE LICENSE\n\n5.1. New Versions\nJSG is the initial license steward and may publish revised and/or new versions\nof this License from time to time. Each version will be given a distinguishing\nversion number. No one other than the license steward has the right to modify\nthis License.\n\n5.2. Effect of New Versions\nYou may always continue to a)use the version of the Original Software under the\nterms of the version of the License under which You originally received the\nversion of Original Software or b)use the new version.\n\n6. CONFIDENTIALITY\n\nYou and JSG agree to maintain the confidentiality of any proprietary information\nreceived by the other party during, or prior to entering into, this Agreement\nincluding non-public technical and business information for a period of two (2)\nyears after the termination of this Agreement. This section shall not apply to\nany publicly available or independently developed information. The receiving\nparty of any confidential information of the other party agrees not to use said\nconfidential information for any purpose except as necessary to fulfil its\nobligations and exercise its rights under this Agreement. The receiving party\nshall protect the secrecy of and avoid disclosure and unauthorized use of the\ndisclosing party's confidential information to the same degree that it takes to\nprotect its own confidential information and in no event less than reasonable\ncare.\n\n7. DISCLAIMER OF WARRANTY.\n\nCOVERED SOFTWARE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT\nLIMITATION, WARRANTIES THAT THE COVERED SOFTWARE IS FREE OF DEFECTS,\nMERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE COVERED SOFTWARE IS WITH YOU. SHOULD ANY\nCOVERED SOFTWARE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER\nOR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR\nCORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS\nLICENSE. NO USE OF ANY COVERED SOFTWARE IS AUTHORIZED HEREUNDER EXCEPT UNDER\nTHIS DISCLAIMER.\n\n8. LIMITATION OF LIABILITY.\n\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING\nNEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL YOU, THE INITIAL DEVELOPER, ANY OTHER\nCONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED SOFTWARE, OR ANY SUPPLIER OF ANY OF\nSUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR\nCONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES\nFOR LOST PROFITS, LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR\nMALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH\nPARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS\nLIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL\nINJURY RESULTING FROM SUCH PARTY\"S NEGLIGENCE TO THE EXTENT APPLICABLE LAW\nPROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR\nLIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND\nLIMITATION MAY NOT APPLY TO YOU.\n\n9. U.S. GOVERNMENT END USERS.\n\nThe Original Software is a \"commercial item,\" as that term is defined in 48\nC.F.R. 2.101 (Oct. 1995), consisting of \"commercial computer software\" (as that\nterm is defined at 48 C.F.R. 252.227-7014(a)(1)) and \"commercial computer\nsoftware documentation\" as such terms are used in 48 C.F.R. 12.212 (Sept. 1995).\nConsistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4\n(June 1995), all U.S. Government End Users acquire Covered Software with only\nthose rights set forth herein. This U.S. Government Rights clause is in lieu of,\nand supersedes, any other FAR, DFAR, or other clause or provision that addresses\nGovernment rights in computer software under this License.\n\n10. TERMINATION.\n\nThis License and the rights granted hereunder will terminate automatically if\nYou fail to comply with terms herein and fail to cure such breach within 30 days\nof becoming aware of the breach. Provisions which, by their nature, must remain\nin effect beyond the termination of this License shall survive.\n\nThe Term of this License is subject to your compliance with the term of this\nLicense and the payment of the appropriate fee according to JSG Offering\nconsidering the Commercial Use of the Software.\n\n11. MISCELLANEOUS.\n\nThis License represents the complete agreement concerning subject matter hereof.\nIf any provision of this License is held to be unenforceable, such provision\nshall be reformed only to the extent necessary to make it enforceable. This\nLicense shall be governed by the law of the jurisdiction specified in the JSG\nTerms and Conditions (except to the extent applicable law, if any, provides\notherwise), excluding such jurisdiction\"s conflict-of-law provisions. Any\nlitigation relating to this License shall be subject to the jurisdiction of the\ncourts located in the jurisdiction and venue specified in a notice contained\nwithin in the JSG Terms and Conditions, with the losing party responsible for\ncosts, including, without limitation, court costs and reasonable attorney\"s fees\nand expenses. The application of the United Nations Convention on Contracts for\nthe International Sale of Goods is expressly excluded. Any law or regulation\nwhich provides that the language of a contract shall be construed against the\ndrafter shall not apply to this License. You agree that You alone are\nresponsible for compliance with the United States export administration\nregulations (and the export control laws and regulation of any other countries)\nwhen You use, distribute or otherwise make available any Covered Software.\n\n12. GENERIC DEVELOPMENT, APPROVED COUNTERPART, AND JOIN CONTRIBUTION\n\n12.1. JSG offers a counterpart, usually under the form of a free Commercial\nRight of usage of the Software attached to the payment of a subscription, in\nexchange of a Generic Developments and Your copyright assignment to JSG, when\nthe related Generic Developments are financed by You, except for the co-\ndevelopment cases of join contribution (12.7)).\n\n12.2. The decision to accept a Generic Development as an Approved Counterpart,\nits value, the form of compensation and the criteria applied are let to the sole\ndiscretion of JSG.\n\n12.3. Description of the Approved Counterpart, its value and the type of\ncompensation which shall be approved by both parties in a separated document\nprovided by JSG.\n\n12.4. Modifications considered as Approved Counterpart are, by nature, Generic\nDevelopments.\n\n12.5. All Specific Elements, not owned by JSG and provided by You to JSG for\nServices execution, shall remain Your exclusive property when You owns the\nproperty of specific materials.\n\n12.6. All specific development, requested by You from JSG and listed on\ndedicated JSG document shall remain Your exclusive property except for the\nGeneric Elements, even if these Generic Elements are developed at the same time\nas the Specific development and/or are needed by the Specific development to\nwork, particularly when Generic Elements are integrated in the Original Software\nand therefore are by nature subject to the terms of the licenses used by JSG.\n\n12.7. Join contribution:\nAs an exclusive exception to the Generic Developments definition, JSG may agree\nto accept some Modifications done by You in order to complete all - or part of -\nGeneric Developments. This particular type of Generic Developments is considered\nas \"Join Contributions\" between You and JSG and You are considered as a\nContributor for the related Generic Development You agreed to take in charge\nunder the following rules:\n\na) Contributor owns, and has sufficient rights to contribute, all source code\nand related material intended to be compiled or integrated with the source code\nfor the Modifications Contributor has ever delivered, and JSG has accepted, for\nincorporation into the Covered Software.\n\nb) Contributor hereby assigns to JSG joint ownership in all worldwide common law\nand statutory rights associated with the copyrights, copyright application,\ncopyright registration and moral rights in the Approved Counterpart to the\nextent allowable under applicable local laws and copyright conventions.\nContributor agrees that this assignment may be submitted by JSG to register a\ncopyright in the Approved Counterpart. Contributor retains the right to use the\nApproved Counterpart for Contributor's own purposes. This joint copyright\nAssignment supersedes and replaces all prior copyright assignments made by\nContributor to JSG for the related Modifications provided by Contributor in this\ncase of join contribution.\n\nc) Contributor grants JSG the ability to use the related Modifications he\nprovided in any way with a sublicenseable, non-exclusive, irrevocable,\nworldwide, royalty-free, transferable license to relicense, use, copy, modify,\ndistribute and publicly perform and display the related Modifications on any\nlicensing terms (commercial or not).\n\nd) Contributor is legally entitled to grant the above assignment and agrees not\nto provide any Contribution that violates any law or breaches any contract.\n\ne) JSG may require You to submit your Modifications within a specific period of\ntime. The default period is 6 months.\n\nf) The right to validate your Modifications as an Approved Counterpart is only\napplicable by JSG. JSG may ask for additional corrections on Your Modifications\nbefore definitively accepting it as an Approved Counterpart.\n\ng) Each party is responsible for claims and damages arising, directly or\nindirectly, out of its utilization of rights under this License and You agree to\nwork with JSG to distribute such responsibility according to the Modifications\nContributor provided. Nothing herein is intended or shall be deemed to\nconstitute any admission of liability."
}