{
  "key": "keep-ee-2024",
  "short_name": "Keep Enterprise Edition (EE)",
  "name": "The Keep Enterprise Edition (EE) license (the Enterprise License)",
  "category": "Commercial",
  "owner": "Keep",
  "homepage_url": "https://github.com/keephq/keep/blob/main/ee/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-keep-ee-2024",
  "faq_url": "https://www.keephq.dev/terms-of-service",
  "other_urls": [
    "https://www.keephq.dev/pricing",
    "https://github.com/keephq/keep"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2024-present Keep Alerting LTD"
  ],
  "ignorable_holders": [
    "Keep Alerting LTD"
  ],
  "ignorable_urls": [
    "https://www.keephq.dev/terms-of-service"
  ],
  "text": "The Keep Enterprise Edition (EE) license (the Enterprise License)\nCopyright (c) 2024-present Keep Alerting LTD\n\nWith regard to the Keep Software:\n\nThis software and associated documentation files (the \"Software\") may only be\nused in production, if you (and any entity that you represent) have agreed to,\nand are in compliance with, the Keep Subscription Terms of Service, available \n(if not available, it's impossible to comply)\nat https://www.keephq.dev/terms-of-service (the \"The Enterprise Terms”), or other\nagreement governing the use of the Software, as agreed by you and Keep,\nand otherwise have a valid Keep Enterprise Edition subscription for the\ncorrect number of user seats. Subject to the foregoing sentence, you are free to\nmodify this Software and publish patches to the Software. You agree that Keep\nand/or its licensors (as applicable) retain all right, title and interest in and\nto all such modifications and/or patches, and all such modifications and/or\npatches may only be used, copied, modified, displayed, distributed, or otherwise\nexploited with a valid Keep Enterprise Edition subscription for the  correct\nnumber of user seats. You agree that Keep and/or its licensors (as applicable) retain\nall right, title and interest in and to all such modifications.  You are not\ngranted any other rights beyond what is expressly stated herein. Subject to the\nforegoing, it is forbidden to copy, merge, publish, distribute, sublicense,\nand/or sell the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\nFor all third party components incorporated into the Keep Software, those\ncomponents are licensed under the original license provided by the owner of the\napplicable component."
}