{
  "key": "lal-1.2",
  "language": "fr",
  "short_name": "Licence Art Libre 1.2",
  "name": "Licence Art Libre 1.2",
  "category": "Copyleft",
  "owner": "Licence Art Libre",
  "homepage_url": "http://artlibre.org/licence/lal/licence-art-libre-12/",
  "spdx_license_key": "LAL-1.2",
  "text_urls": [
    "http://artlibre.org/licence/lal/licence-art-libre-12/",
    "http://artlibre.org/licence/lal/it/",
    "http://artlibre.org/licence/lal/es/"
  ],
  "text": "Licence Art Libre \n\u2028[ Copyleft Attitude ]\nVersion 1.2\n\nPréambule :\n\nAvec cette Licence Art Libre, l’autorisation est donnée de copier, de diffuser et de transformer librement les oeuvres dans le respect des droits de l’auteur.\n\nLoin d’ignorer les droits de l’auteur, cette licence les reconnaît et les protège. Elle en reformule le principe en permettant au public de faire un usage créatif des oeuvres d’art.\u2028 \nAlors que l’usage fait du droit de la propriété littéraire et artistique conduit à restreindre l’accès du public à l’oeuvre, la Licence Art Libre a pour but de le favoriser.\u2028 \nL’intention est d’ouvrir l’accès et d’autoriser l’utilisation des ressources d’une oeuvre par le plus grand nombre. En avoir jouissance pour en multiplier les réjouissances, créer de nouvelles conditions de création pour amplifier les possibilités de création. Dans le respect des auteurs avec la reconnaissance et la défense de leur droit moral.\n\nEn effet, avec la venue du numérique, l’invention de l’internet et des logiciels libres, un nouveau mode de création et de production est apparu. Il est aussi l’amplification de ce qui a été expérimenté par nombre d’artistes contemporains. \nLe savoir et la création sont des ressources qui doivent demeurer libres pour être encore véritablement du savoir et de la création. C’est à dire rester une recherche fondamentale qui ne soit pas directement liée à une application concrète. Créer c’est découvrir l’inconnu, c’est inventer le réel avant tout souci de réalisme.\u2028 \nAinsi, l’objet de l’art n’est pas confondu avec l’objet d’art fini et défini comme tel.\u2028C’est la raison essentielle de cette Licence Art Libre : promouvoir et protéger des pratiques artistiques libérées des seules règles de l’économie de marché.\n\nDÉFINITIONS\n\n– L’oeuvre :\u2028il s’agit d’une oeuvre commune qui comprend l’oeuvre originelle ainsi que toutes les contributions postérieures (les originaux conséquents et les copies). Elle est créée à l’initiative de l’auteur originel qui par cette licence définit les conditions selon lesquelles les contributions sont faites.\n\n– L’oeuvre originelle :\u2028c’est-à-dire l’oeuvre créée par l’initiateur de l’oeuvre commune dont les copies vont être modifiées par qui le souhaite.\n\n– Les oeuvres conséquentes :\u2028c’est-à-dire les propositions des auteurs qui contribuent à la formation de l’oeuvre en faisant usage des droits de reproduction, de diffusion et de modification que leur confère la licence.\n\n– Original (source ou ressource de l’oeuvre) :\u2028exemplaire daté de l’oeuvre, de sa définition, de sa partition ou de son programme que l’auteur présente comme référence pour toutes actualisations, interprétations, copies ou reproductions ultérieures.\n\n– Copie :\u2028toute reproduction d’un original au sens de cette licence.\n\n– Auteur de l’oeuvre originelle :\u2028c’est la personne qui a créé l’oeuvre à l’origine d’une arborescence de cette oeuvre modifiée. Par cette licence, l’auteur détermine les conditions dans lesquelles ce travail se fait.\n\n– Contributeur :\u2028toute personne qui contribue à la création de l’oeuvre. Il est l’auteur d’une oeuvre originale résultant de la modification d’une copie de l’oeuvre originelle ou de la modification d’une copie d’une oeuvre conséquente.\n\n1. OBJET \nCette licence a pour objet de définir les conditions selon lesquelles vous pouvez jouir librement de cette oeuvre.\n\n2. L’ÉTENDUE DE LA JOUISSANCE \nCette oeuvre est soumise au droit d’auteur, et l’auteur par cette\u2028licence vous indique quelles sont vos libertés pour la copier, la\u2028diffuser et la modifier:\n\n2.1 LA LIBERTÉ DE COPIER (OU DE REPRODUCTION) \nVous avez la liberté de copier cette oeuvre pour un usage personnel, pour vos amis, ou toute autre personne et quelque soit la technique employée.\n\n2.2 LA LIBERTÉ DE DIFFUSER, D’INTERPRÉTER (OU DE REPRÉSENTATION) \nVous pouvez diffuser librement les copies de ces oeuvres, modifiées\u2028ou non, quel que soit le support, quel que soit le lieu, à titre onéreux ou gratuit si vous respectez toutes les conditions suivantes:\u2028 \n– joindre aux copies, cette licence à l’identique, ou indiquer précisément où se trouve la licence,\u2028 – indiquer au destinataire le nom de l’auteur des originaux,\u2028 – indiquer au destinataire où il pourra avoir accès aux originaux\u2028(originels et/ou conséquents). L’auteur de l’original pourra, s’il le souhaite, vous autoriser à diffuser l’original dans les mêmes conditions que les copies.\n\n2.3 LA LIBERTÉ DE MODIFIER \nVous avez la liberté de modifier les copies des originaux (originels\u2028et conséquents), qui peuvent être partielles ou non, dans le respect des conditions prévues à l’article 2.2 en cas de diffusion (ou représentation) de la copie modifiée.\u2028L’auteur de l’original pourra, s’il le souhaite, vous autoriser à modifier l’original dans les mêmes conditions que les copies.\n\n3. L’INCORPORATION DE L’OEUVRE \nTous les éléments de cette oeuvre doivent demeurer libres, c’est pourquoi il ne vous est pas permis d’intégrer les originaux (originels et conséquents) dans une autre oeuvre qui ne serait pas soumise à cette licence.\n\n4. VOS DROITS D’AUTEUR \nCette licence n’a pas pour objet de nier vos droits d’auteur sur votre contribution. En choisissant de contribuer à l’évolution de cette oeuvre, vous acceptez seulement d’offrir aux autres les mêmes droits sur votre contribution que ceux qui vous ont été accordés par cette licence.\n\n5. LA DURÉE DE LA LICENCE \nCette licence prend effet dès votre acceptation de ses dispositions. Le fait de copier, de diffuser, ou de modifier l’oeuvre constitue une acception tacite.\u2028Cette licence a pour durée la durée des droits d’auteur attachés à l’oeuvre. Si vous ne respectez pas les termes de cette licence, vous perdez automatiquement les droits qu’elle vous confère.\u2028Si le régime juridique auquel vous êtes soumis ne vous permet pas de respecter les termes de cette licence, vous ne pouvez pas vous prévaloir des libertés qu’elle confère.\n\n6. LES DIFFÉRENTES VERSIONS DE LA LICENCE \nCette licence pourra être modifiée régulièrement, en vue de son amélioration, par ses auteurs (les acteurs du mouvement « copyleft attitude ») sous la forme de nouvelles versions numérotées. \nVous avez toujours le choix entre vous contenter des dispositions contenues dans la version sous laquelle la copie vous a été communiquée ou alors, vous prévaloir des dispositions d’une des versions ultérieures.\n\n7. LES SOUS-LICENCES \nLes sous licences ne sont pas autorisées par la présente. Toute personne qui souhaite bénéficier des libertés qu’elle confère sera liée directement à l’auteur de l’oeuvre originelle.\n\n8. LA LOI APPLICABLE AU CONTRAT \nCette licence est soumise au droit français."
}