{
  "key": "lal-1.3",
  "language": "fr",
  "short_name": "Licence Art Libre 1.3",
  "name": "Licence Art Libre 1.3",
  "category": "Copyleft",
  "owner": "Licence Art Libre",
  "homepage_url": "http://artlibre.org/",
  "spdx_license_key": "LAL-1.3",
  "other_urls": [
    "http://artlibre.org/licence/lal/en/",
    "https://artlibre.org/"
  ],
  "text": "Licence Art Libre 1.3 (LAL 1.3)\nPréambule :\n\nAvec la Licence Art Libre, l’autorisation est donnée de copier, de diffuser et de transformer librement les œuvres dans le respect des droits de l’auteur.\n\nLoin d’ignorer ces droits, la Licence Art Libre les reconnaît et les protège. Elle en reformule l’exercice en permettant à tout un chacun de faire un usage créatif des productions de l’esprit quels que soient leur genre et leur forme d’expression.\n\nSi, en règle générale, l’application du droit d’auteur conduit à restreindre l’accès aux œuvres de l’esprit, la Licence Art Libre, au contraire, le favorise. L’intention est d’autoriser l’utilisation des ressources d’une œuvre ; créer de nouvelles conditions de création pour amplifier les possibilités de création. La Licence Art Libre permet d’avoir jouissance des œuvres tout en reconnaissant les droits et les responsabilités de chacun.\n\nAvec le développement du numérique, l’invention d’internet et des logiciels libres, les modalités de création ont évolué : les productions de l’esprit s’offrent naturellement à la circulation, à l’échange et aux transformations. Elles se prêtent favorablement à la réalisation d’œuvres communes que chacun peut augmenter pour l’avantage de tous.\n\nC’est la raison essentielle de la Licence Art Libre : promouvoir et protéger ces productions de l’esprit selon les principes du copyleft : liberté d’usage, de copie, de diffusion, de transformation et interdiction d’appropriation exclusive.\n\nDéfinitions :\n\nNous désignons par « œuvre », autant l’œuvre initiale, les œuvres conséquentes, que l’œuvre commune telles que définies ci-après :\n\nL’œuvre commune :\u2028Il s’agit d’une œuvre qui comprend l’œuvre initiale ainsi que toutes les contributions postérieures (les originaux conséquents et les copies). Elle est créée à l’initiative de l’auteur initial qui par cette licence définit les conditions selon lesquelles les contributions sont faites.\n\nL’œuvre initiale :\u2028C’est-à-dire l’œuvre créée par l’initiateur de l’œuvre commune dont les copies vont être modifiées par qui le souhaite.\n\nLes œuvres conséquentes :\u2028C’est-à-dire les contributions des auteurs qui participent à la formation de l’œuvre commune en faisant usage des droits de reproduction, de diffusion et de modification que leur confère la licence.\n\nOriginaux (sources ou ressources de l’œuvre) :\u2028Chaque exemplaire daté de l’œuvre initiale ou conséquente que leurs auteurs présentent comme référence pour toutes actualisations, interprétations, copies ou reproductions ultérieures.\n\nCopie :\u2028Toute reproduction d’un original au sens de cette licence.\n\n1- OBJET. \nCette licence a pour objet de définir les conditions selon lesquelles vous pouvez jouir librement de l’œuvre.\n\n2. L’ÉTENDUE DE LA JOUISSANCE. \nCette œuvre est soumise au droit d’auteur, et l’auteur par cette licence vous indique quelles sont vos libertés pour la copier, la diffuser et la modifier.\n\n2.1 LA LIBERTÉ DE COPIER (OU DE REPRODUCTION). \nVous avez la liberté de copier cette œuvre pour vous, vos amis ou toute autre personne, quelle que soit la technique employée.\n\n2.2 LA LIBERTÉ DE DIFFUSER (INTERPRÉTER, REPRÉSENTER, DISTRIBUER). \nVous pouvez diffuser librement les copies de ces œuvres, modifiées ou non, quel que soit le support, quel que soit le lieu, à titre onéreux ou gratuit, si vous respectez toutes les conditions suivantes :\n\n1.\tjoindre aux copies cette licence à l’identique ou indiquer précisément où se trouve la licence ; \n2.\tindiquer au destinataire le nom de chaque auteur des originaux, y compris le vôtre si vous avez modifié l’œuvre ; \n3.\tindiquer au destinataire où il pourrait avoir accès aux originaux (initiaux et/ou conséquents).\n\nLes auteurs des originaux pourront, s’ils le souhaitent, vous autoriser à diffuser l’original dans les mêmes conditions que les copies.\n\n2.3 LA LIBERTÉ DE MODIFIER. \nVous avez la liberté de modifier les copies des originaux (initiaux et conséquents) dans le respect des conditions suivantes :\n\n1.\tcelles prévues à l’article 2.2 en cas de diffusion de la copie modifiée ; \n2.\tindiquer qu’il s’agit d’une œuvre modifiée et, si possible, la nature de la modification ; \n3.\tdiffuser cette œuvre conséquente avec la même licence ou avec toute licence compatible ; \n4.\tLes auteurs des originaux pourront, s’ils le souhaitent, vous autoriser à modifier l’original dans les mêmes conditions que les copies.\n\n3. DROITS CONNEXES. \nLes actes donnant lieu à des droits d’auteur ou des droits voisins ne doivent pas constituer un obstacle aux libertés conférées par cette licence.\u2028C’est pourquoi, par exemple, les interprétations doivent être soumises à la même licence ou une licence compatible. De même, l’intégration de l’œuvre à une base de données, une compilation ou une anthologie ne doit pas faire obstacle à la jouissance de l’œuvre telle que définie par cette licence.\n\n4. L’ INTÉGRATION DE L’ŒUVRE. \nToute intégration de cette œuvre à un ensemble non soumis à la LAL doit assurer l’exercice des libertés conférées par cette licence. \nSi l’œuvre n’est plus accessible indépendamment de l’ensemble, alors l’intégration n’est possible qu’à condition que l’ensemble soit soumis à la LAL ou une licence compatible.\n\n5. CRITÈRES DE COMPATIBILITÉ. \nUne licence est compatible avec la LAL si et seulement si :\n\n1.\telle accorde l’autorisation de copier, diffuser et modifier des copies de l’œuvre, y compris à des fins lucratives, et sans autres restrictions que celles qu’impose le respect des autres critères de compatibilité ; \n2.\telle garantit la paternité de l’œuvre et l’accès aux versions antérieures de l’œuvre quand cet accès est possible ; \n3.\telle reconnaît la LAL également compatible (réciprocité) ; \n4.\telle impose que les modifications faites sur l’œuvre soient soumises à la même licence ou encore à une licence répondant aux critères de compatibilité posés par la LAL.\n\n6. VOS DROITS INTELLECTUELS. \nLa LAL n’a pas pour objet de nier vos droits d’auteur sur votre contribution ni vos droits connexes. En choisissant de contribuer à l’évolution de cette œuvre commune, vous acceptez seulement d’offrir aux autres les mêmes autorisations sur votre contribution que celles qui vous ont été accordées par cette licence. Ces autorisations n’entraînent pas un dessaisissement de vos droits intellectuels.\n\n7. VOS RESPONSABILITÉS. \nLa liberté de jouir de l’œuvre tel que permis par la LAL (liberté de copier, diffuser, modifier) implique pour chacun la responsabilité de ses propres faits.\n\n8. LA DURÉE DE LA LICENCE. \nCette licence prend effet dès votre acceptation de ses dispositions. Le fait de copier, de diffuser, ou de modifier l’œuvre constitue une acceptation tacite.\u2028 \nCette licence a pour durée la durée des droits d’auteur attachés à l’œuvre. Si vous ne respectez pas les termes de cette licence, vous perdez automatiquement les droits qu’elle vous confère.\u2028Si le régime juridique auquel vous êtes soumis ne vous permet pas de respecter les termes de cette licence, vous ne pouvez pas vous prévaloir des libertés qu’elle confère.\n\n9. LES DIFFÉRENTES VERSIONS DE LA LICENCE. \nCette licence pourra être modifiée régulièrement, en vue de son amélioration, par ses auteurs (les acteurs du mouvement Copyleft Attitude) sous la forme de nouvelles versions numérotées.\u2028 \nVous avez toujours le choix entre vous contenter des dispositions contenues dans la version de la LAL sous laquelle la copie vous a été communiquée ou alors, vous prévaloir des dispositions d’une des versions ultérieures.\n\n10. LES SOUS-LICENCES. \nLes sous-licences ne sont pas autorisées par la présente. Toute personne qui souhaite bénéficier des libertés qu’elle confère sera liée directement aux auteurs de l’œuvre commune.\n\n11. LE CONTEXTE JURIDIQUE. \nCette licence est rédigée en référence au droit français et à la Convention de Berne relative au droit d’auteur."
}