{
  "key": "lbnl-bsd",
  "short_name": "LBNL BSD Variant",
  "name": "Lawrence Berkeley National Labs BSD variant license",
  "category": "Permissive",
  "owner": "Regents of the University of California",
  "homepage_url": "https://fedoraproject.org/wiki/Licensing:LBNLBSD?rd=Licensing/LBNLBSD",
  "spdx_license_key": "BSD-3-Clause-LBNL",
  "other_urls": [
    "https://fedoraproject.org/wiki/Licensing/LBNLBSD"
  ],
  "minimum_coverage": 90,
  "ignorable_copyrights": [
    "Copyright (c) 2003, The Regents of the University of California, through Lawrence Berkeley National Laboratory"
  ],
  "ignorable_holders": [
    "The Regents of the University of California, through Lawrence Berkeley National Laboratory"
  ],
  "text": "Copyright (c) 2003, The Regents of the University of California, through\nLawrence Berkeley National Laboratory (subject to receipt of any required\napprovals from the U.S. Dept. of Energy). All rights reserved. \n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n(1) Redistributions of source code must retain the above copyright notice,\nthis list of conditions and the following disclaimer.\n\n(2) Redistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation\nand/or other materials provided with the distribution.\n\n(3) Neither the name of the University of California, Lawrence Berkeley National\nLaboratory, U.S. Dept. of Energy nor the names of its contributors may be\nused to endorse or promote products derived from this software without specific\nprior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER\nOR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;\nOR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\nIN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\nYou are under no obligation whatsoever to provide any bug fixes, patches,\nor upgrades to the features, functionality or performance of the source code\n(\"Enhancements\") to anyone; however, if you choose to make your Enhancements\navailable either publicly, or directly to Lawrence Berkeley National Laboratory,\nwithout imposing a separate written license agreement for such Enhancements,\nthen you hereby grant the following license: a non-exclusive, royalty-free\nperpetual license to install, use, modify, prepare derivative works, incorporate\ninto other computer software, distribute, and sublicense such Enhancements\nor derivative works thereof, in binary and source code form."
}