{
  "key": "ldpgpl-1a",
  "short_name": "LDPGPL-1a",
  "name": "Linux Documentation Project General Public License v1a, November 1998",
  "category": "Copyleft",
  "owner": "Linux Documentation Project",
  "spdx_license_key": "LicenseRef-scancode-ldpgpl-1a",
  "text_urls": [
    "https://old.calculate-linux.org/packages/licenses/LDP-1a"
  ],
  "text": "LDP GENERAL PUBLIC LICENSE\n             Version 1a, November 1998\n\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any document which contains a notice\nplaced by the copyright holder saying it may be distributed\nunder the terms of this LDP General Public License.\nThe \"Document\" below refers to any such document, and\n\"work based on the Document\" means either the Document\nor any derivative work under copyright law: that is to say,\na work containing the Document or part of it, either verbatim\nor with modifications and/or translated into another language.\n(Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.\n\n  1. You may copy and distribute verbatim copies of the Document's\nsource code as you receive it, in any medium, provided that you\nappropriately publish on each copy an appropriate copyright notice\nand disclaimer of warranty; keep intact all the notices that refer\nto this License and to the absence of any warranty; and give any\nother recipients of the Document a copy of this License along with\nthe Document.\n\nYou may charge a fee for the physical act of producing or transferring\na copy.\n\n  2. You may modify your copy or copies of the Document or any portion\nof it, thus forming a work based on the Document, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Document or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n  3. You may copy and distribute the Document (or a work based on it,\nunder Section 2) in any form under the terms of Sections 1 and 2 above\nprovided that you also either accompany it with the complete corresponding\nmachine-readable source code, or provide an URL, valid for at least\nthree months, where this complete corresponding machine-readable source code\nis available, and can be retrieved by any anonymous user.\n\n  4. You may not copy, modify, sublicense, or distribute the Document\nexcept as expressly provided under this License.\n\n  5. Each time you redistribute the Document (or any work based on the\nDocument), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Document subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein."
}