{
  "key": "lgpl-3.0-plus-openssl",
  "is_deprecated": true,
  "replaced_by": [
    "lgpl-3.0-plus WITH openssl-exception-lgpl-3.0-plus",
    "zpl-2.1",
    "zlib"
  ],
  "short_name": "LGPL 3.0 or later with OpenSSL exception",
  "name": "LGPL 3.0 or later with OpenSSL exception",
  "category": "Copyleft Limited",
  "owner": "psycopg",
  "homepage_url": "http://initd.org/psycopg/license/",
  "notes": "this is a composite and exception",
  "is_exception": true,
  "text": "psycopg2 and the LGPL\n\npsycopg2 is free software: you can redistribute it and/or modify it under the\nterms of the GNU Lesser General Public License as published by the Free Software\nFoundation, either version 3 of the License, or (at your option) any later\nversion.\n\npsycopg2 is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A\nPARTICULAR PURPOSE. See the GNU Lesser General Public License for more details.\n\nIn addition, as a special exception, the copyright holders give permission to\nlink this program with the OpenSSL library (or with modified versions of OpenSSL\nthat use the same license as OpenSSL), and distribute linked combinations\nincluding the two.\n\nYou must obey the GNU Lesser General Public License in all respects for all of\nthe code used other than OpenSSL. If you modify file(s) with this exception, you\nmay extend this exception to your version of the file(s), but you are not\nobligated to do so. If you do not wish to do so, delete this exception statement\nfrom your version. If you delete this exception statement from all source files\nin the program, then also delete it here.\n\nYou should have received a copy of the GNU Lesser General Public License along\nwith psycopg2 (see the doc directory.) If not, see http://www.gnu.org/licenses/.\n\nAlternative licenses\n\nIf you prefer you can use the Zope Database Adapter ZPsycopgDA (i.e., every file\ninside the ZPsycopgDA directory) user the ZPL license as published on the Zope\nweb site.\n\nAlso, the following BSD-like license applies (at your option) to the files\nfollowing the pattern psycopg/adapter*.{h,c} and psycopg/microprotocol*.{h,c}:\n\nPermission is granted to anyone to use this software for any purpose, including\ncommercial applications, and to alter it and redistribute it freely, subject to\nthe following restrictions:\n\nThe origin of this software must not be misrepresented; you must not claim that\nyou wrote the original software. If you use this software in a product, an\nacknowledgment in the product documentation would be appreciated but is not\nrequired.\n\nAltered source versions must be plainly marked as such, and must not be\nmisrepresented as being the original software.\n\nThis notice may not be removed or altered from any source distribution."
}