{
  "key": "lgpl-3-plus-linking",
  "is_deprecated": true,
  "replaced_by": [
    "lgpl-3.0-plus WITH lgpl-3.0-linking-exception"
  ],
  "short_name": "LGPL 3.0 or later with Linking exception",
  "name": "LGPL 3.0 or later with Linking exception",
  "category": "Copyleft Limited",
  "owner": "Canonical Inc.",
  "homepage_url": "https://github.com/go-yaml/yaml/blob/v2/LICENSE",
  "notes": "replaced by linking-exception-lgpl-3.0",
  "is_exception": true,
  "text_urls": [
    "https://github.com/go-yaml/yaml/blob/v2/LICENSE"
  ],
  "text": "This library is free software; you can redistribute it and/or modify it under\nthe terms of the GNU Lesser General Public License as published by the Free\nSoftware Foundation; either version 3 of the License, or (at your option) any\nlater version.\n\nThis library is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A\nPARTICULAR PURPOSE.  See the GNU Lesser General Public License for more details.\n\nYou should have received a copy of the GNU Lesser General Public License along\nwith this library; if not, write to the Free Software Foundation, Inc., 51\nFranklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n\nAs a special exception to the GNU Lesser General Public License version 3\n(\"LGPL3\"), the copyright holders of this Library give you permission to convey\nto a third party a Combined Work that links statically or dynamically to this\nLibrary without providing any Minimal Corresponding Source or Minimal\nApplication Code as set out in 4d or providing the installation information set\nout in section 4e, provided that you comply with the other provisions of LGPL3\nand provided that you meet, for the Application the terms and conditions of the\nlicense(s) which apply to the Application.\n\nExcept as stated in this special exception, the provisions of LGPL3 will\ncontinue to comply in full to this Library. If you modify this Library, you may\napply this exception to your version of this Library, but you are not obliged to\ndo so. If you do not wish to do so, delete this exception statement from your\nversion. This exception does not (and cannot) modify any license terms which\napply to the Application, with which you must still comply."
}