{
  "key": "lha",
  "short_name": "lha",
  "name": "LHA",
  "category": "Free Restricted",
  "owner": "Yooichi Tagawa",
  "homepage_url": "http://www.copyleftlicense.com/licenses/lha-license-version-10/view.php",
  "notes": "From https://github.com/ErikMcClure/bad-licenses",
  "spdx_license_key": "LicenseRef-scancode-lha",
  "ignorable_emails": [
    "gotom@debian.org"
  ],
  "text": "LHA LICENSE\n\nPermission is given for redistribution, copy, and modification provided\n   following conditions are met.\n   1. Do not remove copyright clause.\n   2. Distribution shall conform:\n    a. The content of redistribution (i.e., source code, documentation,\n       and reference guide for programmers) shall include original contents.\n       If contents are modified, the document clearly indicating\n       the fact of modification must be included.\n    b. If LHa is redistributed with added values, you must put your best\n       effort to include them (Translator comment: If read literally,\n       original Japanese was unclear what \"them\" means here.  But\n       undoubtedly this \"them\" means source code for the added value\n       portion and this is a typical Japanese sloppy writing style to\n       abbreviate as such)  Also the document clearly indicating that\n       added value was added must be included.\n    c. Binary only distribution is not allowed (including added value\n       ones.)\n   3. You need to put effort to distribute the latest version (This is not\n      your duty).\n      NB: Distribution on Internet is free.  Please notify me by e-mail or\n      other means prior to the distribution if distribution is done through\n      non-Internet media (Magazine, CDROM etc.)  If not, make sure to Email\n      me later.\n   4. Any damage caused by the existence and use of this program will not\n      be compensated.\n   5. Author will not be responsible to correct errors even if program is\n      defective.\n   6. This program, either as a part of this or as a whole of this, may be\n      included into other programs.  In this case, that program is not LHa\n      and can not call itself LHa.\n   7. For commercial use, in addition to above conditions, following\n      condition needs to be met.\n      a.  The program whose content is mainly this program can not be used\n          commercially.\n      b.  If the recipient of commercial use deems inappropriate as a\n          program user, you must not distribute.\n      c.  If used as a method for the installation, you must not force\n          others to use this program.  In this case, commercial user will\n          perform its work while taking full responsibility of its outcome.\n      d.  If added value is done under the commercial use by using this\n          program, commercial user shall provide its support.\n(Osamu Aoki also comments:\n   Here \"commercial\" may be interpreted as \"for-fee\".  \"Added value\" seems\n   to mean \"feature enhancement\".  )\nTranslated License Statement by Tsugio Okamoto (translated by\nGOTO Masanori <gotom@debian.org>):\n   It's free to distribute on the network, but if you distribute for\n   the people who cannot access the network (by magazine or CD-ROM),\n   please send E-Mail (Inter-Net address) to the author before the\n   distribution. That's well where this software is appeard.\n   If you cannot do, you must send me the E-Mail later.`"
}