{
  "key": "libgeotiff",
  "short_name": "libgeoTiff License",
  "name": "libgeoTiff License",
  "category": "Permissive",
  "owner": "GeoTIFF",
  "homepage_url": "http://trac.osgeo.org/geotiff/browser/tags/libgeotiff-1.4.0/LICENSE",
  "notes": "composite",
  "spdx_license_key": "LicenseRef-scancode-libgeotiff",
  "minimum_coverage": 80,
  "ignorable_copyrights": [
    "Copyright (c) 1999, Frank Warmerdam",
    "copyright (c) 1995 Niles D. Ritter"
  ],
  "ignorable_holders": [
    "Frank Warmerdam",
    "Niles D. Ritter"
  ],
  "text": "libgeotiff Licensing\n====================\n\nAll the source code in this toolkit are either in the public domain, or under\nan X style license.  In any event it is all considered to be free to use\nfor any purpose (including commercial software).  No credit is required\nthough some of the code requires that the specific source code modules\nretain their existing copyright statements.  The CSV files, and other tables\nderived from the EPSG coordinate system database are also free to use.  In\nparticular, no part of this code is \"copyleft\", nor does it imply any\nrequirement for users to disclose this or their own source code.\n\nAll components not carrying their own copyright message, but distributed\nwith libgeotiff should be considered to be under the same license as\nNiles' code.\n\n---------\n\nCode by Frank Warmerdam has this copyright notice (directly copied from\nX Consortium licence):\n\n * Copyright (c) 1999, Frank Warmerdam\n *\n * Permission is hereby granted, free of charge, to any person obtaining a\n * copy of this software and associated documentation files (the \"Software\"),\n * to deal in the Software without restriction, including without limitation\n * the rights to use, copy, modify, merge, publish, distribute, sublicense,\n * and/or sell copies of the Software, and to permit persons to whom the\n * Software is furnished to do so, subject to the following conditions:\n *\n * The above copyright notice and this permission notice shall be included\n * in all copies or substantial portions of the Software.\n *\n * THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL\n * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\n * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n * DEALINGS IN THE SOFTWARE.\n\n-----------\n\nCode by Niles Ritter is under this licence:\n\n *    Written By: Niles D. Ritter.\n *\n *  copyright (c) 1995   Niles D. Ritter\n *\n *  Permission granted to use this software, so long as this copyright\n *  notice accompanies any products derived therefrom.\n\n-----------\n\nThe EPSG Tables (from which the CSV files, and .inc files are derived)\ncarried this statement on use of the data (from the EPSG web site):\n\nUse of the Data\n\nThe user assumes the entire risk as to the accuracy and the use of this\ndata. The data may be used, copied and distributed subject to the following\nconditions:\n\n1. INFORMATION PROVIDED IN THIS DOCUMENT IS PROVIDED \"AS IS\"\n   WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED,\n   INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF\n   MERCHANTABILITY AND/OR FITNESS FOR A PARTICULAR PURPOSE.\n\n2. The data may be included in any commercial package provided that any\n   commerciality is based on value added by the provider and not on a value\n   ascribed to the EPSG dataset which is made available at no charge. The\n   ownership of the EPSG dataset [OGP] must be acknowledged.\n\n3. Subsets of information may be extracted from the dataset. Users are\n   advised that coordinate reference system and coordinate transformation\n   descriptions are incomplete unless all elements detailed as essential\n   in OGP Surveying and Positioning Guidance Note 7-1 annex F are included.\n\n4. Essential elements should preferably be reproduced as described in the\n   dataset.  Modification of parameter values is permitted as described in\n   the table below to allow change to the content of the information provided\n   that numeric equivalence is achieved.  Numeric equivalence refers to the\n   results of geodetic calculations in which the parameters are used, for\n   example (i) conversion of ellipsoid defining parameters, or (ii) conversion\n   of parameters between one and two standard parallel projection methods,\n   or (iii) conversion of parameters between 7-parameter geocentric\n   transformation methods.\n\n   (EPSG provides a table at this point with some details)\n\n5. No data that has been modified other than as permitted in these terms\n   and conditions shall be described as or attributed to the EPSG dataset."
}