{
  "key": "logica-1.0",
  "short_name": "Logica OSL 1.0",
  "name": "Logica Open Source License v1.0",
  "category": "Permissive",
  "owner": "Logica",
  "homepage_url": "http://opensmpp.logica.com/CommonPart/Download/Download.htm",
  "spdx_license_key": "LicenseRef-scancode-logica-1.0",
  "text_urls": [
    "http://opensmpp.logica.com/CommonPart/Download/Download.htm"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 1996-2001 Logica Mobile Networks Limited"
  ],
  "ignorable_holders": [
    "Logica Mobile Networks Limited"
  ],
  "text": "Logica Open Source License Version 1.0\nCopyright (c) 1996-2001 Logica Mobile Networks Limited, all rights reserved.\n\nLogica Mobile Networks Limited (\"Logica\") is the owner of the rights\nin the software programs (\"Software\"). In the following text, the term\n\"you\" or \"your\" refers to you as an individual and/or (as the case may be)\nto the legal entity to which the Software has been supplied.  \n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided all copies and partial copies\nmade and/or distributed (in whatever form) and all associated documentation\nand other material must acknowledge Logica's rights by the inclusion\nof the following notice:\n\n\"Copyright (c) 1996-2001 Logica Mobile Networks Limited;\nthis product includes software developed by Logica by whom copyright\nand know-how are retained, all rights reserved.\"  \n\nThe location of such notice shall be such that it is clearly displayed\nand readable to any person accessing the Software.  \n\n\nAny use, copying or distribution of the Software is subject to the following:\n\n* Your rights in respect of the Software are confined to the non-exclusive\n  and non-assignable license expressed herein. If you breach any of these\n  term and conditions then your license may be terminated. \n\n* The copyright and other intellectual property rights in and in connection\n  with the Software are and shall remain the exclusive property of Logica\n  or its third party licensors. You must not remove or alter any copyright\n  or other proprietary notice on any of the software.  \n\n\nTo the extent permitted by law and in the absence of a formal written contract\nbetween you and Logica the following limitations and exclusions also apply:\n\n* The Software is supplied and licensed on an \"as is\" basis without any\n  warranty or representation from Logica of any kind.  \n\n* Conditions, warranties and representations that might be attributed\n  to Logica or the Software (including, but not limited to, any implied\n  condition or warranty relating to merchantability, fitness, suitability\n  or quality) are excluded.\n\n* In no event shall Logica be liable in respect of or in connection\n  with the supply, licensing, use or distribution of the software in any\n  form for any direct, special, indirect or consequential loss or damages\n  or for any loss of use, loss of data or of profits or for any business\n  interruption or loss of goodwill. \n\n* Logica shall have no obligation to fix any defect or deficiency\n  in the Software and Logica shall have no liability for any consequences\n  (direct or consequential) that may arise from any such defect or deficiency.\n\n* Logica's maximum liability (if any) in relation to the licensing,\n  provision and/or performance of the Software shall not exceed the price\n  you paid to secure your license.\n\nThe laws of Ireland shall apply to these terms and conditions and shall\ngovern every aspect of the supply and licensing of the Software."
}