{
  "key": "lzma-sdk-2008",
  "short_name": "LZMA SDK 2008",
  "name": "LZMA SDK 2008",
  "category": "Copyleft Limited",
  "owner": "Igor Pavlov",
  "spdx_license_key": "LicenseRef-scancode-lzma-sdk-2008",
  "ignorable_authors": [
    "Igor Pavlov"
  ],
  "ignorable_urls": [
    "http://www.gnu.org/",
    "http://www.opensource.org/"
  ],
  "text": "LZMA SDK provides the documentation, samples, header files, libraries, \nand tools you need to develop applications that use LZMA compression.\n\nLICENSE\n-------\n\nLZMA SDK is available under any of the following licenses:\n\n1) GNU Lesser General Public License (GNU LGPL)\n2) Common Public License (CPL)\n3) Common Development and Distribution License (CDDL) Version 1.0 \n4) Simplified license for unmodified code (read SPECIAL EXCEPTION) \n\nIt means that you can select one of these options and follow rules of that license.\n\n1,2,3) GNU LGPL, CPL and CDDL licenses are classified as \n - \"Free software licenses\" at http://www.gnu.org/ \n - \"OSI-approved\" at http://www.opensource.org/\n\n4) Simplified license for unmodified code (read SPECIAL EXCEPTION) \n\nIgor Pavlov, as the author of this code, expressly permits you \nto statically or dynamically link your code (or bind by name) \nto the files from LZMA SDK. \n\nSPECIAL EXCEPTION allows you to use LZMA SDK in applications with closed code, \nwhile you keep LZMA SDK code unmodified.\n\nSPECIAL EXCEPTION #2: Igor Pavlov, as the author of this code, expressly permits \nyou to use this code under the same terms and conditions contained in the License \nAgreement you have for any previous version of LZMA SDK developed by Igor Pavlov.\n\nSPECIAL EXCEPTION #2 allows owners of proprietary licenses to use latest version \nof LZMA SDK as update for previous versions.\n\nSome files in LZMA SDK are placed in public domain.\nSome of these \"public domain\" files:\nC\\Types.h,\nC\\LzmaLib.*\nC\\LzmaLibUtil.*\nLzmaAlone.cpp, \nLzmaAlone.cs, \nLzmaAlone.java\n\nSo you can change them as you want and use \"SPECIAL EXCEPTION\" \nfor other unmodified files. For example, you can edit C\\Types.h to solve some \ncompatibility problems with your compiler.\n\n-----\n\nYou should have received a copy of the GNU Lesser General Public\nLicense along with this library; if not, write to the Free Software\nFoundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA\n\nYou should have received a copy of the Common Public License\nalong with this library.\n\nYou should have received a copy of the Common Development and Distribution \nLicense Version 1.0 along with this library."
}