{
  "key": "makeindex",
  "short_name": "MakeIndex Distribution Notice",
  "name": "MakeIndex Distribution Notice",
  "category": "Copyleft",
  "owner": "MakeIndex Project",
  "homepage_url": "https://fedoraproject.org/wiki/Licensing/MakeIndex",
  "notes": "Per Fedora, this license is free but GPL-incompatible, and was found in the\nMakeIndex component inside TeXLive.\n",
  "spdx_license_key": "MakeIndex",
  "text": "MakeIndex Distribution Notice\n\nPermission is hereby granted to make and distribute original copies of this\nprogram provided that the copyright notice and this permission notice are\npreserved and provided that the recipient is not asked to waive or limit his\nright to redistribute copies as allowed by this permission notice and provided\nthat anyone who receives an executable form of this program is granted access\nto a machine-readable form of the source code for this program at a cost not\ngreater than reasonable reproduction, shipping, and handling costs. Executable\nforms of this program distributed without the source code must be accompanied\nby a conspicuous copy of this permission notice and a statement that tells the\nrecipient how to obtain the source code.\n\nPermission is granted to distribute modified versions of all or part of this\nprogram under the conditions above with the additional requirement that the\nentire modified work must be covered by a permission notice identical to this\npermission notice. Anything distributed with and usable only in conjunction with\nsomething derived from this program, whose useful purpose is to extend or adapt\nor add capabilities to this program, is to be considered a modified version of\nthis program under the requirement above. Ports of this program to other systems\nnot supported in the distribution are also considered modified versions. All\nmodified versions should be reported back to the author.\n\nThis program is distributed with no warranty of any sort. No contributor accepts\nresponsibility for the consequences of using this program or for whether it\nserves any particular purpose."
}