{
  "key": "mediatek-proprietary-2020",
  "short_name": "Mediatek Proprietary License 2020",
  "name": "Mediatek Proprietary License 2020",
  "category": "Proprietary Free",
  "owner": "MediaTek",
  "homepage_url": "https://github.com/MediaTek-Labs/mt3620_m4_software/blob/master/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-mediatek-proprietary-2020",
  "text": "License Agreement\nANY ACCESS AND/OR USE OF THE SOFTWARE PACKAGE AND DOCUMENTATION FROM ANY\nWEBSITE AS DESIGNATED BY MEDIATEK INC. (\"MEDIATEK\") (THIS \"WEBSITE\") ARE\nSUBJECT TO THE TERMS AND CONDITIONS SET FORTH IN THIS AGREEMENT.\n1.  Definitions\n1.1 \"Application\" means a software or hardware developed by You using the\nSoftware Package or Documentation for specific use with the devices which\nincorporate MediaTek's chipsets and/or system and under Your own trademark\nand/or brand, including, in respect of such software programs or hardware, all\nbug fixes, enhancements, modifications, new releases, new versions, revisions,\nsupplements, updates and upgrades.\n1.2 \"Documentation\" means any technical specifications, development guideline,\nhardware schematics, hardware diagrams, technical layout and other\nspecifications or documentation that MediaTek may make available or provide to\nYou from this Website relating to or for use in connection with the Software\nPackage or MediaTek's chipsets.\n1.3 \"Critical Open Source Software\" means any software or software component,\nmodule or package that contains, or is derived in any manner (in whole or in\npart) from, any software that is distributed as free software, open source\nsoftware or similar licensing or distribution models that would cause the\nSoftware Package or Applications  to be made available for use or distribution\nby others under a public license, including, without limitation, GNU's General\nPublic License (GPL) or Lesser/Library GPL (LGPL).\n1.4 \"Software Package\" means MediaTek's MT3620 driver software provided or\nmade available to You from this Website for use in connection with the\ndevelopment of Applications, including any Updates that MediaTek may provide\nor make available.\n1.5 \"You\" means the person(s) or entity using the Software Package and/or\nDocumentation, or otherwise exercising rights under this Agreement.\n2.  Term\nThe term of this Agreement commences at the time it becomes effective in the\nmanner described above and continues until terminated by either party in\naccordance with Section 8 (\"Term\").\n3.  Grant of License and Restrictions\n3.1 Subject to the provisions of this Agreement, MediaTek grants and You\naccept, a limited, non-exclusive, non-transferable, non-sublicensable, and\nterminable (under Section 8 hereof ) license, under MediaTek's intellectual\nproperty rights in and to the Software Package and Documentation, during the\nTerm to:\n(a) install a reasonable number of copies of the Software Package solely for\nthe purpose of developing or testing Applications;\n(b) use, copy, modify and compile the Software Package, if provided in source\ncode form, to create derivative works solely for the purpose of developing or\ntesting Application (\"Software Derivatives\");\n(c) make a reasonable number of copies of the Documentation for use and solely\nfor the purpose of developing or testing Applications;\n(d) distribute and/or sublicense  copies of any or all of Software Package\nwhich is required to be incorporated within Application; and\nEach copy will include all notices and legends embedded in the Software Package\nand Documentation.\n3.2 You must ensure that MediaTek's or any third party's copyright disclaimers\nand other proprietary notices that appear in the Software Package and\nDocumentation are retained and reproduced in full in all copies of the Software\nPackage and Documentation that You make as permitted under this Agreement.\n3.3 You must not sell, redistribute, rent, lease, lend all or any part of the\nSoftware Package and Documentation, or enable or allow others to do such things\nexcept as explicitly set forth in this Sections 3 As a condition to the license\ngranted in Section 3.1 above, You shall not (and shall not allow any third\nparty to) decompile, disassemble, reverse engineer or attempt to reconstruct,\nidentify or discover any source code, underlying ideas, underlying algorithms\nof the Software Package provided to You in object code form by any means\nwhatsoever, or disclose any of the foregoing, except to the extent such\nrestriction is expressly prohibited by applicable laws and not waivable\nthereunder.\n3.4 Except for the limited license granted to You in this Agreement, all\nrights, title, and interest in and to the Software Package and Documentation\nthat are made available to You under this Agreement remain, at all times, the\nsole and exclusive property of MediaTek or, for third party software contained\nin the Software Package, such third party. You agree to cooperate with MediaTek\nto maintain MediaTek and such thirty party's ownership of the Software Package\nand Documentation, and You agree to promptly provide notice of any claims or\nthreatened claims relating to the Software Package and Documentation.\n4.  Conditions and Requirements\n4.1 You acknowledge and agree that the Applications shall comply with the\nconditions and requirements set out below:\n(a) Applications shall comply with all applicable laws and regulations\n(including the laws and regulations of any jurisdiction in which the\nApplications are offered or made available). You must not design or market\nApplications for the purpose of violating any legal rights of any person or\nlegal entity (including but not limited to privacy rights).\n(b) You shall also ensure that the Applications do not and will not violate,\nmisappropriate, or infringe any copyright, patent, design, trademark, trade\nsecret, privacy or publicity rights, or any proprietary, intellectual property\nor other legal right of MediaTek or any third party and the embodying of such\ncontent in any Application, does not infringe upon any proprietary or\nintellectual property rights of any third party. You should be solely\nresponsible for such third party contents embodied in the Application and You\nagree and acknowledge that MediaTek has no responsibility or liability relating\nto such third party contents.\n(e) If an Application includes any Critical Open Source Software, You must\ncomply with all licensing terms applicable to such Critical Open Source\nSoftware. However, You shall separate the portion of the Critical Open Source\nSoftware from the portion of the Software Package in the Application or\nLicensed Product and shall not cause the portion of the Software Package in the\nApplication to be subject to the licensing terms applicable to such Critical\nOpen Source Software.\n4.2 You acknowledge and agree that use of the Software Package and Documentation\nis subject to the following conditions:\n(a) You will only use the Software Package and Documentation for the purposes\nand in the manner expressly permitted under this Agreement;\n(b) You will not use the Software Package and Documentation for any unlawful or\nillegal activity;\n(c) You will not develop any Application that would constitute or facilitate the\ncommission of any crime, or any tortious, unlawful, or illegal act;\n(d) You will not use the Software Package to create or enable others to create\nany Application or other program that would disable, hack or otherwise interfere\nwith any authentication, content protection, digital signing, digital rights\nmanagement, security or verification mechanisms implemented in or by the\nSoftware Package, or other MediaTek's software, services or technology; and\n(e) You agree that You are solely responsible (and that MediaTek has no\nliability or responsibility to You or to any third party) for any breach of Your\ncovenants and obligations under this Agreement or any applicable laws and\nregulations, or for the consequences of any such breach (including any loss or\ndamage which MediaTek or any third party may suffer).\n5.  DISCLAIMER OF WARRANTY\n5.1 MEDIATEK MAKES NO WARRANTIES WITH RESPECT TO THE LICENSE GRANTED TO YOU\nHEREUNDER, WHETHER EXPRESSED, IMPLIED, STATUTORY OR OTHERWISE AND MEDIATEK\nEXPRESSLY DISCLAIMS ANY AND ALL WARRANTIES OF ANY KIND, INCLUDING BUT NOT\nLIMITED TO THE IMPLIED WARRANTIES OF MERCHANTIBILITY, FITNESS FOR A PARTICULAR\nPUPOSE AND NON-INFRINGEMENT. MEDIATEK SHALL NOT BE RESPONSIBLE FOR ANY SOFTWARE\nPACKAGE AND/OR DOCUMENTATION RELEASED MADE TO YOUR SPECIFICATION OR CONFORMING\nTO A PARTICULAR STANDARD OR OPEN FORUM. FURTHER, MEDIATEK DOES NOT REPRESENT OR\nWARRANT THAT ANY PORTION OF THE SOFTWARE PACKAGE AND DOCUMENTATION IS FREE OF\nINACCURACIES, ERRORS, BUGS OR INTERRUPTIONS, OR IS RELIABLE, ACCURATE, COMPLETE,\nOR OTHERWISE VALID. THE SOFTWARE PACKAGE AND DOCUMENTATION ARE PROVIDED \"AS IS\"\nAND \"AS AVAILABLE\", WITHOUT ANY WARRANTY OF ANY KIND FROM MEDIATEK. YOUR USE OF\nTHE SOFTWARE PACKAGE AND/OR DOCUMENTATION IS AT YOUR OWN DISCRETION AND RISK.\n5.2 YOU ACKNOWLEDGE THAT SOFTWARE PACKAGE AND DOCUMENTATION MAY BE SUBJECT TO\nIMPORT, EXPORT, AND/OR RE-EXPORT RESTRICTIONS UNDER THE LAWS AND REGULATIONS OF\nRELATED JURISDICTIONS. YOU SHALL NOT EXPORT, RE-EXPORT, IMPORT OR OTHERWISE\nSELL, TRANSFER, DIRECTLY OR INDIRECTLY, SOFTWARE PACKAGE AND/OR DOCUMENTATION\nACQUIRED HEREUNDER EXCEPT IN STRICT COMPLIANCE WITH ALL SUCH APPLICABLE LAWS\nAND REGULATIONS.\n5.3 You hereby acknowledge that the Software Package provided under this\nAgreement might include software from one or more third parties (e.g. open\nsource or proprietary, collectively as \"Third Party Software\") and the use of\nsuch shall be in accordance with the terms and conditions of this Agreement\nunless otherwise specified in the third party software license agreement\naccompanying such Third Party Software. You expressly acknowledge that it is\nYour sole responsibility to obtain from any third party all proper licenses\ncontained in the Software Package. NOTWITHSTANDING ANYTHING CONTAINED HEREIN\nTO THE CONTRARY, MEDIATEK HEREBY EXPRESSLY DISCLAIMS ANY AND ALL WARRANTIES,\nEXPRESS OR IMPLIED, TO THE EXTENT ALLOWED BY APPLICABLE LAWS, WITH RESPECT TO\nANY THIRD PARTY SOFTWARE.\n5.4 Notwithstanding anything contained herein to the contrary, You understand\nand acknowledge that the payment payable to MediaTek hereunder (if any) does not\ninclude royalties or fees payable based on adherence of any Application or\nLicensed Product to published standards, and any such fees are the sole\nresponsibility of You and You have the sole responsibility to procure license of\nany intellectual property right for the Application or Licensed Product to\ncomply with such published standards.\n6.  LIMITATION OF LIABILITY\nMediaTek's entire liability in the aggregate for its breach of the terms\nAgreement shall not exceed the aggregate amount of license fee paid by You to\nMediaTek for the twelve (12) months preceding the event giving rise to the first\nbreach. TO THE FULLEST EXTENT ALLOWED AND PERMITTED BY APPLICABLE LAWS AND\nREGULATIONS, MEDIATEK SHALL NOT, UNDER ANY CIRCUMSTANCES, BE LIABLE TO YOU OR\nANY THIRD PARTY THROUGH YOU FOR PERSONAL INJURY OR ANY CONSEQUENTIAL, EXEMPLARY,\nINCIDENTAL, INDIRECT, PUNITIVE OR SPECIAL DAMAGES WHATSOEVER, INCLUDING, WITHOUT\nLIMITATION, DAMAGES FOR LOSS OF PROFITS, LOSS OF DATA, BUSINESS INTERRUPTION OR\nANY OTHER COMMERCIAL DAMAGES OR LOSSES, ARISING OUT OF OR IN RELATION TO THIS\nAGREEMENT, YOUR USE OF THE SOFTWARE PACKAGE AND DOCUMENTATION, OR YOUR\nDEVELOPMENT OF APPLICATIONS, WHETHER BASED ON BREACH OF CONTRACT, BREACH OF\nWARRANTY, TORT (INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR OTHERWISE, EVEN IF\nMEDIATEK HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES AND NOTWITHSTANDING\nTHE FAILURE OF ESSENTIAL PURPOSE OF ANY REMEDY. YOUR UNDERSTSANDING,\nACKNOWLEDGEMENT AND ACCEPTANCE OF THIS AGREEMENT ARE THE LEGAL BASIS AND\nCONSIDERATION FOR THE LICENSES GRANTED UNDER IT.\n7.  Indemnity\n7.1 To the fullest extent permitted by law, You agree to indemnify, defend and\nhold harmless MediaTek, its affiliates, directors, officers, employees,\nindependent contractors and agents (each an \"Indemnified Party\") from any and\nall claims, losses, liabilities, damages, expenses and costs (including without\nlimitation reasonable attorneys fees) (collectively \"Losses\") incurred by a\nIndemnified Party as a result of Your  breach of this Agreement, any claims that\nthe Applications and/or Modifications violate or infringe any third party\nintellectual property or proprietary rights, or otherwise related to or arising\nfrom Your use of the Software Package, Documentation or the Applications or Your\ndevelopment or distribution of Applications.\n7.2 You acknowledge that the Software Package and Documentation are not intended\nto be used in the development of any Application where death, personal injury,\nor severe physical or environmental damage could result from errors or\ninaccuracies in the content, data or information provided by the Application or\nthe Application failing. To the extent permitted by law, You agree to indemnify,\ndefend and hold harmless each Indemnified Party from any Losses incurred by such\nIndemnified Party as a result of Your use of the Software Package and/or\nDocumentation in the development of any such Applications.\n8.  Termination\n8.1 Right to Terminate.\nThis Agreement and all rights granted by MediaTek hereunder will automatically\nterminate without notice by MediaTek: (i) if You have breached any terms of this\nAgreement; or (ii) if MediaTek is required by law to terminate this Agreement or\nthe rights granted by MediaTek hereunder.\nMediaTek will have no liability to pay compensation or damages, or to provide an\nindemnity, of any kind as a result of terminating this Agreement in accordance\nwith its terms, and termination of this Agreement is without prejudice to any\nother right or remedy that MediaTek may have, now or at any time in the future.\n8.2 Consequences of Termination\nUpon the termination of this Agreement: (a) all rights granted to You in this\nAgreement will terminate; (b) You shall promptly stop using the Software Package\nand Documentation and destroy all electronic copies of the Software Package and\nDocumentation The provisions of Sections 1, 3.2, 3.3, 3.4, 4, 5, 6, 7, 8.2 and 9\nwill survive the expiration or termination of this Agreement.\n9.  Governing Law.\nThis Agreement shall be governed by and construed in accordance with the laws of\nthe Republic of Singapore, without regard to any conflict-of-laws rules."
}