{
  "key": "mediatek-proprietary-2005",
  "short_name": "Mediatek Proprietary License 2005",
  "name": "Mediatek Proprietary License 2005",
  "category": "Proprietary Free",
  "owner": "MediaTek",
  "homepage_url": "https://github.com/MediaTek-Labs/mt3620_m4_software/blob/master/MT3620_M4_Sample_Code/OS_HAL/src/os_hal_mbox.c",
  "spdx_license_key": "LicenseRef-scancode-mediatek-proprietary-2005",
  "text": "This MT3620 driver software/firmware and related documentation\n(\"MediaTek Software\") are protected under relevant copyright laws.\nThe information contained herein is confidential and proprietary to\nMediaTek Inc. (\"MediaTek\"). You may only use, reproduce, modify, or\ndistribute (as applicable) MediaTek Software if you have agreed to and been\nbound by this Statement and the applicable license agreement with MediaTek\n(\"License Agreement\") and been granted explicit permission to do so within\nthe License Agreement (\"Permitted User\"). If you are not a Permitted User,\nplease cease any access or use of MediaTek Software immediately.\n\nBY OPENING THIS FILE, RECEIVER HEREBY UNEQUIVOCALLY ACKNOWLEDGES AND AGREES\nTHAT MEDIATEK SOFTWARE RECEIVED FROM MEDIATEK AND/OR ITS REPRESENTATIVES ARE\nPROVIDED TO RECEIVER ON AN \"AS-IS\" BASIS ONLY. MEDIATEK EXPRESSLY DISCLAIMS\nANY AND ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\nIMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR\nNONINFRINGEMENT. NEITHER DOES MEDIATEK PROVIDE ANY WARRANTY WHATSOEVER WITH\nRESPECT TO THE SOFTWARE OF ANY THIRD PARTY WHICH MAY BE USED BY,\nINCORPORATED IN, OR SUPPLIED WITH MEDIATEK SOFTWARE, AND RECEIVER AGREES TO\nLOOK ONLY TO SUCH THIRD PARTY FOR ANY WARRANTY CLAIM RELATING THERETO.\nRECEIVER EXPRESSLY ACKNOWLEDGES THAT IT IS RECEIVER'S SOLE RESPONSIBILITY TO\nOBTAIN FROM ANY THIRD PARTY ALL PROPER LICENSES CONTAINED IN MEDIATEK\nSOFTWARE. MEDIATEK SHALL ALSO NOT BE RESPONSIBLE FOR ANY MEDIATEK SOFTWARE\nRELEASES MADE TO RECEIVER'S SPECIFICATION OR TO CONFORM TO A PARTICULAR\nSTANDARD OR OPEN FORUM. RECEIVER'S SOLE AND EXCLUSIVE REMEDY AND MEDIATEK'S\nENTIRE AND CUMULATIVE LIABILITY WITH RESPECT TO MEDIATEK SOFTWARE RELEASED\nHEREUNDER WILL BE ANY SOFTWARE LICENSE FEES OR SERVICE CHARGE PAID BY\nRECEIVER TO MEDIATEK DURING THE PRECEDING TWELVE (12) MONTHS FOR SUCH\nMEDIATEK SOFTWARE AT ISSUE."
}