{
  "key": "mediatek-proprietary-2008",
  "short_name": "MediaTek Proprietary License 2008",
  "name": "MediaTek Proprietary License 2008",
  "category": "Proprietary Free",
  "owner": "MediaTek",
  "homepage_url": "https://github.com/LIFECorp/mediatek/blob/master/external/mp3dec/mp3dec_exp.h",
  "spdx_license_key": "LicenseRef-scancode-mediatek-proprietary-2008",
  "ignorable_copyrights": [
    "MediaTek Inc. (c) 2008"
  ],
  "ignorable_holders": [
    "MediaTek Inc."
  ],
  "text": "This software is protected by Copyright and the information contained\nherein is confidential. The software may not be copied and the information\ncontained herein may not be used or disclosed except with the written\npermission of MediaTek Inc. (C) 2008\n\nBY OPENING THIS FILE, BUYER HEREBY UNEQUIVOCALLY ACKNOWLEDGES AND AGREES\nTHAT THE SOFTWARE/FIRMWARE AND ITS DOCUMENTATIONS (\"MEDIATEK SOFTWARE\")\nRECEIVED FROM MEDIATEK AND/OR ITS REPRESENTATIVES ARE PROVIDED TO BUYER ON\nAN \"AS-IS\" BASIS ONLY. MEDIATEK EXPRESSLY DISCLAIMS ANY AND ALL WARRANTIES,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NONINFRINGEMENT.\nNEITHER DOES MEDIATEK PROVIDE ANY WARRANTY WHATSOEVER WITH RESPECT TO THE\nSOFTWARE OF ANY THIRD PARTY WHICH MAY BE USED BY, INCORPORATED IN, OR\nSUPPLIED WITH THE MEDIATEK SOFTWARE, AND BUYER AGREES TO LOOK ONLY TO SUCH\nTHIRD PARTY FOR ANY WARRANTY CLAIM RELATING THERETO. MEDIATEK SHALL ALSO\nNOT BE RESPONSIBLE FOR ANY MEDIATEK SOFTWARE RELEASES MADE TO BUYER'S\nSPECIFICATION OR TO CONFORM TO A PARTICULAR STANDARD OR OPEN FORUM.\n\nBUYER'S SOLE AND EXCLUSIVE REMEDY AND MEDIATEK'S ENTIRE AND CUMULATIVE\nLIABILITY WITH RESPECT TO THE MEDIATEK SOFTWARE RELEASED HEREUNDER WILL BE,\nAT MEDIATEK'S OPTION, TO REVISE OR REPLACE THE MEDIATEK SOFTWARE AT ISSUE,\nOR REFUND ANY SOFTWARE LICENSE FEES OR SERVICE CHARGE PAID BY BUYER TO\nMEDIATEK FOR SUCH MEDIATEK SOFTWARE AT ISSUE.\n\nTHE TRANSACTION CONTEMPLATED HEREUNDER SHALL BE CONSTRUED IN ACCORDANCE\nWITH THE LAWS OF THE STATE OF CALIFORNIA, USA, EXCLUDING ITS CONFLICT OF\nLAWS PRINCIPLES.  ANY DISPUTES, CONTROVERSIES OR CLAIMS ARISING THEREOF AND\nRELATED THERETO SHALL BE SETTLED BY ARBITRATION IN SAN FRANCISCO, CA, UNDER\nTHE RULES OF THE INTERNATIONAL CHAMBER OF COMMERCE (ICC).\n"
}