{
  "key": "mediatek-proprietary-2016",
  "short_name": "Mediatek Proprietary License 2016",
  "name": "Mediatek Proprietary License 2016",
  "category": "Proprietary Free",
  "owner": "MediaTek",
  "homepage_url": "https://github.com/mangOH/MT7697_WiFi_BT_fw/blob/master/inc/task_def.h",
  "spdx_license_key": "LicenseRef-scancode-mediatek-proprietary-2016",
  "text": "This software/firmware and related documentation (\"MediaTek Software\") are\nprotected under relevant copyright laws. The information contained herein\nis confidential and proprietary to MediaTek Inc. (\"MediaTek\") and/or its licensors.\nWithout the prior written permission of MediaTek and/or its licensors,\nany reproduction, modification, use or disclosure of MediaTek Software,\nand information contained herein, in whole or in part, shall be strictly prohibited.\nYou may only use, reproduce, modify, or distribute (as applicable) MediaTek Software\nif you have agreed to and been bound by the applicable license agreement with\nMediaTek (\"License Agreement\") and been granted explicit permission to do so within\nthe License Agreement (\"Permitted User\").  If you are not a Permitted User,\nplease cease any access or use of MediaTek Software immediately.\n\nBY OPENING THIS FILE, RECEIVER HEREBY UNEQUIVOCALLY ACKNOWLEDGES AND AGREES\nTHAT MEDIATEK SOFTWARE RECEIVED FROM MEDIATEK AND/OR ITS REPRESENTATIVES\nARE PROVIDED TO RECEIVER ON AN \"AS-IS\" BASIS ONLY. MEDIATEK EXPRESSLY DISCLAIMS ANY AND ALL\nWARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NONINFRINGEMENT.\nNEITHER DOES MEDIATEK PROVIDE ANY WARRANTY WHATSOEVER WITH RESPECT TO THE\nSOFTWARE OF ANY THIRD PARTY WHICH MAY BE USED BY, INCORPORATED IN, OR\nSUPPLIED WITH MEDIATEK SOFTWARE, AND RECEIVER AGREES TO LOOK ONLY TO SUCH\nTHIRD PARTY FOR ANY WARRANTY CLAIM RELATING THERETO. RECEIVER EXPRESSLY ACKNOWLEDGES\nTHAT IT IS RECEIVER'S SOLE RESPONSIBILITY TO OBTAIN FROM ANY THIRD PARTY ALL PROPER LICENSES\nCONTAINED IN MEDIATEK SOFTWARE. MEDIATEK SHALL ALSO NOT BE RESPONSIBLE FOR ANY MEDIATEK\nSOFTWARE RELEASES MADE TO RECEIVER'S SPECIFICATION OR TO CONFORM TO A PARTICULAR\nSTANDARD OR OPEN FORUM. RECEIVER'S SOLE AND EXCLUSIVE REMEDY AND MEDIATEK'S ENTIRE AND\nCUMULATIVE LIABILITY WITH RESPECT TO MEDIATEK SOFTWARE RELEASED HEREUNDER WILL BE,\nAT MEDIATEK'S OPTION, TO REVISE OR REPLACE MEDIATEK SOFTWARE AT ISSUE,\nOR REFUND ANY SOFTWARE LICENSE FEES OR SERVICE CHARGE PAID BY RECEIVER TO\nMEDIATEK FOR SUCH MEDIATEK SOFTWARE AT ISSUE."
}