{
  "key": "minecraft-mod",
  "short_name": "Minecraft Mod License",
  "name": "Minecraft Mod License",
  "category": "Proprietary Free",
  "owner": "Unspecified",
  "homepage_url": "https://bdew.net/",
  "notes": "From https://github.com/ErikMcClure/bad-licenses",
  "spdx_license_key": "LicenseRef-scancode-minecraft-mod",
  "text": "Minecraft: Denotes a copy of the Minecraft game licensed by Mojang AB\nUser: Anybody that interacts with the software in one of the following ways:\n   - play\n   - decompile\n   - recompile or compile\n   - modify\n   - distribute\nMod: The mod code designated by the present license, in source form, binary\nform, as obtained standalone, as part of a wider distribution or resulting from\nthe compilation of the original or modified sources.\nDependency: Code required for the mod to work properly. This includes\ndependencies required to compile the code as well as any file or modification\nthat is explicitely or implicitely required for the mod to be working.\n1. Scope\n--------\nThe present license is granted to any user of the mod. As a prerequisite,\na user must own a legally acquired copy of Minecraft\n2. Liability\n------------\nThis mod is provided 'as is' with no warranties, implied or otherwise. The owner\nof this mod takes no responsibility for any damages incurred from the use of\nthis mod. This mod alters fundamental parts of the Minecraft game, parts of\nMinecraft may not work with this mod installed. All damages caused from the use\nor misuse of this mad fall on the user.\n3. Play rights\n--------------\nThe user is allowed to install this mod on a client or a server and to play\nwithout restriction.\n4. Modification rights\n----------------------\nThe user has the right to decompile the source code, look at either the\ndecompiled version or the original source code, and to modify it.\n5. Derivation rights\n--------------------\nThe user has the rights to derive code from this mod, that is to say to\nwrite code that extends or instanciate the mod classes or interfaces, refer to\nits objects, or calls its functions. This code is known as \"derived\" code, and\ncan be licensed under a license different from this mod.\n6. Distribution of original or modified copy rights\n---------------------------------------------------\nIs subject to distribution rights this entire mod in its various forms. This\ninclude:\n   - original binary or source forms of this mod files\n   - modified versions of these binaries or source files, as well as binaries\n     resulting from source modifications\n   - patch to its source or binary files\n   - any copy of a portion of its binary source files\nThe user is allowed to redistribute this mod partially, in totality, or\nincluded in a distribution.\nWhen distributing binary files, the user must provide means to obtain its\nentire set of sources or modified sources at no costs.\nAll distributions of this mod must remain licensed under the MMPL.\nAll dependencies that this mod have on other mods or classes must be licensed\nunder conditions comparable to this version of MMPL, with the exception of the\nMinecraft code and the mod loading framework (e.g. ModLoader, ModLoaderMP or\nBukkit).\nModified version of binaries and sources, as well as files containing sections\ncopied from this mod, should be distributed under the terms of the present\nlicense."
}