{
  "key": "mit-kyle-restrictions",
  "short_name": "MIT with Jamie Kyle Restrictions",
  "name": "MIT with Jamie Kyle Restrictions",
  "category": "Proprietary Free",
  "owner": "Jamie Kyle",
  "homepage_url": "https://github.com/jamiebuilds/license",
  "spdx_license_key": "LicenseRef-scancode-mit-kyle-restrictions",
  "text": "This license is granted to everyone except for the following entities and\nany of their subsidiaries:\n\n- \"Microsoft Corporation\" (for working with ICE)\n- \"Palantir Technologies\" (for working with ICE)\n- \"Amazon.com, Inc.\" (for abusive treatment of workers and for working with ICE)\n- \"Northeastern University\" (for working with ICE)\n- \"Ernst & Young\" (for working with ICE)\n- \"Thomson Reuters\" (for working with ICE)\n- \"Motorola Solutions\" (for working with ICE)\n- \"Deloitte Consulting LLP\" (for working with ICE)\n- \"John Hopkins University\" (for working with ICE)\n- \"Dell Inc\" (for working with ICE)\n- \"Xerox Corporation\" (for working with ICE)\n- \"Canon Inc\" (for working with ICE)\n- \"Vermont State Colleges\" (for working with ICE)\n- \"Charter Communications\"/\"Spectrum\"/\"Time Warner Cable\" (for working with ICE)\n- \"LinkedIn Corporation\" (for working with ICE)\n- \"United Parcel Service Co\" (for working with ICE)\n- \"Walmart Inc\" (for abusive treatment of workers)\n- \"Sears Holding Corporation\" (for abusive treatment of workers)\n- \"Apple Inc\" (for abusive treatment of workers)\n- \"Tyson Foods Inc\" (for abusive treatment of workers)\n- \"Target Corporation\" (for union busting and anti-union propaganda)\n- \"The H&M group\" (for abusive treatment of workers)\n- \"Tesla, Inc\" (for abusive treatment of workers)\n\nMIT License\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE."
}