{
  "key": "mit-no-trademarks",
  "short_name": "MIT No Commercial Use of Trademarks",
  "name": "MIT No Commercial Use of Trademarks",
  "category": "Permissive",
  "owner": "MIT",
  "homepage_url": "http://web.mit.edu/ivlib/www/copyright.html",
  "spdx_license_key": "LicenseRef-scancode-mit-no-trademarks",
  "ignorable_copyrights": [
    "Copyright 1995 by the Massachusetts Institute of Technology"
  ],
  "ignorable_holders": [
    "the Massachusetts Institute of Technology"
  ],
  "text": "MIT Copyright Notice\n\nProject Athena, Athena Dashboard, Athena MUSE, Kerberos, X Window System,\nTechInfo, and Zephyr are trademarks of the Massachusetts Institute of Technology\n(MIT). Athena, Discuss, Hesiod, Moria, OLC, and TechMail are registered\ntrademarks of MIT. No commercial use of these trademarks may be made without\nprior written permission of MIT.\n\nThis software is being provided to you, the LICENSEE, by the Massachusetts\nInstitute of Technology (M.I.T.) under the following license. By obtaining,\nusing and/or copying this software, you agree that you have read, understood,\nand will comply with these terms and conditions:\n\nPermission to use, copy, modify and distribute this software and its\ndocumentation for any purpose and without fee or royalty is hereby granted,\nprovided that you agree to comply with the following copyright notice and\nstatements, including the disclaimer, and that the same appear on ALL copies of\nthe software and documentation, including modifications that you make for\ninternal use or for distribution:\n\nCopyright 1995 by the Massachusetts Institute of Technology. All rights reserved.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\", AND M.I.T. MAKES NO REPRESENTATIONS OR\nWARRANTIES, EXPRESS OR IMPLIED. By way of example, but not limitation, M.I.T.\nMAKES NO REPRESENTATIONS OR WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY\nPARTICULAR PURPOSE OR THAT THE USE OF THE LICENSED SOFTWARE OR DOCUMENTATION\nWILL NOT INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER\nRIGHTS.\n\nThe name of the Massachusetts Institute of Technology or M.I.T. may NOT be used\nin advertising or publicity pertaining to distribution of the software. Title to\ncopyright in this software and any associated documentation shall at all times\nremain with M.I.T., and LICENSEE agrees to preserve same."
}