{
  "key": "morbig-ieee-std-usage",
  "short_name": "IEEE Std 1003.1 Text Usage",
  "name": "IEEE Std 1003.1 Text Usage",
  "category": "Permissive",
  "owner": "ANR",
  "homepage_url": "https://github.com/colis-anr/morbig/blob/main/COPYING",
  "spdx_license_key": "LicenseRef-scancode-morbig-ieee-std-usage",
  "other_urls": [
    "http://www.opengroup.org/unix/online.html",
    "https://www.man7.org/linux/man-pages/man3/dprintf.3p.html",
    "https://fedoraproject.org/wiki/Licensing:IEEEDocLicense"
  ],
  "standard_notice": "Morbig is free software: you can redistribute it and/or modify it\nunder the terms of the GNU General Public License, version 3. The\ncomplete license terms can be found in the file GPL3.\nIn accordance with Section 7 of the GNU General Public License version 3,\nthe following additional terms apply:\n",
  "ignorable_copyrights": [
    "Copyright (c) 2016 by The Institute of Electrical and Electronics Engineers, Inc"
  ],
  "ignorable_holders": [
    "The Institute of Electrical and Electronics Engineers, Inc"
  ],
  "ignorable_urls": [
    "http://www.opengroup.org/unix/online.html"
  ],
  "text": "The Institute of Electrical and Electronics Engineers and The Open Group,\nhave given us permission to reprint portions of their documentation.\n\nIn the following statement, the phrase ``this text'' refers to portions\nof the system documentation.\n\nPortions of this text are reprinted and reproduced in electronic form\nin the source code of Morbig, from IEEE Std 1003.1, 2016 Edition,\nStandard for Information Technology -- Portable Operating System\nInterface (POSIX), The Open Group Base Specifications Issue 7,\nCopyright (C) 2016 by The Institute of Electrical and Electronics\nEngineers, Inc and The Open Group.  In the event of any discrepancy\nbetween these versions and the original IEEE and The Open Group\nStandard, the original IEEE and The Open Group Standard is the referee\ndocument.  The original Standard can be obtained online at\nhttp://www.opengroup.org/unix/online.html .\n\nThis notice shall appear on any product containing this material.\n\nIf descriptions are added to the material that are in conflict with\nthe Standard then such conflicting descriptions must be clearly marked\nin the text as a conflict with the Standard."
}