{
  "key": "ms-entity-framework-5",
  "short_name": "MS Entity Framework 5 License",
  "name": "MS Entity Framework 5 License",
  "category": "Proprietary Free",
  "owner": "Microsoft",
  "homepage_url": "http://msdn.microsoft.com/en-US/data/jj250905",
  "spdx_license_key": "LicenseRef-scancode-ms-entity-framework-5",
  "text_urls": [
    "http://msdn.microsoft.com/en-US/data/jj250905"
  ],
  "ignorable_urls": [
    "http://www.support.microsoft.com/common/international.aspx"
  ],
  "text": "Entity Framework 5 License\nMICROSOFT SOFTWARE SUPPLEMENTAL LICENSE TERMS\n\nENTITY FRAMEWORK 5.0 FOR MICROSOFT WINDOWS OPERATING SYSTEM\n\nMicrosoft Corporation (or based on where you live, one of its affiliates) licenses this supplement to you. If you are licensed to use Microsoft Windows Operating System software (the \"software\"), you may use this supplement. You may not use it if you do not have a license for the software. You may use this supplement with each validly licensed copy of the software.\n\nThe following license terms describe additional use terms for this supplement. These terms and the license terms for the software apply to your use of the supplement. If there is a conflict, these supplemental license terms apply.\n\nBy using this supplement, you accept these terms. If you do not accept them, do not use this supplement.\n\nIf you comply with these license terms, you have the rights below.\n\n1. DISTRIBUTABLE CODE. The supplement is comprised of Distributable Code. \"Distributable Code\" is code that you are permitted to distribute in programs you develop if you comply with the terms below.\n\na. Right to Use and Distribute.\nYou may copy and distribute the object code form of the supplement.\nThird Party Distribution. You may permit distributors of your programs to copy and distribute the Distributable Code as part of those programs.\n\nb. Distribution Requirements. For any Distributable Code you distribute, you must\nadd significant primary functionality to it in your programs;\nfor any Distributable Code having a filename extension of .lib, distribute only the results of running such Distributable Code through a linker with your program;\ndistribute Distributable Code included in a setup program only as part of that setup program without modification;\nrequire distributors and external end users to agree to terms that protect it at least as much as this agreement;\ndisplay your valid copyright notice on your programs; and\nindemnify, defend, and hold harmless Microsoft from any claims, including attorneys' fees, related to the distribution or use of your programs.\n\nc. Distribution Restrictions. You may not\nalter any copyright, trademark or patent notice in the Distributable Code;\nuse Microsoft's trademarks in your programs' names or in a way that suggests your programs come from or are endorsed by Microsoft;\ndistribute Distributable Code to run on a platform other than the Windows platform;\ninclude Distributable Code in malicious, deceptive or unlawful programs; or\nmodify or distribute the source code of any Distributable Code so that any part of it becomes subject to an Excluded License. An Excluded License is one that requires, as a condition of use, modification or distribution, that\nthe code be disclosed or distributed in source code form; or\nothers have the right to modify it.\n\n2. SUPPORT SERVICES FOR SUPPLEMENT. Microsoft provides support services for this software as described at www.support.microsoft.com/common/international.aspx."
}