{
  "key": "ms-lpl",
  "short_name": "MS-LPL",
  "name": "Microsoft Limited Permissive License (MS-LPL)",
  "category": "Permissive",
  "owner": "Microsoft",
  "homepage_url": "http://web.archive.org/web/20061122070300/http://www.microsoft.com/resources/sharedsource/licensingbasics/limitedpermissivelicense.mspx",
  "notes": "it was name \"Microsoft Limited Permissive License\" and later renamed by Microsoft",
  "spdx_license_key": "MS-LPL",
  "other_spdx_license_keys": [
    "LicenseRef-scancode-ms-lpl"
  ],
  "text_urls": [
    "http://web.archive.org/web/20061122070300/http://www.microsoft.com/resources/sharedsource/licensingbasics/limitedpermissivelicense.mspx"
  ],
  "other_urls": [
    "https://web.archive.org/web/20091211214028/http://msdn.microsoft.com/en-us/cc300389.aspx#MLPL",
    "https://www.openhub.net/licenses/mslpl",
    "https://github.com/gabegundy/atlserver/blob/master/License.txt",
    "https://en.wikipedia.org/wiki/Shared_Source_Initiative#Microsoft_Limited_Public_License_(Ms-LPL)"
  ],
  "text": "Microsoft Limited Permissive License (MS-LPL)\nPublished: October 12, 2006\n\n\nThis license governs use of the accompanying software. If you use the software, you accept this license. If you do not accept the license, do not use the software.\n\n1. Definitions\n\nThe terms \"reproduce,\" \"reproduction,\" \"derivative works,\" and \"distribution\"\nhave the same meaning here as under U.S. copyright law.\n\nA \"contribution\" is the original software, or any additions or changes to the\nsoftware.\n\nA \"contributor\" is any person that distributes its contribution under this\nlicense.\n\n\"Licensed patents\" are a contributor’s patent claims that read directly on its contribution.\n\n2. Grant of Rights\n\n(A) Copyright Grant- Subject to the terms of this license, including the license\nconditions and limitations in section 3, each contributor grants you a non-\nexclusive, worldwide, royalty-free copyright license to reproduce its\ncontribution, prepare derivative works of its contribution, and distribute its\ncontribution or any derivative works that you create.\n\n(B) Patent Grant- Subject to the terms of this license, including the license\nconditions and limitations in section 3, each contributor grants you a non-\nexclusive, worldwide, royalty-free license under its licensed patents to make,\nhave made, use, sell, offer for sale, import, and/or otherwise dispose of its\ncontribution in the software or derivative works of the contribution in the\nsoftware.\n\n3. Conditions and Limitations\n\n(A) No Trademark License- This license does not grant you rights to use any\ncontributors’ name, logo, or trademarks.\n\n(B) If you bring a patent claim against any contributor over patents that you\nclaim are infringed by the software, your patent license from such contributor\nto the software ends automatically.\n\n(C) If you distribute any portion of the software, you must retain all\ncopyright, patent, trademark, and attribution notices that are present in the\nsoftware.\n\n(D) If you distribute any portion of the software in source code form, you may\ndo so only under this license by including a complete copy of this license with\nyour distribution. If you distribute any portion of the software in compiled or\nobject code form, you may only do so under a license that complies with this\nlicense.\n\n(E) The software is licensed \"as-is.\" You bear the risk of using it. The\ncontributors give no express warranties, guarantees or conditions. You may have\nadditional consumer rights under your local laws which this license cannot\nchange. To the extent permitted under your local laws, the contributors exclude\nthe implied warranties of merchantability, fitness for a particular purpose and\nnon-infringement.\n\n(F) Platform Limitation- The licenses granted in sections 2(A) & 2(B) extend\nonly to the software or derivative works that you create that run on a Microsoft\nWindows operating system product."
}