{
  "key": "ms-msn-webgrease",
  "short_name": "MS MSN WebGrease License",
  "name": "Microsoft MSN WebGrease License",
  "category": "Proprietary Free",
  "owner": "Microsoft",
  "homepage_url": "http://www.microsoft.com/web/webpi/eula/msn_webgrease_eula.htm",
  "notes": "also contains some French language terms",
  "spdx_license_key": "LicenseRef-scancode-ms-msn-webgrease",
  "minimum_coverage": 90,
  "ignorable_urls": [
    "http://www.microsoft.com/exporting"
  ],
  "text": "MICROSOFT SOFTWARE LICENSE TERMS\nMICROSOFT MSN WEBGREASE\n\nThese license terms are an agreement between Microsoft Corporation (or based on where you live, one of its affiliates) and you. Please read them. They apply to the software named above, which includes the media on which you received it, if any. The terms also apply to any Microsoft\n\n·         updates,\n\n·         supplements,\n\n·         Internet-based services, and\n\n·         support services\n\nfor this software, unless other terms accompany those items. If so, those terms apply.\n\nBy using the software, you accept these terms. If you do not accept them, do not use the software.\n\nIf you comply with these license terms, you have the perpetual rights below.\n\n1.    INSTALLATION AND USE RIGHTS.\n\na.    Installation and Use. One user may install and use any number of copies of the software on your devices.\n\nb.    Third Party Notices. The software may include third party code.  Microsoft, not the third party, licenses to you under the terms set forth in this agreement.  Notices, if any, for any third party code are included for your information only.\n\n2.    ADDITIONAL LICENSING REQUIREMENTS AND/OR USE RIGHTS.\n\na.    Distributable Code. The software contains code that you are permitted to distribute in programs you develop if you comply with the terms below.\n\ni.      Right to Use and Distribute. The code and text files listed below are \"Distributable Code.\"\n\n·         Redistributable Files.  You may copy and distribute the object code form of the following files.\n\n§  WebGrease.dll\n\n§  WG.exe\n\n·         Third Party Distribution. You may permit distributors of your programs to copy and distribute the Distributable Code as part of those programs.\n\nii.     Distribution Requirements. For any Distributable Code you distribute, you must\n\n·         add primary functionality to it in your programs;\n\n·         for any Distributable Code having a filename extension of .lib, distribute only the results of running such Distributable Code through a linker with your program;\n\n·         distribute Distributable Code included in a setup program only as part of that setup program without modification;\n\n·         require distributors and external end users to agree to terms that protect it at least as much as this agreement;\n\n·         display your valid copyright notice on your programs; and\n\n·         indemnify, defend, and hold harmless Microsoft from any claims, including attorneys’ fees, related to the distribution or use of your programs.\n\niii.    Distribution Restrictions. You may not\n\n·         alter any copyright, trademark or patent notice in the Distributable Code;\n\n·         use Microsoft’s trademarks in your programs’ names or in a way that suggests your programs come from or are endorsed by Microsoft;\n\n·         distribute Distributable Code to run on a platform other than the Windows platform;\n\n·         include Distributable Code in malicious, deceptive or unlawful programs; or\n\n·         modify or distribute the source code of any Distributable Code so that any part of it becomes subject to an Excluded License. An Excluded License is one that requires, as a condition of use, modification or distribution, that\n\n·         the code be disclosed or distributed in source code form; or\n\n·         others have the right to modify it.\n\n3.    INTERNET-BASED SERVICES. Microsoft provides Internet-based services with the software. It may change or cancel them at any time.  You may not use these services in any way that could harm them or impair anyone else’s use of them.  You may not use the services to try to gain unauthorized access to any service, data, account or network by any means.\n\n4.    SCOPE OF LICENSE. The software is licensed, not sold. This agreement only gives you some rights to use the software. Microsoft reserves all other rights. Unless applicable law gives you more rights despite this limitation, you may use the software only as expressly permitted in this agreement. In doing so, you must comply with any technical limitations in the software that only allow you to use it in certain ways. You may not\n\n·         work around any technical limitations in the software;\n\n·         reverse engineer, decompile or disassemble the software, except and only to the extent that applicable law expressly permits, despite this limitation;\n\n·         make more copies of the software than specified in this agreement or allowed by applicable law, despite this limitation;\n\n·         publish the software for others to copy;\n\n·         rent, lease or lend the software; or\n\n·         transfer the software or this agreement to any third party.\n\n5.    BACKUP COPY. You may make one backup copy of the software. You may use it only to reinstall the software.\n\n6.    DOCUMENTATION. Any person that has valid access to your computer or internal network may copy and use the documentation for your internal, reference purposes.\n\n7.    EXPORT RESTRICTIONS. The software is subject to United States export laws and regulations. You must comply with all domestic and international export laws and regulations that apply to the software. These laws include restrictions on destinations, end users and end use. For additional information, see www.microsoft.com/exporting.\n\n8.    SUPPORT SERVICES. Because this software is \"as is,\" we may not provide support services for it.\n\n9.    ENTIRE AGREEMENT. This agreement, and the terms for supplements, updates, Internet-based services and support services that you use, are the entire agreement for the software and support services.\n\n10.  APPLICABLE LAW.\n\na.    United States. If you acquired the software in the United States, Washington state law governs the interpretation of this agreement and applies to claims for breach of it, regardless of conflict of laws principles. The laws of the state where you live govern all other claims, including claims under state consumer protection laws, unfair competition laws, and in tort.\n\nb.    Outside the United States. If you acquired the software in any other country, the laws of that country apply.\n\n11.  LEGAL EFFECT. This agreement describes certain legal rights. You may have other rights under the laws of your country. You may also have rights with respect to the party from whom you acquired the software. This agreement does not change your rights under the laws of your country if the laws of your country do not permit it to do so.\n\n12.  DISCLAIMER OF WARRANTY. The software is licensed \"as-is.\" You bear the risk of using it. Microsoft gives no express warranties, guarantees or conditions. You may have additional consumer rights or statutory guarantees under your local laws which this agreement cannot change. To the extent permitted under your local laws, Microsoft excludes the implied warranties of merchantability, fitness for a particular purpose and non-infringement.\n\nFOR AUSTRALIA – You have statutory guarantees under the Australian Consumer Law and nothing in these terms is intended to affect those rights.\n\n13.  LIMITATION ON AND EXCLUSION OF REMEDIES AND DAMAGES. You can recover from Microsoft and its suppliers only direct damages up to U.S. $5.00. You cannot recover any other damages, including consequential, lost profits, special, indirect or incidental damages.\n\nThis limitation applies to\n\n·         anything related to the software, services, content (including code) on third party Internet sites, or third party programs; and\n\n·         claims for breach of contract, breach of warranty, guarantee or condition, strict liability, negligence, or other tort to the extent permitted by applicable law.\n\nIt also applies even if Microsoft knew or should have known about the possibility of the damages. The above limitation or exclusion may not apply to you because your country may not allow the exclusion or limitation of incidental, consequential or other damages.\n\nPlease note: As this software is distributed in Quebec, Canada, these license terms are provided below in French.\nRemarque : Ce logiciel étant distribué au Québec, Canada, les termes de cette licence sont fournis ci-dessous en français.\n\nTERMES DU CONTRAT DE LICENCE D’UN LOGICIEL MICROSOFT\nMICROSOFT MSN WEBGREASE\nLes présents termes ont valeur de contrat entre Microsoft Corporation (ou en fonction du lieu où vous vivez, l’un de ses affiliés) et vous. Lisez-les attentivement. Ils portent sur le logiciel nommé ci-dessus, y compris le support sur lequel vous l’avez reçu le cas échéant. Ce contrat porte également sur les produits Microsoft suivants :\n\n·         les mises à jour,\n\n·         les suppléments,\n\n·         les services Internet et\n\n·         les services d’assistance technique\n\nde ce logiciel à moins que d’autres termes n’accompagnent ces produits, auquel cas, ces derniers prévalent.\n\nEn utilisant le logiciel, vous acceptez ces termes. Si vous ne les acceptez pas, n’utilisez pas le logiciel.\n\nSi vous respectez les présentes conditions de licence, vous disposez des droits suivants pour la durée des droits de propriété intellectuelle.\n\n1.    INSTALLATION ET DROITS D’UTILISATION.\n\na.    Installation et utilisation. Un utilisateur peut installer et utiliser un nombre quelconque de copies du logiciel sur vos dispositifs.\n\nb.    Logiciels tiers. Le logiciel contient des programmes tiers. Les termes qui accompagnent ces programmes s'appliquent, sauf mention contraire dans lesdits termes.\n\n2.    SERVICES INTERNET. Microsoft fournit des services Internet avec le logiciel. Ils peuvent être modifiés ou interrompus à tout moment.\n\n3.    PORTEE DE LA LICENCE. Le logiciel est concédé sous licence, pas vendu. Ce contrat vous octroie uniquement certains droits d’utilisation du logiciel. Microsoft se réserve tous les autres droits. À moins que la loi en vigueur vous confère davantage de droits nonobstant cette limitation, vous pouvez utiliser le logiciel uniquement tel qu’explicitement autorisé dans le présent accord. À cette fin, vous devez respecter les restrictions techniques du logiciel qui autorisent uniquement son utilisation de certaines façons. Vous n’êtes pas autorisé à :\n\n·         contourner les limitations techniques du logiciel ;\n\n·         reconstituer la logique du logiciel, le décompiler ou le désassembler, sauf dans la mesure où ces opérations seraient expressément autorisées par la réglementation applicable nonobstant la présente limitation ;\n\n·         faire plus de copies du logiciel que spécifié dans ce contrat ou par la réglementation applicable, nonobstant la présente limitation ;\n\n·         publier le logiciel pour que d’autres le copient ;\n\n·         louer ou prêter le logiciel ; ou\n\n·         transférer le logiciel ou le présent contrat à un tiers.\n\n4.    COPIE DE SAUVEGARDE. Vous êtes autorisé à effectuer une copie de sauvegarde du logiciel. Vous ne pouvez l’utiliser que dans le but de réinstaller le logiciel.\n\n5.    DOCUMENTATION. Tout utilisateur disposant d’un accès valide à votre ordinateur ou à votre réseau interne peut copier et utiliser la documentation à des fins de référence interne.\n\n6.    RESTRICTIONS À L’EXPORTATION. Le logiciel est soumis à la réglementation américaine relative à l’exportation. Vous devez vous conformer à toutes les réglementations nationales et internationales relatives aux exportations concernant le logiciel. Ces réglementations comprennent les restrictions sur les destinations, les utilisateurs finaux et l’utilisation finale. Pour plus d’informations, consultez le site www.microsoft.com/exporting.\n\n7.    SERVICES D’ASSISTANCE TECHNIQUE. Comme ce logiciel est fourni « en l'état », nous ne fourniront aucun service d’assistance.\n\n8.    INTÉGRALITÉ DES ACCORDS. Le présent contrat ainsi que les termes concernant les suppléments, les mises à jour, les services Internet et d’assistance technique constituent l’intégralité des accords en ce qui concerne le logiciel et les services d’assistance technique.\n\n9.    DROIT APPLICABLE.\n\na.    États-Unis. Si vous avez acquis le logiciel aux États-Unis, les lois de l’État de Washington, États-Unis d’Amérique, régissent l’interprétation de ce contrat et s’appliquent en cas de réclamation pour violation dudit contrat, nonobstant les conflits de principes juridiques. La réglementation du pays dans lequel vous vivez régit toutes les autres réclamations, notamment, et sans limitation, les réclamations dans le cadre des lois en faveur de la protection des consommateurs, relatives à la concurrence et aux délits.\n\nb.    En dehors des États-Unis. Si vous avez acquis le logiciel dans un autre pays, les lois de ce pays s’appliquent.\n\n10.  EFFET JURIDIQUE. Le présent contrat décrit certains droits juridiques. Vous pourriez avoir d’autres droits prévus par les lois de votre pays. Vous pourriez également avoir des droits à l’égard de la partie de qui vous avez acquis le logiciel. Le présent contrat ne modifie pas les droits que vous confèrent les lois de votre ou pays si celles-ci ne le permettent pas.\n\n11.  EXCLUSIONS DE GARANTIE. Le logiciel est concédé sous licence « en l’état ». Vous assumez tous les risques liés à son utilisation. Microsoft n’accorde aucune garantie ou condition expresse. Vous pouvez bénéficier de droits des consommateurs supplémentaires dans le cadre du droit local, que ce contrat ne peut modifier. Lorsque cela est autorisé par le droit local, Microsoft exclut les garanties implicites de qualité, d’adéquation à un usage particulier et d’absence de contrefaçon.\n\n12.  LIMITATION ET EXCLUSION DE RECOURS ET DE DOMMAGES. Vous pouvez obtenir de Microsoft et de ses fournisseurs une indemnisation en cas de dommages directs limitée uniquement à hauteur de 5,00 $ US. Vous ne pouvez prétendre à aucune indemnisation pour les autres dommages, y compris les dommages spéciaux, indirects ou accessoires et pertes de bénéfices.\n\nCette limitation concerne :\n\n·         toute affaire liée au logiciel, aux services ou au contenu (y compris le code) figurant sur des sites Internet tiers ou dans des programmes tiers et\n\n·         les réclamations au titre de violation de contrat ou de garantie, ou au titre de responsabilité stricte, de négligence ou d’une autre faute dans la limite autorisée par la loi en vigueur.\n\nElle s’applique également même si Microsoft connaissait l'éventualité d'un tel dommage. La limitation ou exclusion ci-dessus peut également ne pas vous être applicable, car votre pays n’autorise pas l’exclusion ou la limitation de responsabilité pour les dommages indirects, accessoires ou de quelque nature que ce soit."
}