{
  "key": "ms-net-library-2018-11",
  "short_name": "MS .NET Library License 2018-11",
  "name": "Microsoft .NET Library License 2018-11",
  "category": "Proprietary Free",
  "owner": "Microsoft",
  "homepage_url": "https://www.microsoft.com/web/webpi/eula/net_library_eula_enu.htm",
  "notes": "this is the version that existed at http://www.microsoft.com/net/dotnet_library_license.htm from November 2018 and then at https://dotnet.microsoft.com/dotnet_library_license.htm It also existed as this URL in NuGet http://go.microsoft.com/fwlink/?LinkId=329770",
  "spdx_license_key": "LicenseRef-scancode-ms-net-library-2018-11",
  "ignorable_urls": [
    "http://go.microsoft.com/?linkid=9840733",
    "http://www.microsoft.com/exporting",
    "https://go.microsoft.com/fwlink/?LinkID=824704"
  ],
  "text": "MICROSOFT SOFTWARE LICENSE TERMS\n\nMICROSOFT .NET LIBRARY\n\nThese license terms are an agreement between Microsoft Corporation\n(or based on where you live, one of its affiliates) and you.\nThey apply to the software named above.\nThe terms also apply to any Microsoft services or updates for the\nsoftware, except to the extent those have different terms.\n\nIf you comply with these license terms, you have the rights below.\n\n1. INSTALLATION AND USE RIGHTS.\n\nYou may install and use any number of copies of the software to design, develop\nand test you're applications. You may modify, copy, distribute or deploy any .js\nfiles contained in the software as part of your applications.\n\n2. THIRD PARTY COMPONENTS. The software may include third party components with\nseparate legal notices or governed by other agreements, as may be described in\nthe ThirdPartyNotices file(s) accompanying the software.\n\n3. ADDITIONAL LICENSING REQUIREMENTS AND/OR USE RIGHTS.\n\na. DISTRIBUTABLE CODE. In addition to the .js files described above, the\nsoftware is comprised of Distributable Code. “Distributable Code” is code that\nyou are permitted to distribute in programs you develop if you comply with the\nterms below.\n\ni. Right to Use and Distribute.\n\n. You may copy and distribute the object code form of the software.\n\n. Third Party Distribution. You may permit distributors of your programs to copy\nand distribute the Distributable Code as part of those programs.\n\nii. Distribution Requirements. For any Distributable Code you distribute, you\nmust\n\n. use the Distributable Code in your programs and not as a standalone\ndistribution;\n\n. require distributors and external end users to agree to terms that protect it\nat least as much as this agreement;\n\n. display your valid copyright notice on your programs; and\n\n. indemnify, defend, and hold harmless Microsoft from any claims, including\nattorneys' fees, related to the distribution or use of your applications, except\nto the extent that any claim is based solely on the Distributable Code.\n\niii. Distribution Restrictions. You may not\n\n. alter any copyright, trademark or patent notice in the Distributable Code;\n\n. use Microsoft's trademarks in your programs' names or in a way that suggests\nyour programs come from or are endorsed by Microsoft;\n\n. include Distributable Code in malicious, deceptive or unlawful programs; or\n\n. modify or distribute the source code of any Distributable Code so that any\npart of it becomes subject to an Excluded License. An Excluded License is one\nthat requires, as a condition of use, modification or distribution, that\n\n. the code be disclosed or distributed in source code form; or\n\n. others have the right to modify it.\n\n4. DATA.\n\na. Data Collection. The software may collect information about you and your use\nof the software, and send that to Microsoft. Microsoft may use this information\nto provide services and improve our products and services. You may opt-out of\nmany of these scenarios, but not all, as described in the product documentation.\nThere are also some features in the software that may enable you and Microsoft\nto collect data from users of your applications. If you use these features, you\nmust comply with applicable law, including providing appropriate notices to\nusers of your applications together with a copy of Microsoft's privacy\nstatement. Our privacy statement is located at\nhttps://go.microsoft.com/fwlink/?LinkID=824704. You can learn more about data\ncollection and use in the help documentation and our privacy statement. Your use\nof the software operates as your consent to these practices.\n\nb. Processing of Personal Data. To the extent Microsoft is a processor or\nsubprocessor of personal data in connection with the software, Microsoft makes\nthe commitments in the European Union General Data Protection Regulation Terms\nof the Online Services Terms to all customers effective May 25, 2018, at\nhttp://go.microsoft.com/?linkid=9840733.\n\n5. Scope of License. The software is licensed, not sold. This agreement only\ngives you some rights to use the software. Microsoft reserves all other rights.\nUnless applicable law gives you more rights despite this limitation, you may use\nthe software only as expressly permitted in this agreement. In doing so, you\nmust comply with any technical limitations in the software that only allow you\nto use it in certain ways. You may not\n\n. work around any technical limitations in the software;\n\n. reverse engineer, decompile or disassemble the software, or otherwise attempt\nto derive the source code for the software, except and to the extent required by\nthird party licensing terms governing use of certain open source components that\nmay be included in the software;\n\n. remove, minimize, block or modify any notices of Microsoft or its suppliers in\nthe software;\n\n. use the software in any way that is against the law; or\n\n. share, publish, rent or lease the software, provide the software as a stand-\nalone offering for others to use, or transfer the software or this agreement to\nany third party.\n\n6. Export Restrictions. You must comply with all domestic and international\nexport laws and regulations that apply to the software, which include\nrestrictions on destinations, end users, and end use. For further information on\nexport restrictions, visit www.microsoft.com/exporting.\n\n7. SUPPORT SERVICES. Because this software is “as is,” we may not provide\nsupport services for it.\n\n8. Entire Agreement. This agreement, and the terms for supplements, updates,\nInternet-based services and support services that you use, are the entire\nagreement for the software and support services.\n\n9. Applicable Law. If you acquired the software in the United States, Washington\nlaw applies to interpretation of and claims for breach of this agreement, and\nthe laws of the state where you live apply to all other claims. If you acquired\nthe software in any other country, its laws apply.\n\n10. CONSUMER RIGHTS; REGIONAL VARIATIONS. This agreement describes certain legal\nrights. You may have other rights, including consumer rights, under the laws of\nyour state or country. Separate and apart from your relationship with Microsoft,\nyou may also have rights with respect to the party from which you acquired the\nsoftware. This agreement does not change those other rights if the laws of your\nstate or country do not permit it to do so. For example, if you acquired the\nsoftware in one of the below regions, or mandatory country law applies, then the\nfollowing provisions apply to you:\n\na) Australia. You have statutory guarantees under the Australian Consumer Law\nand nothing in this agreement is intended to affect those rights.\n\nb) Canada. If you acquired this software in Canada, you may stop receiving\nupdates by turning off the automatic update feature, disconnecting your device\nfrom the Internet (if and when you re-connect to the Internet, however, the\nsoftware will resume checking for and installing updates), or uninstalling the\nsoftware. The product documentation, if any, may also specify how to turn off\nupdates for your specific device or software.\n\nc) Germany and Austria.\n\n(i) Warranty. The software will perform substantially as described in any\nMicrosoft materials that accompany it. However, Microsoft gives no contractual\nguarantee in relation to the software.\n\n(ii) Limitation of Liability. In case of intentional conduct, gross negligence,\nclaims based on the Product Liability Act, as well as in case of death or\npersonal or physical injury, Microsoft is liable according to the statutory law.\n\nSubject to the foregoing clause (ii), Microsoft will only be liable for slight\nnegligence if Microsoft is in breach of such material contractual obligations,\nthe fulfillment of which facilitate the due performance of this agreement, the\nbreach of which would endanger the purpose of this agreement and the compliance\nwith which a party may constantly trust in (so-called \"cardinal obligations\").\nIn other cases of slight negligence, Microsoft will not be liable for slight\nnegligence\n\n11. Disclaimer of Warranty. THE SOFTWARE IS LICENSED “AS-IS.” YOU BEAR THE RISK\nOF USING IT. MICROSOFT GIVES NO EXPRESS WARRANTIES, GUARANTEES OR CONDITIONS. TO\nTHE EXTENT PERMITTED UNDER YOUR LOCAL LAWS, MICROSOFT EXCLUDES THE IMPLIED\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-\nINFRINGEMENT.\n\n12. Limitation on and Exclusion of Remedies and Damages. YOU CAN RECOVER FROM\nMICROSOFT AND ITS SUPPLIERS ONLY DIRECT DAMAGES UP TO U.S. $5.00. YOU CANNOT\nRECOVER ANY OTHER DAMAGES, INCLUDING CONSEQUENTIAL, LOST PROFITS, SPECIAL,\nINDIRECT OR INCIDENTAL DAMAGES.\n\nThis limitation applies to (a) anything related to the software, services,\ncontent (including code) on third party Internet sites, or third party\napplications; and (b) claims for breach of contract, breach of warranty,\nguarantee or condition, strict liability, negligence, or other tort to the\nextent permitted by applicable law.\n\nIt also applies even if Microsoft knew or should have known about the\npossibility of the damages. The above limitation or exclusion may not apply to\nyou because your state or country may not allow the exclusion or limitation of\nincidental, consequential or other damages.\n\nPlease note: As this software is distributed in Quebec, Canada, some of the\nclauses in this agreement are provided below in French.\n\nRemarque : Ce logiciel étant distribué au Québec, Canada, certaines des clauses\ndans ce contrat sont fournies ci-dessous en français.\n\nEXONÉRATION DE GARANTIE. Le logiciel visé par une licence est offert « tel quel\n». Toute utilisation de ce logiciel est à votre seule risque et péril. Microsoft\nn'accorde aucune autre garantie expresse. Vous pouvez bénéficier de droits\nadditionnels en vertu du droit local sur la protection des consommateurs, que ce\ncontrat ne peut modifier. La ou elles sont permises par le droit locale, les\ngaranties implicites de qualité marchande, d'adéquation à un usage particulier\net d'absence de contrefaçon sont exclues.\n\n\nLIMITATION DES DOMMAGES-INTÉRÊTS ET EXCLUSION DE RESPONSABILITÉ POUR LES\nDOMMAGES. Vous pouvez obtenir de Microsoft et de ses fournisseurs une\nindemnisation en cas de dommages directs uniquement à hauteur de 5,00 $ US. Vous\nne pouvez prétendre à aucune indemnisation pour les autres dommages, y compris\nles dommages spéciaux, indirects ou accessoires et pertes de bénéfices.\n\nCette limitation concerne:\n\n. tout ce qui est relié au logiciel, aux services ou au contenu (y compris le\ncode) figurant sur des sites Internet tiers ou dans des programmes tiers ; et\n\n. les réclamations au titre de violation de contrat ou de garantie, ou au titre\nde responsabilité stricte, de négligence ou d'une autre faute dans la limite\nautorisée par la loi en vigueur.\n\nElle s'applique également, même si Microsoft connaissait ou devrait connaître\nl'éventualité d'un tel dommage. Si votre pays n'autorise pas l'exclusion ou la\nlimitation de responsabilité pour les dommages indirects, accessoires ou de\nquelque nature que ce soit, il se peut que la limitation ou l'exclusion ci-\ndessus ne s'appliquera pas à votre égard.\n\nEFFET JURIDIQUE. Le présent contrat décrit certains droits juridiques. Vous\npourriez avoir d'autres droits prévus par les lois de votre pays. Le présent\ncontrat ne modifie pas les droits que vous confèrent les lois de votre pays si\ncelles-ci ne le permettent pas."
}