{
  "key": "ms-patent-promise-mono",
  "short_name": "Microsoft Patent Promise for Mono",
  "name": "Microsoft Patent Promise for Mono",
  "category": "Patent License",
  "owner": "Microsoft",
  "homepage_url": "https://www.mono-project.com/docs/faq/licensing/",
  "spdx_license_key": "LicenseRef-scancode-ms-patent-promise-mono",
  "text_urls": [
    "https://github.com/mono/mono/blob/main/PATENTS.TXT"
  ],
  "text": "Microsoft Patent Promise for Mono\n\nMicrosoft Corporation and its affiliates (“Microsoft”) promise not to\nassert any Applicable Patents against you for making, using, selling,\noffering for sale, importing, or distributing Mono.\n\nIf you file, maintain, or voluntarily participate in any claim in a\nlawsuit alleging direct or contributory patent infringement by Mono,\nor inducement of patent infringement by Mono, then your rights under\nthis promise will automatically terminate.\n\nThis promise is not an assurance that (i) any Applicable Patents are\nvalid or enforceable or (ii) Mono does not infringe patents or other\nintellectual property rights of any third party. No rights except\nthose expressly stated in this promise are granted, waived or received\nby Microsoft, whether by implication, exhaustion, estoppel or\notherwise. This is a personal promise directly from Microsoft to you,\nand you agree as a condition of benefitting from it that no Microsoft\nrights are received from suppliers, distributors, or otherwise in\nconnection with this promise.\n\nDefinitions:\n\n“Mono” means those portions of the software development technology, as\noriginally distributed by Xamarin, Inc. or the .NET Foundation under\nthe name “Mono,” that implement .NET Framework Functionality, provided\nthat such portions at a minimum implement all of the required parts of\nthe mandatory provisions of Standard ECMA-335 – Common Language\nInfrastructure (CLI).\n\n“.NET Framework Functionality” means any functionality in Microsoft’s\n.NET Framework as described in Microsoft’s API documentation on\nMicrosoft’s MSDN website, including the functionality in\nWindowsbase.dll, but excluding all other functionality in the Windows\nPresentation Foundation component of .NET Framework.\n\n“Applicable Patents” are those patent claims, currently owned by\nMicrosoft and acquired in the future, that are necessarily infringed\nby Mono. For clarity, Applicable Patents do not include any patent\nclaims that are infringed (x) by any underlying or enabling technology\nthat may be used, combined, or distributed in connection with Mono\n(such as hardware, operating systems, or applications that run on\nMono), (y) only as a consequence of modification of Mono, or (z) only\nby the combination of Mono with third party code."
}