{
  "key": "ms-visual-studio-code",
  "short_name": "MS Visual Studio Code License",
  "name": "Microsoft Visual Studio Code License",
  "category": "Proprietary Free",
  "owner": "Microsoft",
  "homepage_url": "https://code.visualstudio.com/License/",
  "spdx_license_key": "LicenseRef-scancode-ms-visual-studio-code",
  "faq_url": "https://code.visualstudio.com/",
  "ignorable_urls": [
    "http://go.microsoft.com/fwlink/?LinkID=528096&clcid=0x409",
    "http://go.microsoft.com/fwlink/?LinkID=616397",
    "http://thirdpartysource.microsoft.com/",
    "http://www.microsoft.com/exporting"
  ],
  "text": "MICROSOFT SOFTWARE LICENSE TERMS\nMICROSOFT VISUAL STUDIO CODE\n\nThese license terms are an agreement between Microsoft Corporation (or based on\nwhere you live, one of its affiliates) and you. They apply to the software named\nabove. The terms also apply to any Microsoft services or updates for the\nsoftware, except to the extent those have additional terms.\n\nIF YOU COMPLY WITH THESE LICENSE TERMS, YOU HAVE THE RIGHTS BELOW.\n\n1. INSTALLATION AND USE RIGHTS.\n\na. General. You may use any number of copies of the software to develop and test\nyour applications, including deployment within your internal corporate network.\n\nb. Demo use. The uses permitted above include use of the software in demonstrating\nyour applications.\n\nc. Backup copy. You may make one or more backup copies of the software, for\nreinstalling the software.\n\nd. Third Party Programs. The software may include third party components with\nseparate legal notices or governed by other agreements, as described in the\nThirdPartyNotices file accompanying the software. Even if such components are\ngoverned by other agreements, the disclaimers and the limitations on and\nexclusions of damages below also apply.\n\nThe software contains third party components licensed under open source licenses\nwith source code availability obligations. Copies of those licenses are included\nin the ThirdPartyNotices file or accompanying credits file. You may obtain the\ncomplete corresponding source code from us if and as required under the relevant\nopen source licenses by sending a money order or check for $5.00 to: Source Code\nCompliance Team, Microsoft Corporation, 1 Microsoft Way, Redmond, WA 98052 USA.\nPlease write \"third party source code for Visual Studio Code\" in the memo line\nof your payment. We may also make the source available at\nhttp://thirdpartysource.microsoft.com/.\n\ne. Extensions.The software gives you the option to download other Microsoft and\nthird party software packages from our extension marketplace or package\nmanagers. Those packages are under their own licenses, and not this agreement.\nMicrosoft does not distribute, license or provide any warranties for any of the\nthird party packages.\n\n2. DATA. The software may collect information about you and your use of the\nsoftware, and send that to Microsoft. Microsoft may use this information to\nprovide services and improve our products and services. There may also be some\nfeatures in the software that enable you to collect data from users of your\napplications. If you use these features to enable data collection in your\napplications, you must comply with applicable law, including providing\nappropriate notices to users of your applications.\n\nYou can learn more about data collection and use in the help documentation and\nthe privacy statement at\nhttp://go.microsoft.com/fwlink/?LinkID=528096&clcid=0x409. Your use of the\nsoftware operates as your consent to these practices.\n\n3. UPDATES. The software may install automatic updates. By using the software,\nyou agree to receive automatic updates without any additional notice, and permit\nMicrosoft to download and install them for you. If you do not want automatic\nupdates, you may turn them off by following the instructions in the\ndocumentation at http://go.microsoft.com/fwlink/?LinkID=616397.\n\n4. FEEDBACK. If you give feedback about the software to Microsoft, you give to\nMicrosoft, without charge, the right to use, share and commercialize your\nfeedback in any way and for any purpose. You will not give feedback that is\nsubject to a license that requires Microsoft to license its software or\ndocumentation to third parties because we include your feedback in them. These\nrights survive this agreement.\n\n5. SCOPE OF LICENSE. The software is licensed, not sold. This agreement only\ngives you some rights to use the software. Microsoft reserves all other rights.\nUnless applicable law gives you more rights despite this limitation, you may use\nthe software only as expressly permitted in this agreement. In doing so, you\nmust comply with any technical limitations in the software that only allow you\nto use it in certain ways. You may not\n\n* work around any technical limitations in the software;\n\n* reverse engineer, decompile or disassemble the software, or otherwise attempt\nto derive the source code for the software except, and solely to the extent: (i)\npermitted by applicable law, despite this limitation; or (ii) required to debug\nchanges to any libraries licensed under the GNU Lesser General Public License\nwhich are included with and linked to by the software;\n\n* remove, minimize, block or modify any notices of Microsoft or its suppliers in\nthe software;\n\n* use the software in any way that is against the law; or\n\n* share, publish, or lend the software, or provide it as a hosted solution for\nothers to use, or transfer the software or this agreement to any third party.\n\n6. SUPPORT SERVICES. Because this software is \"as is,\" we may not provide\nsupport services for it.\n\n7. ENTIRE AGREEMENT. This agreement, and the terms for supplements, updates,\nInternet-based services and support services that you use, are the entire\nagreement for the software and support services.\n\n8. EXPORT RESTRICTIONS. Microsoft software, online services, professional\nservices and related technology are subject to U.S. export jurisdiction. You\nmust comply with all applicable international and national laws including the\nU.S. Export Administration Regulations, the International Traffic in Arms\nRegulations, Office of Foreign Assets Control sanction programs, and end-user,\nend use and destination restrictions by the U.S. and other governments related\nto Microsoft products, services and technologies. For additional information,\nsee http://www.microsoft.com/exporting.\n\n9. APPLICABLE LAW. If you acquired the software in the United States, Washington\nlaw applies to interpretation of and claims for breach of this agreement, and\nthe laws of the state where you live apply to all other claims. If you acquired\nthe software in any other country, its laws apply.\n\n10. LEGAL EFFECT. This agreement describes certain legal rights. You may have\nother rights under the laws of your state or country. This agreement does not\nchange your rights under the laws of your state or country if the laws of your\nstate or country do not permit it to do so. Without limiting the foregoing, for\nAustralia, YOU HAVE STATUTORY GUARANTEES UNDER THE AUSTRALIAN CONSUMER LAW AND\nNOTHING IN THESE TERMS IS INTENDED TO AFFECT THOSE RIGHTS.\n\n11. DISCLAIMER OF WARRANTY. THE SOFTWARE IS LICENSED \"AS-IS.\"\" YOU BEAR THE RISK\nOF USING IT. MICROSOFT GIVES NO EXPRESS WARRANTIES, GUARANTEES OR CONDITIONS. TO\nTHE EXTENT PERMITTED UNDER YOUR LOCAL LAWS, MICROSOFT EXCLUDES THE IMPLIED\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-\nINFRINGEMENT.\n\n12. LIMITATION ON AND EXCLUSION OF DAMAGES. YOU CAN RECOVER FROM MICROSOFT AND\nITS SUPPLIERS ONLY DIRECT DAMAGES UP TO U.S. $5.00. YOU CANNOT RECOVER ANY OTHER\nDAMAGES, INCLUDING CONSEQUENTIAL, LOST PROFITS, SPECIAL, INDIRECT OR INCIDENTAL\nDAMAGES.\n\nThis limitation applies to (a) anything related to the software, services,\ncontent (including code) on third party Internet sites, or third party\napplications; and (b) claims for breach of contract, breach of warranty,\nguarantee or condition, strict liability, negligence, or other tort to the\nextent permitted by applicable law.\n\nIt also applies even if Microsoft knew or should have known about the\npossibility of the damages. The above limitation or exclusion may not apply to\nyou because your state or country may not allow the exclusion or limitation of\nincidental, consequential or other damages."
}