{
  "key": "ms-visual-studio-code-2018",
  "short_name": "MS Visual Studio Code License 2018",
  "name": "Microsoft Visual Studio Code License 2018",
  "category": "Proprietary Free",
  "owner": "Microsoft",
  "homepage_url": "https://code.visualstudio.com/license",
  "spdx_license_key": "LicenseRef-scancode-ms-visual-studio-code-2018",
  "ignorable_urls": [
    "http://go.microsoft.com/?linkid=9840733",
    "http://www.microsoft.com/exporting",
    "https://go.microsoft.com/fwlink/?LinkID=824704"
  ],
  "text": "MICROSOFT SOFTWARE LICENSE TERMS\nMICROSOFT VISUAL STUDIO CODE\n\nThese license terms are an agreement between you and Microsoft Corporation (or\nbased on where you live, one of its affiliates). They apply to the software\nnamed above. The terms also apply to any Microsoft services or updates for the\nsoftware, except to the extent those have different terms.\n\nIF YOU COMPLY WITH THESE LICENSE TERMS, YOU HAVE THE RIGHTS BELOW.\n\n1. INSTALLATION AND USE RIGHTS.\n\na. General. You may use any number of copies of the software to develop and test\nyour applications, including deployment within your internal corporate network.\n\nb. Demo use. The uses permitted above include use of the software in\ndemonstrating your applications.\n\nc. Backup copy. You may make one or more backup copies of the software, for\nreinstalling the software.\n\nd. Third Party Programs. The software may include third party components with\nseparate legal notices or governed by other agreements, as may be described in\nthe ThirdPartyNotices file accompanying the software.\n\ne. Extensions. The software gives you the option to download other Microsoft and\nthird party software packages from our extension marketplace or package\nmanagers. Those packages are under their own licenses, and not this agreement.\nMicrosoft does not distribute, license or provide any warranties for any of the\nthird party packages.\n\n2. DATA.\n\na. Data Collection. The software may collect information about you and your use\nof the software, and send that to Microsoft. Microsoft may use this information\nto provide services and improve our products and services. You may opt-out of\nmany of these scenarios, but not all, as described in the product documentation.\nThere may also be some features in the software that may enable you and\nMicrosoft to collect data from users of your applications. If you use these\nfeatures, you must comply with applicable law, including providing appropriate\nnotices to users of your applications together with Microsoft’s privacy\nstatement. Our privacy statement is located at\nhttps://go.microsoft.com/fwlink/?LinkID=824704 . You can learn more about data\ncollection and use in the help documentation and our privacy statement. Your use\nof the software operates as your consent to these practices.\n\nb. Processing of Personal Data. To the extent Microsoft is a processor or\nsubprocessor of personal data in connection with the software, Microsoft makes\nthe commitments in the European Union General Data Protection Regulation Terms\nof the Online Services Terms to all customers effective May 25, 2018, at\nhttp://go.microsoft.com/?linkid=9840733 .\n\n3. UPDATES. The software may periodically check for updates, and download and\ninstall them for you. You may obtain updates only from Microsoft or authorized\nsources. Microsoft may need to update your system to provide you with updates.\nYou agree to receive these automatic updates without any additional notice.\nUpdates may not include or support all existing software features, services, or\nperipheral devices.\n\n4. FEEDBACK. If you give feedback about the software to Microsoft, you give to\nMicrosoft, without charge, the right to use, share and commercialize your\nfeedback in any way and for any purpose. You will not give feedback that is\nsubject to a license that requires Microsoft to license its software or\ndocumentation to third parties because we include your feedback in them. These\nrights survive this agreement.\n\n5. SCOPE OF LICENSE. The software is licensed, not sold. This agreement only\ngives you some rights to use the software. Microsoft reserves all other rights.\nUnless applicable law gives you more rights despite this limitation, you may use\nthe software only as expressly permitted in this agreement. In doing so, you\nmust comply with any technical limitations in the software that only allow you\nto use it in certain ways. You may not\n\n* work around any technical limitations in the software;\n\n* reverse engineer, decompile or disassemble the software, or otherwise attempt\nto derive the source code for the software, except and to the extent required by\nthird party licensing terms governing use of certain open source components that\nmay be included in the software;\n\n*remove, minimize, block or modify any notices of Microsoft or its suppliers in\nthe software;\n\n* use the software in any way that is against the law;\n\n* share, publish, rent or lease the software, or provide the software as a\nstand-alone offering for others to use.\n\n6. SUPPORT SERVICES. Because this software is “as is,” we may not provide\nsupport services for it.\n\n7. ENTIRE AGREEMENT. This agreement, and the terms for supplements, updates,\nInternet-based services and support services that you use, are the entire\nagreement for the software and support services.\n\n8. EXPORT RESTRICTIONS. You must comply with all domestic and international\nexport laws and regulations that apply to the software, which include\nrestrictions on destinations, end-users, and end use. For further information on\nexport restrictions, see http://www.microsoft.com/exporting .\n\n9. APPLICABLE LAW. If you acquired the software in the United States, Washington\nlaw applies to interpretation of and claims for breach of this agreement, and\nthe laws of the state where you live apply to all other claims. If you acquired\nthe software in any other country, its laws apply.\n\n10. CONSUMER RIGHTS; REGIONAL VARIATIONS. This agreement describes certain legal\nrights. You may have other rights, including consumer rights, under the laws of\nyour state or country. Separate and apart from your relationship with Microsoft,\nyou may also have rights with respect to the party from which you acquired the\nsoftware. This agreement does not change those other rights if the laws of your\nstate or country do not permit it to do so. For example, if you acquired the\nsoftware in one of the below regions, or mandatory country law applies, then the\nfollowing provisions apply to you:\n\na. Australia. You have statutory guarantees under the Australian Consumer Law\nand nothing in this agreement is intended to affect those rights.\n\nb. Canada. If you acquired this software in Canada, you may stop receiving\nupdates by turning off the automatic update feature, disconnecting your device\nfrom the Internet (if and when you re-connect to the Internet, however, the\nsoftware will resume checking for and installing updates), or uninstalling the\nsoftware. The product documentation, if any, may also specify how to turn off\nupdates for your specific device or software.\n\nc. Germany and Austria.\n\n  i. Warranty. The properly licensed software will perform substantially as\n  described in any Microsoft materials that accompany the software. However,\n  Microsoft gives no contractual guarantee in relation to the licensed software.\n\n  ii. Limitation of Liability. In case of intentional conduct, gross negligence,\n  claims based on the Product Liability Act, as well as, in case of death or\n  personal or physical injury, Microsoft is liable according to the statutory\n  law.\n\nSubject to the foregoing clause (ii), Microsoft will only be liable for slight\nnegligence if Microsoft is in breach of such material contractual obligations,\nthe fulfillment of which facilitate the due performance of this agreement, the\nbreach of which would endanger the purpose of this agreement and the compliance\nwith which a party may constantly trust in (so-called \"cardinal obligations\").\nIn other cases of slight negligence, Microsoft will not be liable for slight\nnegligence.\n\n11. DISCLAIMER OF WARRANTY. The software is licensed “as-is.” You bear the risk\nof using it. Microsoft gives no express warranties, guarantees or conditions. To\nthe extent permitted under your local laws, Microsoft excludes the implied\nwarranties of merchantability, fitness for a particular purpose and non-\ninfringement.\n\n12. LIMITATION ON AND EXCLUSION OF DAMAGES. You can recover from Microsoft and\nits suppliers only direct damages up to U.S. $5.00. You cannot recover any other\ndamages, including consequential, lost profits, special, indirect or incidental\ndamages. This limitation applies to (a) anything related to the software,\nservices, content (including code) on third party Internet sites, or third party\napplications; and (b) claims for breach of contract, breach of warranty,\nguarantee or condition, strict liability, negligence, or other tort to the\nextent permitted by applicable law. It also applies even if Microsoft knew or\nshould have known about the possibility of the damages. The above limitation or\nexclusion may not apply to you because your state or country may not allow the\nexclusion or limitation of incidental, consequential or other damages."
}