{
  "key": "msntp",
  "short_name": "MSNTP License",
  "name": "MSNTP software license",
  "category": "Copyleft",
  "owner": "Fedora",
  "homepage_url": "http://fedoraproject.org/wiki/Licensing/MSNTP",
  "spdx_license_key": "LicenseRef-scancode-msntp",
  "text_urls": [
    "http://fedoraproject.org/wiki/Licensing/MSNTP"
  ],
  "ignorable_copyrights": [
    "(c) Copyright N.M. Maclaren",
    "(c) Copyright University of Cambridge",
    "(c) Copyright, N.M. Maclaren, 1996, 1997, 2000",
    "(c) Copyright, University of Cambridge, 1996, 1997, 2000"
  ],
  "ignorable_holders": [
    "N.M. Maclaren",
    "University of Cambridge"
  ],
  "ignorable_authors": [
    "N.M. Maclaren",
    "the University of Cambridge"
  ],
  "text": "General Public Licence for the software known as MSNTP\n------------------------------------------------------\n\n          (c) Copyright, N.M. Maclaren, 1996, 1997, 2000\n          (c) Copyright, University of Cambridge, 1996, 1997, 2000\n\nFree use of MSNTP in source and binary forms is permitted, provided that this\nentire licence is duplicated in all copies, and that any documentation,\nannouncements, and other materials related to use acknowledge that the software\nwas developed by N.M. Maclaren (hereafter refered to as the Author) at the\nUniversity of Cambridge.  Neither the name of the Author nor the University of\nCambridge may be used to endorse or promote products derived from this material\nwithout specific prior written permission.\n\nThe Author and the University of Cambridge retain the copyright and all other\nlegal rights to the software and make it available non-exclusively.  All users\nmust ensure that the software in all its derivations carries a copyright notice\nin the form:\n          (c) Copyright N.M. Maclaren,\n          (c) Copyright University of Cambridge.\n\n\n\n                           NO WARRANTY\n\nBecause the MSNTP software is licensed free of charge, the Author and the\nUniversity of Cambridge provide absolutely no warranty, either expressed or\nimplied, including, but not limited to, the implied warranties of\nmerchantability and fitness for a particular purpose.  The entire risk as to\nthe quality and performance of the MSNTP software is with you.  Should MSNTP\nprove defective, you assume the cost of all necessary servicing or repair.\n\nIn no event, unless required by law, will the Author or the University of\nCambridge, or any other party who may modify and redistribute this software as\npermitted in accordance with the provisions below, be liable for damages for\nany losses whatsoever, including but not limited to lost profits, lost monies,\nlost or corrupted data, or other special, incidental or consequential losses\nthat may arise out of the use or inability to use the MSNTP software.\n\n                         COPYING POLICY\n\nPermission is hereby granted for copying and distribution of copies of the\nMSNTP source and binary files, and of any part thereof, subject to the\nfollowing licence conditions:\n\n1. You may distribute MSNTP or components of MSNTP, with or without additions\ndeveloped by you or by others.  No charge, other than an \"at-cost\" distribution\nfee, may be charged for copies, derivations, or distributions of this material\nwithout the express written consent of the copyright holders.\n\n2. You may also distribute MSNTP along with any other product for sale,\nprovided that the cost of the bundled package is the same regardless of whether\nMSNTP is included or not, and provided that those interested only in MSNTP must\nbe notified that it is a product freely available from the University of\nCambridge.\n\n3. If you distribute MSNTP software or parts of MSNTP, with or without\nadditions developed by you or others, then you must either make available the\nsource to all portions of the MSNTP system (exclusive of any additions made by\nyou or by others) upon request, or instead you may notify anyone requesting\nsource that it is freely available from the University of Cambridge.\n\n4. You may not omit any of the copyright notices on either the source files,\nthe executable files, or the documentation.\n\n5. You may not omit transmission of this License agreement with whatever\nportions of MSNTP that are distributed.\n\n6. Any users of this software must be notified that it is without warranty or\nguarantee of any nature, express or implied, nor is there any fitness for use\nrepresented.\n\nOctober 1996\nApril 1997\nOctober 2000"
}