{
  "key": "mstar-2012",
  "short_name": "MStar Proprietary License 2012",
  "name": "MStar Proprietary License 2012",
  "category": "Proprietary Free",
  "owner": "MStar Semiconductor",
  "homepage_url": "https://github.com/GracieZhou/test/blob/master/CODE/android/vendor/mstar/supernova/projects/msrv/system_database/inc/MSrv_System_Database.h",
  "spdx_license_key": "LicenseRef-scancode-mstar-2012",
  "text": "MStar Software\n\nAll software, firmware and related documentation herein (\"MStar Software\") are\nintellectual property of MStar Semiconductor, Inc. (\"MStar\") and protected by\nlaw, including, but not limited to, copyright law and international treaties.\nAny use, modification, reproduction, retransmission, or republication of all\nor part of MStar Software is expressly prohibited, unless prior written\npermission has been granted by MStar.\n\nBy accessing, browsing and/or using MStar Software, you acknowledge that you\nhave read, understood, and agree, to be bound by below terms (\"Terms\") and to\ncomply with all applicable laws and regulations:\n\n1. MStar shall retain any and all right, ownership and interest to MStar\n   Software and any modification/derivatives thereof.\n   No right, ownership, or interest to MStar Software and any\n   modification/derivatives thereof is transferred to you under Terms.\n\n2. You understand that MStar Software might include, incorporate or be\n   supplied together with third party`s software and the use of MStar\n   Software may require additional licenses from third parties.\n   Therefore, you hereby agree it is your sole responsibility to separately\n   obtain any and all third party right and license necessary for your use of\n   such third party`s software.\n\n3. MStar Software and any modification/derivatives thereof shall be deemed as\n   MStar`s confidential information and you agree to keep MStar`s\n   confidential information in strictest confidence and not disclose to any\n   third party.\n\n4. MStar Software is provided on an \"AS IS\" basis without warranties of any\n   kind. Any warranties are hereby expressly disclaimed by MStar, including\n   without limitation, any warranties of merchantability, non-infringement of\n   intellectual property rights, fitness for a particular purpose, error free\n   and in conformity with any international standard.  You agree to waive any\n   claim against MStar for any loss, damage, cost or expense that you may\n   incur related to your use of MStar Software.\n   In no event shall MStar be liable for any direct, indirect, incidental or\n   consequential damages, including without limitation, lost of profit or\n   revenues, lost or damage of data, and unauthorized system use.\n   You agree that this Section 4 shall still apply without being affected\n   even if MStar Software has been modified by MStar in accordance with your\n   request or instruction for your use, except otherwise agreed by both\n   parties in writing.\n\n5. If requested, MStar may from time to time provide technical supports or\n   services in relation with MStar Software to you for your use of\n   MStar Software in conjunction with your or your customer`s product\n   (\"Services\").\n   You understand and agree that, except otherwise agreed by both parties in\n   writing, Services are provided on an \"AS IS\" basis and the warranty\n   disclaimer set forth in Section 4 above shall apply.\n\n6. Nothing contained herein shall be construed as by implication, estoppels\n   or otherwise:\n   (a) conferring any license or right to use MStar name, trademark, service\n       mark, symbol or any other identification;\n   (b) obligating MStar or any of its affiliates to furnish any person,\n       including without limitation, you and your customers, any assistance\n       of any kind whatsoever, or any information; or\n   (c) conferring any license or right under any intellectual property right.\n\n7. These terms shall be governed by and construed in accordance with the laws\n   of Taiwan, R.O.C., excluding its conflict of law rules.\n   Any and all dispute arising out hereof or related hereto shall be finally\n   settled by arbitration referred to the Chinese Arbitration Association,\n   Taipei in accordance with the ROC Arbitration Law and the Arbitration\n   Rules of the Association by three (3) arbitrators appointed in accordance\n   with the said Rules.\n   The place of arbitration shall be in Taipei, Taiwan and the language shall\n   be English.\n   The arbitration award shall be final and binding to both parties."
}