{
  "key": "mysql-floss-exception-2.0",
  "short_name": "MySQL FLOSS exception to GPL 2.0",
  "name": "MySQL FLOSS exception to GPL 2.0",
  "category": "Copyleft Limited",
  "owner": "Oracle Corporation",
  "homepage_url": "https://mariadb.com/kb/en/mariadb/mariadb-license/#the-floss-exception",
  "is_exception": true,
  "spdx_license_key": "LicenseRef-scancode-mysql-floss-exception-2.0",
  "other_urls": [
    "http://www.gnu.org/licenses/gpl-2.0.txt"
  ],
  "ignorable_urls": [
    "http://www.gnu.org/philosophy/free-sw.html",
    "http://www.opensource.org/docs/definition.php"
  ],
  "text": "    MySQL FLOSS License Exception\n    The MySQL AB Exception for Free/Libre and Open Source Software-only\n    Applications Using MySQL Client Libraries (the \"FLOSS Exception\").\n    Version 0.6, 7 March 2007\n    Exception Intent\n    We want specified Free/Libre and Open Source Software (``FLOSS'')\n    applications to be able to use specified GPL-licensed MySQL client\n    libraries (the ``Program'') despite the fact that not all FLOSS licenses\n    are compatible with version 2 of the GNU General Public License (the\n    ``GPL'').\n    Legal Terms and Conditions\n    As a special exception to the terms and conditions of version 2.0 of the\n    GPL:\n    1. You are free to distribute a Derivative Work that is formed entirely\n    from the Program and one or more works (each, a \"FLOSS Work\") licensed\n    under one or more of the licenses listed below in section 1, as long as:\n    a. You obey the GPL in all respects for the Program and the Derivative\n    Work, except for identifiable sections of the Derivative Work which are not\n    derived from the Program, and which can reasonably be considered\n    independent and separate works in themselves,\n    b. all identifiable sections of the Derivative Work which are not derived\n    from the Program, and which can reasonably be considered independent and\n    separate works in themselves,\n    i. are distributed subject to one of the FLOSS licenses listed below, and\n    ii. the object code or executable form of those sections are accompanied by\n    the complete corresponding machine-readable source code for those sections\n    on the same medium and under the same FLOSS license as\n    the corresponding object code or executable forms of those sections, and\n    c. any works which are aggregated with the Program or with a Derivative\n    Work on a volume of a storage or distribution medium in accordance with the\n    GPL, can reasonably be considered independent and separate works in\n    themselves\n    which are not derivatives of either the Program, a Derivative Work or a\n    FLOSS Work.\n    If the above conditions are not met, then the Program may only be copied,\n    modified, distributed or used under the terms and conditions of the GPL or\n    another valid licensing option from MySQL AB.\n    2. FLOSS License List\n    License name Version(s)/Copyright Date\n    Academic Free License 2.0\n    Apache Software License 1.0/1.1/2.0\n    Apple Public Source License 2.0\n    Artistic license From Perl 5.8.0\n    BSD license \"July 22 1999\"\n    Common Development and Distribution License (CDDL) 1.0\n    Common Public License 1.0\n    Eclipse Public License 1.0\n    GNU Library or \"Lesser\" General Public License (LGPL) 2.0/2.1\n    Jabber Open Source License 1.0\n    MIT license (As listed in file MIT-License.txt) ---\n    Mozilla Public License (MPL) 1.0/1.1\n    Open Software License 2.0\n    OpenSSL license (with original SSLeay license) \"2003\" (\"1998\")\n    PHP License 3.0\n    Python license (CNRI Python License) ---\n    Python Software Foundation License 2.1.1\n    Sleepycat License \"1999\"\n    University of Illinois/NCSA Open Source License ---\n    W3C License \"2001\"\n    X11 License \"2001\"\n    Zlib/libpng License ---\n    Zope Public License 2.0\n    Due to the many variants of some of the above licenses, we require that any\n    version follow the 2003 version of the Free Software Foundation's Free\n    Software Definition (http://www.gnu.org/philosophy/free-sw.html) or version\n    1.9 of the Open Source Definition by the Open Source Initiative\n    http://www.opensource.org/docs/definition.php).\n    3. Definitions\n    a. Terms used, but not defined, herein shall have the meaning provided in\n    the GPL.\n    b. Derivative Work means a derivative work under copyright law.\n    4. Applicability: This FLOSS Exception applies to all Programs that contain\n    a notice placed by MySQL AB saying that the Program may be distributed\n    under the terms of this FLOSS Exception. If you create or distribute a work\n    which is a Derivative Work of both the Program and any other work licensed\n    under the GPL, then this FLOSS Exception is not available for that work;\n    thus, you must remove the FLOSS Exception notice from that work and comply\n    with the GPL in all respects, including by retaining all GPL notices. You\n    may choose to redistribute a copy of the Program exclusively under the\n    terms of the GPL by removing the FLOSS Exception notice from that copy of\n    the Program, provided that the copy has never been modified by you or any\n    third party.\n    Appendix A. Qualified Libraries and Packages\n    The following is a non-exhaustive list of libraries and packages which are\n    covered by the FLOSS License Exception. Please note that this appendix is\n    provided merely as an additional service to\n    specific FLOSS projects wishing to simplify licensing information for their\n    users. Compliance with one of the licenses noted under the \"FLOSS license\n    list\" section remains a prerequisite.\n    Package Name Qualifying License and Version\n    Apache Portable Runtime (APR) Apache Software License 2.0"
}