{
  "key": "netcdf",
  "short_name": "NetCDF License",
  "name": "NetCDF License",
  "category": "Permissive",
  "owner": "Unidata",
  "homepage_url": "http://www.unidata.ucar.edu/software/netcdf/copyright.html",
  "spdx_license_key": "NetCDF",
  "ignorable_authors": [
    "the Unidata Program at the University Corporation for Atmospheric Research"
  ],
  "text": "Portions of this software were developed by the Unidata Program at the\nUniversity Corporation for Atmospheric Research.\n\nAccess and use of this software shall impose the following obligations and\nunderstandings on the user. The user is granted the right, without any fee or\ncost, to use, copy, modify, alter, enhance and distribute this software, and any\nderivative works thereof, and its supporting documentation for any purpose\nwhatsoever, provided that this entire notice appears in all copies of the\nsoftware, derivative works and supporting documentation. Further, UCAR requests\nthat the user credit UCAR/Unidata in any publications that result from the use\nof this software or in any product that includes this software, although this is\nnot an obligation. The names UCAR and/or Unidata, however, may not be used in\nany advertising or publicity to endorse or promote any products or commercial\nentity unless specific written permission is obtained from UCAR/Unidata. The\nuser also understands that UCAR/Unidata is not obligated to provide the user\nwith any support, consulting, training or assistance of any kind with regard to\nthe use, operation and performance of this software nor to provide the user with\nany updates, revisions, new versions or \"bug fixes.\"\n\nTHIS SOFTWARE IS PROVIDED BY UCAR/UNIDATA \"AS IS\" AND ANY EXPRESS OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT\nSHALL UCAR/UNIDATA BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES\nOR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER\nIN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR\nIN CONNECTION WITH THE ACCESS, USE OR PERFORMANCE OF THIS SOFTWARE."
}