{
  "key": "netronome-firmware",
  "short_name": "Netronome Firmware License",
  "name": "Netronome Firmware License",
  "category": "Proprietary Free",
  "owner": "Netronome",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.Netronome",
  "spdx_license_key": "LicenseRef-scancode-netronome-firmware",
  "text": "Agilio(r) Firmware License Agreement (the \"AGREEMENT\")\n\nBY INSTALLING OR USING IN ANY MANNER THE SOFTWARE THAT ACCOMPANIES THIS\nAGREEMENT (THE \"SOFTWARE\") YOU (THE \"LICENSEE\") ACKNOWLEDGE TO BE BOUND\nBY ALL OF THE TERMS OF THIS AGREEMENT.\n\nLICENSE GRANT. Subject to the terms and conditions set forth herein,\nNetronome Systems, Inc. (\"NETRONOME\") hereby grants LICENSEE a non-\nexclusive license to use, reproduce and distribute the SOFTWARE\nexclusively in object form.\n\nRestrictions. LICENSEE agrees that, (a) unless explicitly provided by\nNETRONOME, the source code of the SOFTWARE is not being provided to\nLICENSEE and is confidential and proprietary to NETRONOME and that\nLICENSEE has no right to access or use such source code. Accordingly,\nLICENSEE agrees that it shall not cause or permit the disassembly,\ndecompilation or reverse engineering of the SOFTWARE or otherwise attempt\nto gain access to the source code for the SOFTWARE; and (b) LICENSEE\nagrees that it shall not subject the SOFTWARE in whole or in part, to the\nterms of any software license that requires, as a condition of use,\nmodification and/or distribution that the source code of the SOFTWARE, or\nthe SOFTWARE be i) disclosed or distributed in source code form; ii)\nlicensed for the purpose of making derivative works of the source code of\nthe SOFTWARE; or iii) redistribution of the source code of the SOFTWARE\nat no charge.\n\nDISCLAIMER OF ALL WARRANTIES. THE SOFTWARE IS PROVIDED \"AS IS\" AND WITH\nALL FAULTS AND NETRONOME AND ITS LICENSORS HEREBY DISCLAIM ALL EXPRESS OR\nIMPLIED WARRANTIES OF ANY KIND, INCLUDING, WITHOUT LIMITATION, ANY\nWARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR A\nPARTICULAR PURPOSE.\n\nLIMITATIONS OF LIABILITY. EXCEPT WHERE PROHIBITED BY LAW, IN NO EVENT\nSHALL NETRONOME OR ANY OTHER PARTY INVOLVED IN THE CREATION, PRODUCTION,\nOR DELIVERY OF THE SOFTWARE BE LIABLE FOR ANY LOSS OF PROFITS, DATA, USE\nOF THE SOFTWARE, DOCUMENTATION OR EQUIPMENT, OR FOR ANY SPECIAL,\nINCIDENTAL, CONSEQUENTIAL, EXEMPLARY, PUNITIVE, MULTIPLE OR OTHER\nDAMAGES, ARISING FROM OR IN CONNECTION WITH THE SOFTWARE EVEN IF\nNETRONOME OR ITS LICENSORS HAVE BEEN MADE AWARE OF THE POSSIBILITY OF\nSUCH DAMAGES AND NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY\nLIMITED REMEDY.\n\nEXPORT COMPLIANCE. LICENSEE shall not use or export or transmit the\nSOFTWARE, directly or indirectly, to any restricted countries or in any\nother manner that would violate any applicable US and other export\ncontrol and other regulations and laws as shall from time to time govern\nthe delivery, license and use of technology, including without limitation\nthe Export Administration Act of 1979, as amended, and any regulations\nissued thereunder.\n\nPROHIBITION OF SOFTWARE USE IN HIGH RISK ACTIVITIES AND LIFE\nSUPPORT APPLICATIONS. The SOFTWARE is not designed, manufactured or\nintended for use as on-line control equipment in hazardous environments\nrequiring fail-safe performance, such as in the operation of nuclear\nfacilities, aircraft navigation or communications systems, air traffic\ncontrol, life support systems, human implantation or any other\napplication where product failure could lead to loss of life or\ncatastrophic property damage or weapons systems, in which the failure of\nthe SOFTWARE could lead directly to death, personal injury, or severe\nphysical or environmental damage (\"High Risk Activities\"). Accordingly\nNETRONOME and, where applicable, NETRONOME'S third party licensors\nspecifically disclaim any express or implied warranty of fitness for High\nRisk Activities."
}