{
  "key": "new-relic",
  "short_name": "New Relic License",
  "name": "New Relic License",
  "category": "Proprietary Free",
  "owner": "New Relic",
  "homepage_url": "https://github.com/newrelic/rpm/blob/master/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-new-relic",
  "ignorable_copyrights": [
    "Copyright (c) 2008-2014 New Relic, Inc."
  ],
  "ignorable_holders": [
    "New Relic, Inc."
  ],
  "text": "All other components of this product are\nCopyright (c) 2008-2014 New Relic, Inc. All rights reserved.\n\nCertain inventions disclosed in this file may be claimed within\npatents owned or patent applications filed by New Relic, Inc. or third\nparties.\n\nSubject to the terms of this notice, New Relic grants you a\nnonexclusive, nontransferable license, without the right to\nsublicense, to (a) install and execute one copy of these files on any\nnumber of workstations owned or controlled by you and (b) distribute\nverbatim copies of these files to third parties. As a condition to the\nforegoing grant, you must provide this notice along with each copy you\ndistribute and you must not remove, alter, or obscure this notice. All\nother use, reproduction, modification, distribution, or other\nexploitation of these files is strictly prohibited, except as may be set\nforth in a separate written license agreement between you and New\nRelic. The terms of any such license agreement will control over this\nnotice. The license stated above will be automatically terminated and\nrevoked if you exceed its scope or violate any of the terms of this\nnotice.\n\nThis License does not grant permission to use the trade names,\ntrademarks, service marks, or product names of New Relic, except as\nrequired for reasonable and customary use in describing the origin of\nthis file and reproducing the content of this notice. You may not\nmark or brand this file with any trade name, trademarks, service\nmarks, or product names other than the original brand (if any)\nprovided by New Relic.\n\nUnless otherwise expressly agreed by New Relic in a separate written\nlicense agreement, these files are provided AS IS, WITHOUT WARRANTY OF\nANY KIND, including without any implied warranties of MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, TITLE, or NON-INFRINGEMENT. As a\ncondition to your use of these files, you are solely responsible for\nsuch use. New Relic will have no liability to you for direct,\nindirect, consequential, incidental, special, or punitive damages or\nfor lost profits or data."
}