{
    "key": "newton-king-cla",
    "short_name": "Newton-King CLA",
    "name": "James Newton-King CLA",
    "category": "CLA",
    "owner": "James Newton-King",
    "homepage_url": "https://github.com/JamesNK/Newtonsoft.Json/blob/ce7f283b94c86341036078ed2f4e241b907b816d/CONTRIBUTING.md",
    "notes": "this is a CLA",
    "spdx_license_key": "LicenseRef-scancode-newton-king-cla",
    "other_urls": [
        "https://github.com/aboutcode-org/scancode-toolit/issues/3038#issuecomment-1317511139"
    ],
    "text": "Contributor License Agreement\n\nBy contributing your code to Json.NET you grant James Newton-King a non-exclusive, irrevocable, worldwide,\nroyalty-free, sublicenseable, transferable license under all of Your relevant intellectual property rights\n(including copyright, patent, and any other rights), to use, copy, prepare derivative works of, distribute and\npublicly perform and display the Contributions on any licensing terms, including without limitation:\n(a) open source licenses like the MIT license; and (b) binary, proprietary, or commercial licenses. Except for the\nlicenses granted herein, You reserve all right, title, and interest in and to the Contribution.\n\nYou confirm that you are able to grant us these rights. You represent that You are legally entitled to grant the\nabove license. If Your employer has rights to intellectual property that You create, You represent that You have\nreceived permission to make the Contributions on behalf of that employer, or that Your employer has waived such\nrights for the Contributions.\n\nYou represent that the Contributions are Your original works of authorship, and to Your knowledge, no other person\nclaims, or has the right to claim, any right in any invention or patent related to the Contributions. You also\nrepresent that You are not legally obligated, whether by entering into an agreement or otherwise, in any way that\nconflicts with the terms of this license.\n\nJames Newton-King acknowledges that, except as explicitly described in this Agreement, any Contribution which\nyou provide is on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED,\nINCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, OR FITNESS\nFOR A PARTICULAR PURPOSE."
}
