{
  "key": "northwoods-sla-2024",
  "short_name": "Northwoods Software SLA 2024",
  "name": "Northwoods Software SLA 2024",
  "category": "Commercial",
  "owner": "Northwoods",
  "homepage_url": "https://gojs.net/latest/license.html",
  "spdx_license_key": "LicenseRef-scancode-northwoods-sla-2024",
  "faq_url": "https://nwoods.com/licenses",
  "other_urls": [
    "https://github.com/NorthwoodsSoftware/GoJS/blob/master/license.html"
  ],
  "text": "Northwoods Software\nSoftware License Agreement\n\nThis Software License Agreement (“this Agreement”) is a legal agreement between Northwoods Software Corporation, a New Hampshire corporation (“Northwoods”), and the individual or the firm, company, or other organization identified as the licensee (“Customer” or “You”) in the license certificate issued by Northwoods for this Agreement (the “License Certificate”). The terms of the License Certificate are an integral part of this Agreement.\n\nThe licensed software, consisting of libraries, executables, documentation, and samples created by Northwoods (collectively “Software”), is identified in the License Certificate.\n\nBY USING THE SOFTWARE, YOU AGREE TO BE BOUND BY THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE TO THE TERMS AND CONDITIONS OF THIS AGREEMENT, THEN YOU SHOULD NOT USE THE SOFTWARE.\n\n1 OWNERSHIP\n\nThe Software is licensed, not sold. Northwoods retains all right, title, and interest in and to the Software, including all trade secrets and intellectual property rights. This Agreement does not grant Customer any rights to patents, trademarks, or copyrights except as expressly set forth herein.\n\n2 GRANT OF LICENSE\n\n2.1 License\n\nSubject to the terms and conditions of this Agreement, Northwoods hereby grants Customer a worldwide, non-exclusive, non-transferable license (“License”) to use the Software. The License permits such number of developers in the Customer’s designated licensed group (each as specified in the License Certificate) to use the Software to develop such number of applications (each, an “Application”) as is specified in the License Certificate – which, unless a greater number of Applications is expressly stated in the License Certificate, is limited to one (1) Application.\n\nCustomer may:\n\n    copy the Software or any portion thereof, but only for purposes of Customer’s use thereof as permitted by this Agreement;\n    use the API of the Software to develop an Application; and\n    modify and incorporate any of the samples into an Application.\n\n2.2 Restrictions\n\nCustomer shall not:\n\n    modify the libraries or executables in the Software;\n    create derivative works of the Software or any portion thereof, other than an Application;\n    reverse engineer, decompile, disassemble, or deobfuscate the Software except to the extent permitted by applicable law;\n    distribute, sell, sublicense, or otherwise provide the Software or any portion thereof to any third party, except as otherwise expressly permitted by this Agreement; or\n    remove, alter, or obscure any proprietary notices in the Software.\n\n2.3 Source Code\n\nIf the License Certificate specifies that You have source code rights, You may use and modify the source code form of the Software (“Source Code”).\n\nYou acknowledge and agree that the Source Code is proprietary to Northwoods. You shall:\n\n    maintain the Source Code in confidence;\n    not disclose, distribute, sell, sublicense, or otherwise provide the Source Code to any third party;\n    only include minified or compiled Source Code in any Application;\n    defend, indemnify, and hold harmless Northwoods and its affiliates, and each of their respective officers, directors, employees and representatives from and against any claims, damages, losses, liabilities, judgements, costs, and expenses (including reasonable attorneys' fees) arising out of or relating to any third party claim with respect to any Source Code modifications made by You.\n\n3 TERM AND TERMINATION\n\n3.1 Term\n\nThis Agreement and the License are effective on the effective date specified in the License Certificate (the “Effective Date”), and shall continue in perpetuity thereafter, subject to termination as otherwise set forth in this Agreement.\n\n3.2 Termination\n\nThis Agreement may be terminated:\n\n    by Customer at any time and for any reason by written notice to Northwoods;\n    automatically if Customer breaches this Agreement; provided, that, if such breach is curable, this Agreement shall terminate if such breach is not cured by Customer within thirty (30) days following the first occurrence of such breach;\n    by Northwoods if Customer becomes insolvent, files for (or has filed against it) bankruptcy, or commences liquidation or receivership proceedings; or\n    by Northwoods or Customer as otherwise expressly permitted by this Agreement.\n\n3.3 Effect of Termination and Survival\n\nUpon termination of this Agreement, the License shall automatically end, Customer shall promptly cease all use of the Software, and Customer shall certify in writing to Northwoods that Customer has complied with its obligations hereunder.\n\nThe following provisions shall survive the termination of this Agreement: Section 1 (Ownership), Section 3.3 (Effect of Termination and Survival), Section 4.2 (Disclaimer of Warranty), Section 5 (Limitation of Liability), Section 6 (Payment and Taxes), and Section 7 (Miscellaneous).\n\n4 LIMITED WARRANTY, DISCLAIMER OF WARRANTY\n\n4.1 Limited Warranty\n\nNorthwoods warrants (the “Limited Warranty”) that the Software will, for a period of thirty (30) days following the Effective Date (the “Limited Warranty Period”), function substantially as set forth in related Software documentation. In the event of a breach of the Limited Warranty, Customer’s sole and exclusive remedy for such breach shall be repair or replacement of the defective Software within thirty (30) days of being notified of such breach, or, if Northwoods is unable to repair or replace the defective Software, or determines that such repair or replacement is impractical in Northwoods' sole judgment, then Northwoods may terminate this Agreement by providing written notice thereof to Customer and shall refund fees paid by Customer to Northwoods in the previous thirty (30) day period.\n\n4.2 Disclaimer\n\nEXCEPTING THE LIMITED WARRANTY, NORTHWOODS MAKES NO OTHER WARRANTIES, EXPRESS OR IMPLIED. WITHOUT LIMITING THE GENERALITY OF THE FOREGOING, NORTHWOODS DISCLAIMS ALL IMPLIED WARRANTIES, INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND ANY OTHER IMPLIED WARRANTY ARISING OUT OF OR IN CONNECTION WITH THE DELIVERY, USE, OR PERFORMANCE OF THE SOFTWARE.\n\n5 LIMITATION OF LIABILITY\n\nIN NO EVENT WILL NORTHWOODS, ITS SUBSIDIARIES OR OTHER AFFILIATES, OR ITS LICENSORS BE LIABLE TO YOU, WHETHER IN CONTRACT, BY REASON OF NEGLIGENCE OR OTHERWISE, FOR ANY PUNITIVE, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, OR INDIRECT DAMAGES, LOSSES, OR COSTS (INCLUDING LEGAL FEES AND EXPENSES) OR LOSS OF GOODWILL OR PROFITS IN CONNECTION WITH THE SUPPLY, USE, OR PERFORMANCE OF OR INABILITY TO USE THE SOFTWARE, OR NON-PERFORMANCE OR OTHER BREACH OF ANY OF NORTHWOODS’ OBLIGATIONS UNDER THIS AGREEMENT, OR IN CONNECTION WITH ANY CLAIM ARISING FROM THIS AGREEMENT OR RELATED IN ANY MANNER TO THE LICENSE AND/OR THE SOFTWARE.\n\nYOU AGREE THAT NORTHWOODS’ ENTIRE LIABILITY FOR ANY DAMAGES, LOSSES, AND COSTS FOR WHICH NORTHWOODS IS OTHERWISE LIABLE UNDER THIS AGREEMENT, OR THAT ARE RELATED IN ANY MANNER TO THE LICENSE AND/OR THE SOFTWARE SHALL NOT EXCEED, IN THE AGGREGATE FOR ANY AND ALL SUCH DAMAGES, LOSSES, AND COSTS, THE SUM OF ONE THOUSAND U.S. DOLLARS ($1,000 USD).\n\n6 PAYMENT AND TAXES\n\nIf credit has been extended to You by Northwoods, all payments are due within the payment terms specified on the associated invoice. If Northwoods has not extended credit to You, You shall be required to make payment concurrent with the Effective Date. Any value added tax, use tax, sales tax, or similar tax applicable to this Agreement, whether imposed on You or on Northwoods, shall be Your sole responsibility.\n\n7 MISCELLANEOUS\n\n7.1 Compliance with Laws\n\nYou shall, and You shall cause Your subsidiaries and other affiliates and Your and their officers, directors, managers, employees, owners, agents, and representatives, to comply with all U.S. and foreign laws and regulations (including export control laws and regulations) applicable to Your and their use and distribution of the Software and/or any Application. You agree to defend, indemnify, and hold harmless Northwoods and its subsidiaries and other affiliates, and each of their respective officers, directors, managers, employees, owners, agents, and representatives from and against any claims, damages, losses, liabilities, judgments, costs, and expenses (including reasonable attorneys’ fees) suffered or incurred by any such indemnitee that, in whole or in part, arise out of or relate to any breach or alleged breach by You of any of Your obligations under this Section.\n\n7.2 Consent\n\nYou agree that Northwoods may identify You as a customer of Northwoods, including by use of Your name and logo to do so. Northwoods shall comply with written requests to remove Your name and logo from its marketing materials.\n\n7.3 Assignment\n\nCustomer may not sell, assign, or otherwise transfer this Agreement, the License, or any of Customer’s rights or obligations under this Agreement. Any or all of this Agreement, the License, and Northwoods’ rights and obligations under this Agreement may be sold, assigned, or otherwise transferred by Northwoods.\n\n7.4 No Agency\n\nBoth parties agree that no agency, partnership, joint venture, or employment is created as a result of this Agreement. You do not have any authority of any kind to bind Northwoods.\n\n7.5 Governing Law\n\nThis Agreement shall be governed exclusively by, and construed exclusively in accordance with, the laws of the United States and the State of New Hampshire. The Federal and State courts of the State of New Hampshire shall have exclusive jurisdiction to adjudicate any dispute arising out of or relating to this Agreement. Each party hereby consents to the jurisdiction of such courts and waives any right it may otherwise have to challenge the appropriateness of such courts, whether on the basis of the doctrine of forum non conveniens or otherwise. The United Nations Convention on Contracts for the International Sale of Goods shall not apply to this Agreement.\n\n7.6 Legal Effect\n\nIf any provision in this Agreement shall be determined to be invalid, such provision shall be enforced to the fullest extent permitted by law, and the remainder of this Agreement shall continue in full force and effect. The failure of any party to enforce any provision of this Agreement shall not be deemed a waiver of that or any other provision of this Agreement.\n\n7.7 Entire Agreement\n\nThis Agreement is the complete and exclusive statement of the mutual understanding of the parties and supersedes and cancels all previous written and oral agreements, communications, and other understandings relating to the subject matter of this Agreement, and all waivers and modifications must be in a writing signed by both parties, except as otherwise provided herein.\n\nDate: November 1, 2024 – nwoods.com/licenses"
}