{
  "key": "notre-dame",
  "short_name": "Notre Dame License",
  "name": "University of Notre Dame License",
  "category": "Permissive",
  "owner": "University of Notre Dame",
  "homepage_url": "https://github.com/RWTH-OS/MP-MPICH/blob/f2ae296477bb9d812fda587221b3419c09f85b4a/MPI-2-C%2B%2B/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-notre-dame",
  "ignorable_copyrights": [
    "Copyright 1997-2000, University of Notre Dame"
  ],
  "ignorable_holders": [
    "University of Notre Dame"
  ],
  "ignorable_authors": [
    "Jeremy G. Siek, Jeffery M. Squyres, Michael P. McNally, and Andrew Lumsdaine"
  ],
  "text": "COPYRIGHT NOTICE:\nCopyright 1997-2000, University of Notre Dame.\nAuthors: Jeremy G. Siek, Jeffery M. Squyres, Michael P. McNally, and\n         Andrew Lumsdaine\n\nLICENSE AGREEMENT:\nIn consideration of being allowed to copy and/or use this software,\nuser agrees to be bound by the terms and conditions of this License\nAgreement as \"Licensee.\"  This Agreement gives you, the LICENSEE,\ncertain rights and obligations.  By using the software, you indicate\nthat you have read, understood, and will comply with the following\nterms and conditions.\n\nPermission is hereby granted to use or copy this program for any\npurpose, provided the text of this NOTICE (to include COPYRIGHT\nNOTICE, LICENSE AGREEMENT, and DISCLAIMER) is retained with all\ncopies.  Permission to modify the code and to distribute modified code\nis granted, provided the text of this NOTICE is retained, a notice\nthat the code was modified is included with the above COPYRIGHT NOTICE\nand with the COPYRIGHT NOTICE in any modified files, and that this\nfile (\"LICENSE\") is distributed with the modified code.\n\nTitle to copyright to this software and its derivatives and to any\nassociated documentation shall at all times remain with Licensor and\nLICENSEE agrees to preserve the same.  Nothing in this Agreement shall\nbe construed as conferring rights to use in advertising, publicity or\notherwise any trademark or the name of the University of Notre Dame du\nLac.\n\nDISCLAIMER:\n\nLICENSOR MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED.\nBy way of example, but not limitation, Licensor MAKES NO\nREPRESENTATIONS OR WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY\nPARTICULAR PURPOSE OR THAT THE USE OF THE LICENSED SOFTWARE COMPONENTS\nOR DOCUMENTATION WILL NOT INFRINGE ANY PATENTS, COPYRIGHTS, TRADEMARKS\nOR OTHER RIGHTS.\n\nThe Authors and the University of Notre Dame du Lac shall not be held\nliable for any liability nor for any direct, indirect or consequential\ndamages with respect to any claim by LICENSEE or any third party on\naccount of or arising from this Agreement or use of this software.\n\nAny disputes arising out of this Agreement or LICENSEE'S use of the\nsoftware at any time shall be resolved by the courts of the state of\nIndiana.  LICENSEE hereby consents to the jurisdiction of the Indiana\ncourts and waives the right to challenge the jurisdiction thereof in\nany dispute arising out of this Agreement or Licensee's use of the\nsoftware."
}