{
  "key": "nvidia-isaac-eula-2019.1",
  "short_name": "NVIDIA ISAAC EULA v2019.1",
  "name": "NVIDIA ISAAC EULA v2019.1",
  "category": "Proprietary Free",
  "owner": "NVIDIA",
  "homepage_url": "https://developer.nvidia.com/isaac-sdk",
  "spdx_license_key": "LicenseRef-scancode-nvidia-isaac-eula-2019.1",
  "faq_url": "https://forums.developer.nvidia.com/t/when-do-i-get-charged-for-using-isaac-in-my-business-application/121294",
  "ignorable_urls": [
    "https://developer.nvidia.com/"
  ],
  "text": "SOFTWARE LICENSE AGREEMENT FOR NVIDIA SOFTWARE DEVELOPMENT KITS\n\nThis Software License Agreement, including exhibits attached (\"Agreement”) is a\nlegal agreement between you and NVIDIA Corporation (\"NVIDIA\") and governs your\nuse of a NVIDIA software development kit (“SDK”).\n\nEach SDK has its own set of software and materials, but here is a description of\nthe types of items that may be included in a SDK: source code, header files,\nAPIs, data sets and assets (examples include images, textures, models, scenes,\nvideos, native API input/output files), binary software, sample code, libraries,\nutility programs, programming code and documentation.\n\nThis Agreement can be accepted only by an adult of legal age of majority in the\ncountry in which the SDK is used.\n\nIf you are entering into this Agreement on behalf of a company or other legal\nentity, you represent that you have the legal authority to bind the entity to\nthis Agreement, in which case “you” will mean the entity you represent.\n\nIf you don’t have the required age or authority to accept this Agreement, or if\nyou don’t accept all the terms and conditions of this Agreement, do not\ndownload, install, copy or use the SDK.\n\nYou agree to use the SDK only for purposes that are permitted by (a) this\nAgreement, and (b) any applicable law, regulation or generally accepted\npractices or guidelines in the relevant jurisdictions.\n\n    1. License.\n\n1.1 Grant\n\nSubject to the terms of this Agreement, NVIDIA hereby grants you a non-\nexclusive, non-transferable license, without the right to sublicense (except as\nexpressly provided in this Agreement) to:\n\n    (i) Install and use the SDK,\n\n    (ii) Modify and create derivative works of sample source code delivered in\n    the SDK, and\n\n    (iii) Distribute those portions of the SDK that are identified in this\n    Agreement as distributable, as incorporated in object code format into a\n    software application that meets the distribution requirements indicated in\n    this Agreement.\n\n1.2 Distribution Requirements\n\nThese are the distribution requirements for you to exercise the distribution grant:\n\n    (i) Your application must have material additional functionality, beyond the\n    included portions of the SDK.\n\n    (ii) The distributable portions of the SDK shall only be accessed by your\n    application.\n\n    (iii) The following notice shall be included in modifications and derivative\n    works of sample source code distributed: “This software contains source code\n    provided by NVIDIA Corporation.”\n\n    (iv) Unless a developer tool is identified in this Agreement as\n    distributable, it is delivered for your internal use only.\n\n    (v) The terms under which you distribute your application must be consistent\n    with the terms of this Agreement, including (without limitation) terms\n    relating to the license grant and license restrictions and protection of\n    NVIDIA’s intellectual property rights. Additionally, you agree that you will\n    protect the privacy, security and legal rights of your application users.\n\n    (vi) You agree to notify NVIDIA in writing of any known or suspected\n    distribution or use of the SDK not in compliance with the requirements of\n    this Agreement, and to enforce the terms of your agreements with respect to\n    distributed SDK.\n\n1.3 Authorized Users\n\nYou may allow employees and contractors of your entity or of your\nsubsidiary(ies) to access and use the SDK from your secure network to perform\nwork on your behalf.\n\nIf you are an academic institution you may allow users enrolled or employed by\nthe academic institution to access and use the SDK from your secure network.\n\nYou are responsible for the compliance with the terms of this Agreement by your\nauthorized users. If you become aware that your authorized users didn’t follow\nthe terms of this Agreement, you agree to take reasonable steps to resolve the\nnon-compliance and prevent new occurrences.\n\n1.4 Pre-Release SDK\n\nThe SDK versions identified as alpha, beta, preview or otherwise as pre-release,\nmay not be fully functional, may contain errors or design flaws, and may have\nreduced or different security, privacy, accessibility, availability, and\nreliability standards relative to commercial versions of NVIDIA software and\nmaterials. Use of a pre-release SDK may result in unexpected results, loss of\ndata, project delays or other unpredictable damage or loss.\n\nYou may use a pre-release SDK at your own risk, understanding that pre-release\nSDKs are not intended for use in production or business-critical systems.\n\nNVIDIA may choose not to make available a commercial version of any pre-release\nSDK. NVIDIA may also choose to abandon development and terminate the\navailability of a pre-release SDK at any time without liability.\n\n1.5 Updates\n\nNVIDIA may, at its option, make available patches, workarounds or other updates\nto this SDK. Unless the updates are provided with their separate governing\nterms, they are deemed part of the SDK licensed to you as provided in this\nAgreement.\n\nYou agree that the form and content of the SDK that NVIDIA provides may change\nwithout prior notice to you. While NVIDIA generally maintains compatibility\nbetween versions, NVIDIA may in some cases make changes that introduce\nincompatibilities in future versions of the SDK.\n\n1.6 Third Party Licenses\n\nThe SDK may come bundled with, or otherwise include or be distributed with,\nthird party software licensed by a NVIDIA supplier and/or open source software\nprovided under an open source license. Use of third party software is subject to\nthe third party license terms, or in the absence of third party terms, the terms\nof this Agreement. Copyright to third party software is held by the copyright\nholders indicated in the third-party software or license.\n\nYou acknowledge and agree that it is your sole responsibility to obtain any\nadditional third party licenses required to make, have made, use, have used,\nsell, import, and offer for sale your products or services that include or\nincorporate any third-party software and content relating to audio and/or video\nencoders and decoders from, including but not limited to, Microsoft, Thomson,\nFraunhofer IIS, Sisvel S.p.A., MPEG-LA, and Coding Technologies. NVIDIA does not\ngrant to you under this Agreement any necessary patent or other rights with\nrespect to any audio and/or video encoders and decoders.\n\n1.7 Reservation of Rights\n\nNVIDIA reserves all rights, title and interest in and to the SDK not expressly\ngranted to you under this Agreement.\n\n    2. Limitations.\n\nThe following license limitations apply to your use of the SDK:\n\n2.1 You may not reverse engineer, decompile or disassemble, or remove copyright\nor other proprietary notices from any portion of the SDK or copies of the SDK.\n\n2.2 Except as expressly provided in this Agreement, you may not copy, sell,\nrent, sublicense, transfer, distribute, modify, or create derivative works of\nany portion of the SDK. For clarity, you may not distribute or sublicense the\nSDK as a stand-alone product.\n\n2.3 Unless you have an agreement with NVIDIA for this purpose, you may not\nindicate that an application created with the SDK is sponsored or endorsed by\nNVIDIA.\n\n2.4 You may not bypass, disable, or circumvent any encryption, security, digital\nrights management or authentication mechanism in the SDK.\n\n2.5 You may not use the SDK in any manner that would cause it to become subject\nto an open source software license. As examples, licenses that require as a\ncondition of use, modification, and/or distribution that the SDK be (i)\ndisclosed or distributed in source code form; (ii) licensed for the purpose of\nmaking derivative works; or (iii) redistributable at no charge.\n\n2.6 Unless you have an agreement with NVIDIA for this purpose, you may not use\nthe SDK with any system or application where the use or failure of the system or\napplication can reasonably be expected to threaten or result in personal injury,\ndeath, or catastrophic loss. Examples include use in nuclear, avionics,\nnavigation, military, medical, life support or other life critical applications.\nNVIDIA does not design, test or manufacture the SDK for these critical uses and\nNVIDIA shall not be liable to you or any third party, in whole or in part, for\nany claims or damages arising from such uses.\n\n2.7 You agree to defend, indemnify and hold harmless NVIDIA and its affiliates,\nand their respective employees, contractors, agents, officers and directors,\nfrom and against any and all claims, damages, obligations, losses, liabilities,\ncosts or debt, fines, restitutions and expenses (including but not limited to\nattorney’s fees and costs incident to establishing the right of indemnification)\narising out of or related to your use of the SDK outside of the scope of this\nAgreement, or not in compliance with its terms.\n\n    3. Ownership.\n\n3.1 NVIDIA or its licensors hold all rights, title and interest in and to the\nSDK and its modifications and derivative works, including their respective\nintellectual property rights, subject to your rights under Section 3.2. This SDK\nmay include software and materials from NVIDIA’s licensors, and these licensors\nare intended third party beneficiaries that may enforce this Agreement with\nrespect to their intellectual property rights.\n\n3.2 You hold all rights, title and interest in and to your applications and your\nderivative works of the sample source code delivered in the SDK, including their\nrespective intellectual property rights, subject to NVIDIA’s rights under\nsection 3.1.\n\n3.3 You may, but don’t have to, provide to NVIDIA suggestions, feature requests\nor other feedback regarding the SDK, including possible enhancements or\nmodifications to the SDK. For any feedback that you voluntarily provide, you\nhereby grant NVIDIA and its affiliates a perpetual, non-exclusive, worldwide,\nirrevocable license to use, reproduce, modify, license, sublicense (through\nmultiple tiers of sublicensees), and distribute (through multiple tiers of\ndistributors) it without the payment of any royalties or fees to you. NVIDIA\nwill decide if and how to respond to feedback and if to incorporate feedback\ninto the SDK. NVIDIA is constantly looking for ways to improve its products, so\nyou may send feedback to NVIDIA through the developer portal at\nhttps://developer.nvidia.com.\n\n    4. No Warranties.\n\nTHE SDK IS PROVIDED BY NVIDIA “AS IS” AND “WITH ALL FAULTS.” TO THE MAXIMUM\nEXTENT PERMITTED BY LAW, NVIDIA\n\nAND ITS AFFILIATES EXPRESSLY DISCLAIM ALL WARRANTIES OF ANY KIND OR NATURE,\nWHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, NON-\nINFRINGEMENT, OR THE ABSENCE OF ANY DEFECTS THEREIN, WHETHER LATENT OR PATENT.\nNO WARRANTY IS MADE ON THE BASIS OF TRADE USAGE, COURSE OF DEALING OR COURSE OF\nTRADE.\n\n    5. Limitations of Liability.\n\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, NVIDIA AND ITS AFFILIATES SHALL NOT BE\nLIABLE FOR ANY SPECIAL, INCIDENTAL, PUNITIVE OR CONSEQUENTIAL DAMAGES, OR ANY\nLOST PROFITS, LOSS OF USE, LOSS OF DATA OR LOSS OF GOODWILL, OR THE COSTS OF\nPROCURING SUBSTITUTE PRODUCTS, ARISING OUT OF OR IN CONNECTION WITH THIS\nAGREEMENT OR THE USE OR PERFORMANCE OF THE SDK, WHETHER SUCH LIABILITY ARISES\nFROM ANY CLAIM BASED UPON BREACH OF CONTRACT, BREACH OF WARRANTY, TORT\n(INCLUDING NEGLIGENCE), PRODUCT LIABILITY OR ANY OTHER CAUSE OF ACTION OR THEORY\nOF LIABILITY. IN NO EVENT WILL NVIDIA’S AND ITS AFFILIATES TOTAL CUMULATIVE\nLIABILITY UNDER OR ARISING OUT OF THIS AGREEMENT EXCEED US$10.00. THE NATURE OF\nTHE LIABILITY OR THE NUMBER OF CLAIMS OR SUITS SHALL NOT ENLARGE OR EXTEND THIS\nLIMIT.\n\nThese exclusions and limitations of liability shall apply regardless if NVIDIA\nor its affiliates have been advised of the possibility of such damages, and\nregardless of whether a remedy fails its essential purpose. These exclusions and\nlimitations of liability form an essential basis of the bargain between the\nparties, and, absent any of these exclusions or limitations of liability, the\nprovisions of this Agreement, including, without limitation, the economic terms,\nwould be substantially different.\n\n    6. Termination.\n\n6.1 This Agreement will continue to apply until terminated by either you or\nNVIDIA as described below.\n\n6.2 If you want to terminate this Agreement, you may do so by stopping to use\nthe SDK.\n\n6.3 NVIDIA may, at any time, terminate this Agreement if: (i) you fail to comply\nwith any term of this Agreement and the non-compliance is not fixed within\nthirty (30) days following notice from NVIDIA (or immediately if you violate\nNVIDIA’s intellectual property rights); (ii) you commence or participate in any\nlegal proceeding against NVIDIA with respect to the SDK; or (iii) NVIDIA decides\nto no longer provide the SDK in a country or, in NVIDIA’s sole discretion, the\ncontinued use of it is no longer commercially viable.\n\n6.4 Upon any termination of this Agreement, you agree to promptly discontinue\nuse of the SDK and destroy all copies in your possession or control. Your prior\ndistributions in accordance with this Agreement are not affected by the\ntermination of this Agreement. Upon written request, you will certify in writing\nthat you have complied with your commitments under this section. Upon any\ntermination of this Agreement all provisions survive except for the licenses\ngranted to you.\n\n    7. General.\n\nIf you wish to assign this Agreement or your rights and obligations, including\nby merger, consolidation, dissolution or operation of law, contact NVIDIA to ask\nfor permission. Any attempted assignment not approved by NVIDIA in writing shall\nbe void and of no effect. NVIDIA may assign, delegate or transfer this Agreement\nand its rights and obligations, and if to a non-affiliate you will be notified.\n\nYou agree to cooperate with NVIDIA and provide reasonably requested information\nto verify your compliance with this Agreement.\n\nThis Agreement will be governed in all respects by the laws of the United States\nand of the State of Delaware as those laws are applied to contracts entered into\nand performed entirely within Delaware by Delaware residents, without regard to\nthe\n\nconflicts of laws principles. The United Nations Convention on Contracts for the\nInternational Sale of Goods is specifically disclaimed. You agree to all terms\nof this Agreement in the English language.\n\nThe state or federal courts residing in Santa Clara County, California shall\nhave exclusive jurisdiction over any dispute or claim arising out of this\nAgreement. Notwithstanding this, you agree that NVIDIA shall still be allowed to\napply for injunctive remedies or an equivalent type of urgent legal relief in\nany jurisdiction.\n\nIf any court of competent jurisdiction determines that any provision of this\nAgreement is illegal, invalid or unenforceable, such provision will be construed\nas limited to the extent necessary to be consistent with and fully enforceable\nunder the law and the remaining provisions will remain in full force and effect.\nUnless otherwise specified, remedies are cumulative.\n\nEach party acknowledges and agrees that the other is an independent contractor\nin the performance of this Agreement.\n\nNeither party will be responsible for any failure or delay in its performance\nunder this Agreement to the extent due to causes beyond its reasonable control\nfor so long as the cause or event continues in effect.\n\nThe SDK has been developed entirely at private expense and is “commercial items”\nconsisting of “commercial computer software” and “commercial computer software\ndocumentation” provided with RESTRICTED RIGHTS. Use, duplication or disclosure\nby the U.S. Government or a U.S. Government subcontractor is subject to the\nrestrictions in this Agreement pursuant to DFARS 227.7202-3(a) or as set forth\nin subparagraphs (b)(1) and (2) of the Commercial Computer Software - Restricted\nRights clause at FAR 52.227-19, as applicable. Contractor/manufacturer is\nNVIDIA, 2788 San Tomas Expressway, Santa Clara, CA 95051.\n\nThe SDK is subject to United States export laws and regulations. You agree that\nyou will not ship, transfer or export the SDK into any country, or use the SDK\nin any manner, prohibited by the United States Bureau of Industry and Security\nor economic sanctions regulations administered by the U.S. Department of\nTreasury’s Office of Foreign Assets Control (OFAC), or any applicable export\nlaws, restrictions or regulations. These laws include restrictions on\ndestinations, end users and end use. By accepting this Agreement, you confirm\nthat you are not a resident or citizen of any country currently embargoed by the\nU.S. and that you are not otherwise prohibited from receiving the SDK.\n\nAny notice delivered by NVIDIA to you under this Agreement will be delivered via\nmail, email or fax. You agree that any notices that NVIDIA sends you\nelectronically will satisfy any legal communication requirements. Please direct\nyour legal notices or other correspondence to NVIDIA Corporation, 2788 San Tomas\nExpressway, Santa Clara, California 95051, United States of America, Attention:\nLegal Department.\n\nThis Agreement and any exhibits incorporated to this Agreement constitute the\nentire agreement of the parties with respect to the subject matter of this\nAgreement and supersede all prior negotiations, conversations, or discussions\nbetween the parties relating to this subject matter. Any additional and/or\nconflicting terms on documents issued by you are null, void, and invalid. Any\namendment or waiver under this Agreement shall be in writing and signed by\nrepresentatives of both parties.\n\n(v. March 8, 2019)\n\n\nISAAC SUPPLEMENT\n\nTO SOFTWARE LICENSE AGREEMENT FOR NVIDIA SOFTWARE DEVELOPMENT KITS\n\nThe terms in this supplement govern your use of the NVIDIA Isaac SDK under the\nterms of your software license agreement (“Agreement”) as modified by this\nsupplement. Capitalized terms used but not defined below have the meaning\nassigned to them in the Agreement.\n\nThis supplement is an exhibit to the Agreement and is incorporated as an\nintegral part of the Agreement. In the event of conflict between the terms in\nthis supplement and the terms in the Agreement, the terms in this supplement\ngovern.\n\n    1. Distribution. The following portions of the SDK are distributable under\n    the Agreement: the runtimes files ending with .so and .a as part of your\n    application.\n\n    2. Samples. In this SDK, the folder that contains sample source code is the\n    apps/samples folder. With respect to source code samples licensed to you,\n    NVIDIA and its affiliates are free to continue independently developing\n    source code samples and you covenant not to sue NVIDIA, its affiliates or\n    their licensees with respect to later versions of NVIDIA released source\n    code samples.\n\n    3. Restrictions. The following restrictions apply:\n\n        I. You are not permitted to disclose the results of any benchmarking or\n        other competitive analysis relating to the SDK without the prior written\n        permission from NVIDIA; and\n\n        II. The SDK is licensed for use with a computer system incorporating one\n        or more NVIDIA GPU hardware products and running NVIDIA software\n        drivers.\n\n    4. Source Code Modification and Ownership. Subject to the terms of the\n    Agreement and this supplement, NVIDIA hereby grants you a non-exclusive,\n    non-transferable license, without the right to sublicense to modify and\n    create derivative works of software provided to you by NVIDIA in source code\n    form, except for header files. As between you and NVIDIA, NVIDIA holds all\n    rights, title and interest in and to your modifications and derivative works\n    of the source code software. Subject to NVIDIA’s rights described in the\n    Agreement and this section, you retain all rights, title and in and to your\n    software and products developed independently from the use of the SDK (as\n    may be demonstrated by documentation). You have no obligation to provide to\n    NVIDIA your modifications to the NVIDIA source code.\n\n    5. Indemnity. You agree to defend, indemnify and hold harmless NVIDIA and\n    its affiliates, and their respective employees, contractors, agents,\n    officers and directors, from and against any and all claims, damages,\n    obligations, losses, liabilities, costs or debt, fines, restitutions and\n    expenses (including but not limited to attorney’s fees and costs incident to\n    establishing the right of indemnification) arising out of or related to any\n    damages, or injuries, illness or death related to the use of goods and/or\n    services that include or utilize the SDK.\n\n(v. March 8, 2019)"
}