{
  "key": "nvidia-dlc-2021",
  "short_name": "NVIDIA Deep Learning Container License 2021",
  "name": "NVIDIA Deep Learning Container License 2021",
  "category": "Proprietary Free",
  "owner": "NVIDIA",
  "spdx_license_key": "LicenseRef-scancode-nvidia-dlc-2021",
  "text_urls": [
    "https://developer.download.nvidia.com/licenses/NVIDIA_Deep_Learning_Container_License.pdf"
  ],
  "other_urls": [
    "https://docs.nvidia.com/deeplearning/frameworks/user-guide/index.html"
  ],
  "ignorable_emails": [
    "nvidia-compute-license-questions@nvidia.com"
  ],
  "text": "NVIDIA DEEP LEARNING CONTAINER LICENSE\n\nThis license is a legal agreement between you and NVIDIA Corporation (\"NVIDIA\")\nand governs the use of the NVIDIA container and all its contents (“CONTAINER”).\n\nThis license can be accepted only by an adult of legal age of majority in the\ncountry in which the CONTAINER is used. If you are under the legal age of\nmajority, you must ask your parent or legal guardian to consent to this license.\nIf you are entering this license on behalf of a company or other legal entity,\nyou represent that you have legal authority and “you” will mean the entity you\nrepresent.\n\nBy using the CONTAINER, you affirm that you have reached the legal age of\nmajority, you accept the terms of this license, and you take legal and financial\nresponsibility for the actions of your permitted users.\n\nYou agree to use the CONTAINER only for purposes that are permitted by (a) this\nlicense, and (b) any applicable law, regulation or generally accepted practices\nor guidelines in the relevant jurisdictions.\n\n1. LICENSE. Subject to the terms of this license, NVIDIA hereby grants you a\nnon-exclusive, non-transferable license, without the right to sublicense (except\nas expressly provided in this license) to:\n\na. Install and use copies of the CONTAINER, and modify and create derivative\nworks of samples or example source code delivered in the CONTAINER (if\napplicable), to develop and test services and applications,\n\nb. Deploy the CONTAINER on infrastructure you own or lease to offer a service to\nthird parties, without distributing the CONTAINER or exposing the NVIDIA APIs in\nthe CONTAINER directly to such service users, and\n\nc. Develop and extend the CONTAINER to create a Compatible (as defined below)\nderived CONTAINER that includes the entire CONTAINER plus other software with\nprimary functionality, to develop and compile applications, and distribute such\nderived CONTAINER to run applications, subject to the distribution requirements\nindicated in this license. As used in this section, “Compatible” means that\nextensions to the CONTAINER must not adversely affect the functionality of the\nother components in the CONTAINER.\n\n2. DISTRIBUTION REQUIREMENTS. For purposes of this Section 2, the term\n“distribution” also means the deployment of CONTAINERS in a service or an\napplication for third parties to access over the internet. These are the\ndistribution requirements for you to exercise the grants above:\n\na. A service or an application must have material additional functionality,\nbeyond the included portions of the CONTAINER.\n\nb. The following notice shall be included in modifications and derivative works\nof source code distributed: “This software contains source code provided by\nNVIDIA Corporation.”\n\nc. You agree to distribute the CONTAINER subject to the terms at least as\nprotective as the terms of this license, including (without limitation) terms\nrelating to the license grant, license restrictions and protection of NVIDIA’s\nintellectual property rights. Additionally, you agree that you will protect the\nprivacy, security and legal rights of your application users.\n\nd. You agree to notify NVIDIA in writing of any known or suspected distribution\nor use of the CONTAINER not in compliance with the requirements of this license,\nand to enforce the terms of your agreements with respect to the distributed\nCONTAINER.\n\n3. AUTHORIZED USERS. You may allow employees and contractors of your entity or\nof your subsidiary(ies) to access and use the CONTAINER from your secure network\nto perform work on your behalf. If you are an academic institution you may allow\nusers enrolled or employed by the academic institution to access and use the\nCONTAINER from your secure network. You are responsible for the compliance with\nthe terms of this license by your authorized users.\n\n4. LIMITATIONS. Your license to use the CONTAINER is restricted as follows:\n\na. The CONTAINER may run on any computing system with or without NVIDIA GPUs,\nexcept for the NVIDIA proprietary software (such as CUDA and TensorRT software)\nin the CONTAINER which is licensed only to run on systems with NVIDIA GPUs. The\nNVIDIA proprietary software in the CONTAINER may be present on systems without\nNVIDIA GPUs, as long as it is not running on such systems. For components\ngoverned by open source software licenses, see the information in the\n“Components Under Other Licenses” section below.\n\nb. You may not reverse engineer, decompile or disassemble, or remove copyright\nor other proprietary notices from any portion of the CONTAINER or copies of the\nCONTAINER.\n\nc. Except as expressly provided in this license, you may not copy, sell, rent,\nsublicense, transfer, distribute, modify, or create derivative works of any\nportion of the CONTAINER. For clarity, you may not distribute or sublicense the\nCONTAINER as a stand-alone product.\n\nd. Unless you have an agreement with NVIDIA for this purpose, you may not\nindicate that a service or an application created with the CONTAINER is\nsponsored or endorsed by NVIDIA.\n\ne. You may not bypass, disable, or circumvent any technical limitation,\nencryption, security, digital rights management or authentication mechanism in\nthe CONTAINER.\n\nf. You may not replace any NVIDIA software components in the CONTAINER that are\ngoverned by this license with other software that implements NVIDIA APIs.\n\ng. You may not use the CONTAINER in any manner that would cause it to become\nsubject to an open source software license. As examples, licenses that require\nas a condition of use, modification, and/or distribution that the CONTAINER be:\n(i) disclosed or distributed in source code form; (ii) licensed for the purpose\nof making derivative works; or (iii) redistributable at no charge.\n\nh. You acknowledge that the CONTAINER as delivered is not tested or certified by\nNVIDIA for use in connection with the design, construction, maintenance, and/or\noperation of any system where the use or failure of such system could result in\na situation that threatens the safety of human life or results in catastrophic\ndamages (each, a “Critical Application”). Examples of Critical Applications\ninclude use in avionics, navigation, autonomous vehicle applications, ai\nsolutions for automotive products, military, medical, life support or other life\ncritical applications. NVIDIA shall not be liable to you or any third party, in\nwhole or in part, for any claims or damages arising from such uses. You are\nsolely responsible for ensuring that any product or service developed with the\nCONTAINER as a whole includes sufficient features to comply with all applicable\nlegal and regulatory standards and requirements.\n\ni. You agree to defend, indemnify and hold harmless NVIDIA and its affiliates,\nand their respective employees, contractors, agents, officers and directors,\nfrom and against any and all claims, damages, obligations, losses, liabilities,\ncosts or debt, fines, restitutions and expenses (including but not limited to\nattorney’s fees and costs incident to establishing the right of indemnification)\narising out of or related to products or services that use the CONTAINER in or\nfor Critical Applications, and for use of the CONTAINER outside of the scope of\nthis license or not in compliance with its terms.\n\nj. You may not reverse engineer, decompile or disassemble any portion of the\noutput generated using the NVIDIA proprietary software (such as CUDA and\nTensorRT software) in the CONTAINER for the purpose of translating such output\nartifacts to target a non-NVIDIA platform.\n\n5. UPDATES. NVIDIA may, at its option, make available patches, workarounds or\nother updates to this CONTAINER. Unless the updates are provided with their\nseparate governing terms, they are deemed part of the CONTAINER licensed to you\nas provided in this license. You agree that the form and content of the\nCONTAINER that NVIDIA provides may change without prior notice to you. While\nNVIDIA generally maintains compatibility between versions, NVIDIA may in some\ncases make changes that introduce incompatibilities in future versions of the\nCONTAINER.\n\n6. PRE-RELEASE VERSIONS. CONTAINER versions identified as alpha, beta, preview,\nearly access or otherwise as pre-release may not be fully functional, may\ncontain errors or design flaws, and may have reduced or different security,\nprivacy, availability, and reliability standards relative to commercial versions\nof NVIDIA software and materials. You may use a pre- release CONTAINER version\nat your own risk, understanding that these versions are not intended for use in\nproduction or business-critical systems. NVIDIA may choose not to make available\na commercial version of any pre-release CONTAINER. NVIDIA may also choose to\nabandon development and terminate the availability of a pre-release CONTAINER at\nany time without liability.\n\n7. COMPONENTS UNDER OTHER LICENSES. The CONTAINER may include NVIDIA or\nthird-party components with separate legal notices or terms as may be described\nin proprietary notices accompanying the CONTAINER. If and to the extent there is\na conflict between the terms in this license and the license terms associated\nwith the component, the license terms associated with the components control\nonly to the extent necessary to resolve the conflict. For example, some Triton\ncomponents (such as the Triton Inference Server) are governed by open source\nsoftware licenses.\n\nYou acknowledge and agree that it is your sole responsibility to obtain any\nadditional third-party licenses required to make, have made, use, have used,\nsell, import, and offer for sale your products or services that include or\nincorporate any third- party software and content relating to audio and/or video\nencoders and decoders from, including but not limited to, Microsoft, Thomson,\nFraunhofer IIS, Sisvel S.p.A., MPEG-LA, and Coding Technologies. NVIDIA does not\ngrant to you under this license any necessary patent or other rights with\nrespect to any audio and/or video encoders and decoders. Subject to the other\nterms of this license, you may use the CONTAINER to develop and test\napplications released under Open Source Initiative (OSI) approved open source\nsoftware licenses.\n\n8. OWNERSHIP.\n\n8.1 NVIDIA reserves all rights, title and interest in and to the CONTAINER not\nexpressly granted to you under this license. NVIDIA and its suppliers hold all\nrights, title and interest in and to the CONTAINER, including their respective\nintellectual property rights. The CONTAINER is copyrighted and protected by the\nlaws of the United States and other countries, and international treaty\nprovisions.\n\n8.2 Subject to the rights of NVIDIA and its suppliers in the CONTAINER, you hold\nall rights, title and interest in and to your services, applications and your\nderivative works of the sample source code delivered in the CONTAINER including\ntheir respective intellectual property rights.\n\n9. FEEDBACK. You may, but are not obligated to, provide to NVIDIA suggestions,\nfixes, modifications, feature requests or other feedback regarding the CONTAINER\n(“Feedback”). Feedback, even if designated as confidential by you, shall not\ncreate any confidentiality obligation for NVIDIA. NVIDIA and its designees have\na perpetual, non-exclusive, worldwide, irrevocable license to use, reproduce,\npublicly display, modify, create derivative works of, license, sublicense, and\notherwise distribute and exploit Feedback as NVIDIA sees fit without payment and\nwithout obligation or restriction of any kind on account of intellectual\nproperty rights or otherwise.\n\n10. NO WARRANTIES. THE CONTAINER IS PROVIDED AS-IS. TO THE MAXIMUM EXTENT\nPERMITTED BY APPLICABLE LAW NVIDIA AND ITS AFFILIATES EXPRESSLY DISCLAIM ALL\nWARRANTIES OF ANY KIND OR NATURE, WHETHER EXPRESS, IMPLIED OR STATUTORY,\nINCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT,\nOR FITNESS FOR A PARTICULAR PURPOSE. NVIDIA DOES NOT WARRANT THAT THE CONTAINER\nWILL MEET YOUR REQUIREMENTS OR THAT THE OPERATION THEREOF WILL BE UNINTERRUPTED\nOR ERROR-FREE, OR THAT ALL ERRORS WILL BE CORRECTED.\n\n11. LIMITATIONS OF LIABILITY. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW\nNVIDIA AND ITS AFFILIATES SHALL NOT BE LIABLE FOR ANY SPECIAL, INCIDENTAL,\nPUNITIVE OR CONSEQUENTIAL DAMAGES, OR FOR ANY LOST PROFITS, PROJECT DELAYS, LOSS\nOF USE, LOSS OF DATA OR LOSS OF GOODWILL, OR THE COSTS OF PROCURING SUBSTITUTE\nPRODUCTS, ARISING OUT OF OR IN CONNECTION WITH THIS LICENSE OR THE USE OR\nPERFORMANCE OF THE CONTAINER, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED\nUPON BREACH OF CONTRACT, BREACH OF WARRANTY, TORT (INCLUDING NEGLIGENCE),\nPRODUCT LIABILITY OR ANY OTHER CAUSE OF ACTION OR THEORY OF LIABILITY, EVEN IF\nNVIDIA HAS PREVIOUSLY BEEN ADVISED OF, OR COULD REASONABLY HAVE FORESEEN, THE\nPOSSIBILITY OF SUCH DAMAGES. IN NO EVENT WILL NVIDIA’S AND ITS AFFILIATES TOTAL\nCUMULATIVE LIABILITY UNDER OR ARISING OUT OF THIS LICENSE EXCEED US$10.00. THE\nNATURE OF THE LIABILITY OR THE NUMBER OF CLAIMS OR SUITS SHALL NOT ENLARGE OR\nEXTEND THIS LIMIT.\n\n12. TERMINATION. Your rights under this license will terminate automatically\nwithout notice from NVIDIA if you fail to comply with any term and condition of\nthis license or if you commence or participate in any legal proceeding against\nNVIDIA with respect to the CONTAINER. NVIDIA may terminate this license with\nadvance written notice to you, if NVIDIA decides to no longer provide the\nCONTAINER in a country or, in NVIDIA’s sole discretion, the continued use of it\nis no longer commercially viable. Upon any termination of this license, you\nagree to promptly discontinue use of the CONTAINER and destroy all copies in\nyour possession or control. Your prior distributions in accordance with this\nlicense are not affected by the termination of this license. All provisions of\nthis license will survive termination, except for the license granted to you.\n\n13. APPLICABLE LAW. This license will be governed in all respects by the laws of\nthe United States and of the State of Delaware, without regard to the conflicts\nof laws principles. The United Nations Convention on Contracts for the\nInternational Sale of Goods is specifically disclaimed. You agree to all terms\nof this license in the English language. The state or federal courts residing in\nSanta Clara County, California shall have exclusive jurisdiction over any\ndispute or claim arising out of this license. Notwithstanding this, you agree\nthat NVIDIA shall still be allowed to apply for injunctive remedies or urgent\nlegal relief in any jurisdiction.\n\n14. NO ASSIGNMENT. This license and your rights and obligations thereunder may\nnot be assigned by you by any means or operation of law without NVIDIA’s\npermission. Any attempted assignment not approved by NVIDIA in writing shall be\nvoid and of no effect. NVIDIA may assign, delegate or transfer this license and\nits rights and obligations, and if to a non-affiliate you will be notified.\n\n15. EXPORT. The CONTAINER is subject to United States export laws and\nregulations. You agree to comply with all applicable U.S. and international\nexport laws, including the Export Administration Regulations (EAR) administered\nby the U.S. Department of Commerce and economic sanctions administered by the\nU.S. Department of Treasury’s Office of Foreign Assets Control (OFAC). These\nlaws include restrictions on destinations, end-users and end-use. By accepting\nthis license, you confirm that you are not currently residing in a country or\nregion currently embargoed by the U.S. and that you are not otherwise prohibited\nfrom receiving the CONTAINER.\n\n16. GOVERNMENT USE. The CONTAINER is, and shall be treated as being, “Commercial\nItems” as that term is defined at 48 CFR § 2.101, consisting of “commercial\ncomputer software” and “commercial computer software documentation”,\nrespectively, as such terms are used in, respectively, 48 CFR § 12.212 and 48\nCFR §§ 227.7202 & 252.227-7014(a)(1). Use, duplication or disclosure by the U.S.\nGovernment or a U.S. Government subcontractor is subject to the restrictions in\nthis license pursuant to 48 CFR § 12.212 or 48 CFR § 227.7202. In no event shall\nthe US Government user acquire rights in the CONTAINER beyond those specified in\n48 C.F.R. 52.227-19(b)(1)-(2).\n\n17. NOTICES. Please direct your legal notices or other correspondence to NVIDIA\nCorporation, 2788 San Tomas Expressway, Santa Clara, California 95051, United\nStates of America, Attention: Legal Department. 18. ENTIRE AGREEMENT. This\nlicense is the final, complete and exclusive agreement between the parties\nrelating to the subject matter of this license and supersedes all prior or\ncontemporaneous understandings and agreements relating to this subject matter,\nwhether oral or written. If any court of competent jurisdiction determines that\nany provision of this license is illegal, invalid or unenforceable, the\nremaining provisions will remain in full force and effect. Any amendment or\nwaiver under this license shall be in writing and signed by representatives of\nboth parties.\n\n19. LICENSING. If the distribution terms in this license are not suitable for\nyour organization, or for any questions regarding this license, please contact\nNVIDIA at nvidia-compute-license-questions@nvidia.com.\n\n(v. September 14, 2021)"
}