{
  "key": "nxp-mc-firmware",
  "short_name": "NXP MC Firmware License",
  "name": "NXP MC Firmware License",
  "category": "Proprietary Free",
  "owner": "NXP",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENSE.nxp_mc_firmware",
  "spdx_license_key": "LicenseRef-scancode-nxp-mc-firmware",
  "ignorable_copyrights": [
    "Copyright (c) 2006 David Gibson, IBM Corporation",
    "Copyright (c) 2006,2008-2011 Joseph Koshy"
  ],
  "ignorable_holders": [
    "David Gibson, IBM Corporation",
    "Joseph Koshy"
  ],
  "text": "Software License Agreement (\"Agreement\")\n\nANY USE, REPRODUCTION, OR DISTRIBUTION OF THE ACCOMPANYING BINARY SOFTWARE\nCONSTITUTES LICENSEE'S ACCEPTANCE OF THE TERMS AND CONDITIONS OF THIS AGREEMENT.\n\nLicensed Software. \"Binary Software\" means software in binary form specified in\nANNEX A. Subject to the terms and conditions of this Agreement, NXP USA, Inc.\n(\"Licensor\"), grants to you (\"Licensee\") a worldwide, non-exclusive, and\nroyalty-free license to reproduce and distribute the Binary Software in its\ncomplete and unmodified binary form as provided by Licensor, for use solely in\nconjunction with a programmable processing unit supplied directly or indirectly\nfrom Licensor.\n\nRestrictions. Licensee must reproduce the Licensor copyright notice above with\neach binary copy of the Binary Software or in the accompanying documentation.\nLicensee must not reverse engineer, decompile, disassemble or modify in any way\nthe Binary Software. Licensee must not use the Binary Software in violation of\nany applicable law or regulation. This Agreement shall automatically terminate\nupon Licensee's breach of any term or condition of this Agreement in which case,\nLicensee shall destroy all copies of the Binary Software. Neither the name of\nLicensor nor the names of its suppliers may be used to endorse or promote\nproducts derived from this Binary Software without specific prior written\npermission.\n\nDisclaimer. TO THE MAXIMUM EXTENT PERMITTED BY LAW, LICENSOR EXPRESSLY\nDISCLAIMS ANY WARRANTY FOR THE BINARY SOFTWARE. THE BINARY SOFTWARE IS PROVIDED\n\"AS IS\", WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING\nWITHOUT LIMITATION THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE, OR NON-INFRINGEMENT. WITHOUT LIMITING THE GENERALITY OF THE\nFOREGOING, LICENSOR DOES NOT WARRANT THAT THE BINARY SOFTWARE IS ERROR-FREE OR\nWILL OPERATE WITHOUT INTERRUPTION, AND LICENSOR GRANTS NO WARRANTY REGARDING ITS\nUSE OR THE RESULTS THEREFROM, INCLUDING ITS CORRECTNESS, ACCURACY, OR\nRELIABILITY.\n\nLimitation of Liability. IN NO EVENT WILL LICENSOR, OR ANY OF LICENSOR'S\nLICENSORS HAVE ANY LIABILITY HEREUNDER FOR ANY INDIRECT, SPECIAL, OR\nCONSEQUENTIAL DAMAGES, HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\nFOR BREACH OF CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, ARISING OUT\nOF THIS AGREEMENT, INCLUDING DAMAGES FOR LOSS OF PROFITS, OR THE COST OF\nPROCUREMENT OF SUBSTITUTE GOODS, EVEN IF SUCH PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES. LICENSOR'S TOTAL LIABILITY FOR ALL COSTS, DAMAGES,\nCLAIMS, OR LOSSES WHATSOEVER ARISING OUT OF OR IN CONNECTION WITH THIS AGREEMENT\nOR THE BINARY SOFTWARE SUPPLIED UNDER THIS AGREEMENT IS LIMITED TO THE AGGREGATE\nAMOUNT PAID BY LICENSEE TO LICENSOR IN CONNECTION WITH THE BINARY SOFTWARE TO\nWHICH LOSSES OR DAMAGES ARE CLAIMED.\n\nTrade Compliance.  Licensee shall comply with all applicable export and import\ncontrol laws and regulations including but not limited to the US Export\nAdministration Regulation (including prohibited party lists issued by other\nfederal governments), Catch-all regulations and all national and international\nembargoes. Licensee further agrees that it will not knowingly transfer, divert,\nexport or re-export, directly or indirectly, any product, software, including\nsoftware source code, or technology restricted by such regulations or by other\napplicable national regulations, received from Licensor under this Agreement,\nor any direct product of such software or technical data to any person, firm,\nentity, country or destination to which such transfer, diversion, export or\nre-export is restricted or prohibited, without obtaining prior written\nauthorization from the applicable competent government authorities to the extent\nrequired by those laws. Licensee acknowledge that the \"restricted encryption\nsoftware\" that is subject to the US Export Administration Regulations (EAR), is\nnot intended for use by a government end user, as defined in part 772 of the\nEAR. This provision shall survive termination or expiration of this Agreement.\n\nAssignment. Licensee may not assign this Agreement without the prior written\nconsent of Licensor. Licensor may assign this Agreement without Licensee's\nconsent.\n\nGoverning Law. This Agreement will be governed by, construed, and enforced in\naccordance with the laws of the State of Texas, USA, without regard to conflicts\nof laws principles, will apply to all matters relating to this Agreement or the\nBinary Software, and Licensee agrees that any litigation will be subject to the\nexclusive jurisdiction of the state or federal courts Texas, USA. The United\nNations Convention on Contracts for the International Sale of Goods will not\napply to this Agreement.\n\nRestrictions, Warranty Disclaimer, Limitation of Liability, Trade Compliance,\nAssignment, Governing Law, and Third Party Terms shall survive termination or\nexpiration of this Agreement.\n\nThird Party Terms. The licensed Binary Software includes the following third\nparty software for which the following terms apply:\n\nLibfdt - Flat Device Tree manipulation\nCopyright (c) 2006 David Gibson, IBM Corporation\nAll rights reserved.\n\nRedistributions must reproduce the above copyright notice, this list of\nconditions and the following disclaimer in the documentation and/or other\nmaterials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nLibElf\nCopyright (c) 2006,2008-2011 Joseph Koshy\nAll rights reserved.\n\nRedistributions must reproduce the above copyright notice, this list of\nconditions and the following disclaimer in the documentation and/or other\nmaterials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nANNEX A\nBINARY SOFTWARE\nOnly software in binary form may be provided under this Agreement"
}