{
  "key": "odb-ncuel",
  "short_name": "ODB NCUEL",
  "name": "ODB Non-Commercial Use and Evaluation License (NCUEL)",
  "category": "Copyleft",
  "owner": "Code Synthesis",
  "homepage_url": "https://www.codesynthesis.com/licenses/ncuel.txt",
  "spdx_license_key": "LicenseRef-scancode-odb-ncuel",
  "other_urls": [
    "https://www.codesynthesis.com/products/odb/license.xhtml"
  ],
  "ignorable_emails": [
    "info@codesynthesis.com"
  ],
  "text": "ODB NON-COMMERCIAL USE AND EVALUATION LICENSE (NCUEL)\n\nINTENT\n\nThe intent of this license is to allow you to use ODB with commercial\ndatabases, such as Oracle, Microsoft SQL Server, IBM DB/2, etc., free\nof charge non-commercially or for evaluation.\n\nFurthermore, if a commercial database has a free edition, often called\nexpress edition, such as Oracle Express, Microsoft SQL Server Express,\nIBM DB/2 Express-C, etc., that can be used for commercial purposes free\nof charge, then this license allows you to use ODB with such an edition\nfor commercial purposes also free of charge.\n\nNote also that the development of an application that will be used for\ncommercial purposes constitutes a commercial use and is not allowed,\nexcept with a free edition of a commercial database. However, this\nlicense allows you to evaluate ODB; that is, to use the Software for\na reasonable period for the purpose of determining its suitability for\na particular application as well as to conduct exploratory development\nor proof-of-concept prototyping.\n\nFinally, any application that uses ODB under this license, whether non-\ncommercially, for evaluation, or commercially with a free edition of a\ndatabase, is subject to the terms and conditions similar to that of the\nGPL version 2. In particular, this means that if and when you distribute\nyour application, you are required to also release its source code.\n\nIf you have any questions concerning this License, please contact us at:\ninfo@codesynthesis.com.\n\nLEGAL TERMS AND CONDITIONS\n\nThis Code Synthesis Tools CC Non-Commercial Use and Evaluation License\nAgreement for ODB Software (\"License\") is a legal agreement between you,\nthe Licensee, (either an individual or a single entity) and Code\nSynthesis Tools CC (\"Code Synthesis\") for non-commercially using,\ncopying, distributing and modifying the Software and any work derived\nfrom the Software, as defined hereinbelow. Any commercial use, except\nas expressly provided in Section 2.1, is subject to a different license.\n\nBy using, modifying, or distributing the Software or any work derived\nfrom the Software, Licensee indicates acceptance of this License and\nagrees to be bound by all its terms and conditions for using, copying,\ndistributing, or modifying the Software and works derived from the\nSoftware. If Licensee is agreeing to this License on behalf of an entity\nother than an individual person, Licensee represents that Licensee is\nbinding and have the right to bind the entity to the terms and conditions\nof this agreement.\n\nThese terms and conditions only apply to the ODB components that are\nexplicitly licensed under this License (normally ODB runtime libraries\nfor commercial databases). Other ODB components may be licensed under\nother licenses and are not affected in any way by the terms and\nconditions found in this License. Similarly, ODB components licensed\nunder this License are not affected by the terms and conditions found\nin other licenses. If you are using several ODB components that are\nlicensed under different licenses, you must comply with the terms and\nconditions of each such license.\n\nNo rights are granted to the Software except as expressly set forth\nherein. Nothing other than this License grants Licensee permission to\nuse, copy, distribute or modify the Software or any work derived from\nthe Software. Licensee may not use, copy, distribute or modify the\nSoftware or any work derived from the Software except as expressly\nprovided under this License. If Licensee does not accept the terms and\nconditions of this License, Licensee shall not use, copy, distribute\nor modify the Software.\n\nIn consideration for Licensee's forbearance of commercial use of the\nSoftware, except as expressly provided in Section 2.1, Code Synthesis\ngrants Licensee non-exclusive, royalty-free and without fees rights\nas expressly provided herein.\n\n1. DEFINITIONS.\n\nA \"commercial database\" is a database product that has associated\nfees and/or royalties payable for production and/or commercial use\nof the database product. Commercial databases include, but are not\nlimited to, Oracle, Microsoft SQL Server, and IBM DB/2.\n\nA \"free edition of a commercial database\" is a special, limited edition\nof a commercial database, often called express edition, that does not\nrequire fees and/or royalties for production and/or commercial use.\nFree editions of commercial databases include, but are not limited to,\nOracle Express, Microsoft SQL Server Express, and IBM DB/2 Express-C.\n\nThe \"Software\" is one of the ODB runtime libraries for one of the\ncommercial databases, including, but not limited to, demo programs,\nassociated media and printed materials, and any included \"on-line\"\ndocumentation.\n\nA \"work derived from the Software\" is any derivative work as defined\nin the copyright law of the nation or state where rights to the work\nderived from the Software are exercisable; that is to say, a program\nwhich is linked with or otherwise incorporates the ODB runtime library\nor a translation, improvement, enhancement, extension or other\nmodification of the Software which has sufficient originality to\nqualify in such a nation or state as a copyrightable work is a work\nderived from the Software.\n\nTo \"use\" means to execute (i.e. run) the Software.\n\nTo \"copy\" means to create one or more copies of the Software.\n\nTo \"distribute\" means to broadcast, publish, transfer, post, upload,\ndownload or otherwise disseminate in any medium to any third party.\n\nTo \"modify\" means to create a work derived from the Software.\n\nTo \"evaluate\" means to use the Software for a reasonable period for\nthe purpose of determining its suitability for a particular application\nas well as to conduct exploratory development or proof-of-concept\nprototyping.\n\nA \"commercial use\" is:\n\n(1) the use of the Software or any work derived from the Software in\nconnection with, for or in aid of the generation of revenue, such as\nin the conduct of Licensee's daily business operations; or\n\n(2) any copying, distribution or modification of the Software or any\nwork derived from the Software to any party where payment or other\nconsideration is made in connection with such copying, distribution or\nmodification, whether directly (as in payment for a copy of the\nSoftware) or indirectly (including but not limited to payment for some\ngood or service related to the Software, or payment for some product\nor service that includes a copy of the Software \"without charge\").\nHowever, the following actions which involve payment do not in and\nof themselves constitute a commercial use:\n\n(a) posting the Software on a public access information storage and\nretrieval service for which a fee is received for retrieving\ninformation (such as an on-line service), provided that the fee is not\ncontent-dependent. Such fees which are not content dependent include,\nbut are not limited to, fees which are based solely on the storage\ncapacity required to store the information, and fees which are based\nsolely on the time required to transfer the information from/to the\npublic access information storage and retrieval service; and\n\n(b) distributing the Software on a CD-ROM, provided that the Software\nis reproduced entirely and verbatim on such CD-ROM, and provided further\nthat all information on such CD-ROM may be distributed in a manner which\ndoes not constitute a commercial use.\n\n2. GRANT OF LICENSE.\n\n2.1. LICENSE TO USE.\nLicensee may use the Software provided that such use does not constitute\na commercial use.\n\nLicensee may also use the Software commercially with a free edition of a\ncommercial database, if such an edition is available. If Licensee\ndistributes works derived from the Software and such works may be used\ncommercially by third parties, Licensee must cause such commercial use\nto be limited to a free edition of a commercial database.\n\n2.2. LICENSE TO EVALUATE.\nLicensee may evaluation the Software for commercial use.\n\n2.3. LICENSE TO COPY AND DISTRIBUTE.\nLicensee may copy and distribute literal (i.e., verbatim) copies of the\nSoftware as Licensee receives it throughout the world, in any medium,\nprovided that Licensee distributes an unmodified, easily-readable copy\nof this License with the Software, and provided further that such\ndistribution does not constitute a commercial use.\n\n2.4. LICENSE TO CREATE WORKS DERIVED FROM THE SOFTWARE.\nLicensee may create works derived from the Software, provided that any\nsuch work derived from the Software carries prominent notices stating\nboth the manner in which Licensee has created a work derived from the\nSoftware (for example, notices stating that the work derived from the\nSoftware is linked with or otherwise incorporates the ODB runtime\nlibrary, or notices stating that the work derived from the Software\nis an enhancement to the Software which Licensee has created) and the\ndate any such work derived from the Software was created.\n\n2.5. LICENSE TO COPY AND DISTRIBUTE WORKS DERIVED FROM THE SOFTWARE.\nLicensee may copy and distribute works derived from the Software\nthroughout the world, provided that Licensee distributes an\nunmodified, easily-readable copy of this License with such works\nderived from the Software, and provided further that such distribution\ndoes not constitute a commercial use. Licensee must cause any work\nderived from the Software that Licensee distributes to be licensed as\na whole and at no charge to all third parties under the terms of this\nLicense or another free/open source license that does not restrict any\nrights of any third party that would have been granted should such work\nhave been licensed under this License.\n\nAny work derived from the Software must be accompanied by the complete\ncorresponding machine-readable source code of such work derived from\nthe Software, delivered on a medium customarily used for software\ninterchange. The source code for the work derived from the Software\nmeans the preferred form of the work derived from the Software for\nmaking modifications to it. For an executable work derived from the\nSoftware, complete source code means all of the source code for all\nmodules of the work derived from the Software, all associated\ninterface definition files and all scripts used to control compilation\nand installation of all or any part of the work derived from the\nSoftware. However, the source code delivered need not include anything\nthat is normally distributed, in either source code or binary (object-\ncode) form, with major components (including but not limited to\ncompilers, linkers, and kernels) of the operating system on which the\nexecutable work derived from the Software runs, unless that component\nitself accompanies the executable code of the work derived from the\nSoftware.\n\nFurthermore, if the executable code or object code of the work derived\nfrom the Software may be copied from a designated place, and if the\nsource code of the work derived from the Software may be copied from\nthe same place, then the work derived from the Software shall be\nconstrued as accompanied by the complete corresponding machine-readable\nsource code of such work derived from the Software, even though third\nparties are not compelled to copy the source code along with the\nexecutable code or object code.\n\nIf the work derived from the Software normally reads commands\ninteractively when run, Licensee must cause the work derived from the\nSoftware, at each time it commences operation, to print or display an\nannouncement including either a notice consisting of the verbatim\nwarranty and liability provisions of this License, or a notice that\nLicensee, and not Code Synthesis provides a warranty.\n\nLicensee may not impose any further restrictions on the exercise of\nthe rights granted herein by any recipient of any work derived from\nthe Software.\n\n3. RESTRICTIONS.\n\nLicensee acknowledges that the Software is protected by copyright laws\nand international copyright treaties, as well as other intellectual\nproperty laws and treaties. The Software is licensed, not sold. All\ntitle and copyrights in and to the Software are owned exclusively by\nCode Synthesis.\n\nLicensee may not sublicense, assign or transfer this License, the\nSoftware or any work derived from the Software except as permitted by\nthis License.\n\nLicensee is expressly prohibited from using, copying, distributing,\nstudying the source code, or otherwise examining the Software for\nthe purpose of reverse engineering or duplicating its functionality\n(unless enforcement of this restrictions is prohibited by applicable\nlaw).\n\n4. LIMITED WARRANTY.\n\n4.1 NO WARRANTIES.\nCODE SYNTHESIS EXPRESSLY DISCLAIMS ANY WARRANTY FOR THE SOFTWARE. THE\nSOFTWARE IS PROVIDED TO LICENSEE \"AS IS,\" WITHOUT WARRANTY OF ANY KIND,\nEITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT OF THIRD PARTY RIGHTS. THE ENTIRE RISK AS TO THE USE,\nQUALITY AND PERFORMANCE OF THE SOFTWARE IS WITH LICENSEE. SHOULD THE\nSOFTWARE PROVE DEFECTIVE, LICENSEE ASSUMES THE COST OF ALL NECESSARY\nSERVICING, REPAIR OR CORRECTION.\n\n4.2. NO LIABILITY FOR DAMAGES.\nIN NO EVENT WILL CODE SYNTHESIS, OR ANY OTHER PARTY WHO MAY COPY,\nDISTRIBUTE OR MODIFY THE SOFTWARE AS PERMITTED HEREIN, BE LIABLE FOR\nANY GENERAL, DIRECT, INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL\nDAMAGES WHATSOEVER (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF\nBUSINESS PROFITS, BUSINESS INTERRUPTION, INACCURATE INFORMATION, LOSS\nOF INFORMATION, OR ANY OTHER PECUNIARY LOSS) ARISING OUT OF THE USE OR\nINABILITY TO USE THE SOFTWARE, EVEN IF CODE SYNTHESIS OR SUCH OTHER\nPARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n5. TERMINATION.\n\nAny violation or any attempt to violate any of the terms and conditions\nof this License will automatically terminate Licensee's rights under\nthis License. Licensee further agrees upon such termination to cease\nany and all using, copying, distributing and modifying of the Software\nand any work derived from the Software, and further to destroy any and\nall of Licensee's copies of the Software and any work derived from the\nSoftware.\n\nHowever, parties who have received copies of the Software or copies of\nany work derived from the Software, or rights, from Licensee under this\nLicense will not have their licenses terminated so long as such parties\nremain in full compliance with this License.\n\n6. LICENSE SCOPE AND MODIFICATION.\n\nThis License sets forth the entire agreement between Licensee and Code\nSynthesis and supersedes all prior agreements and understandings between\nthe parties relating to the subject matter hereof. None of the terms of\nthis License may be waived or modified except as expressly agreed in\nwriting by both Licensee and Code Synthesis.\n\n7. SEVERABILITY.\n\nShould any provision of this License be declared void or unenforceable,\nthe validity of the remaining provisions shall not be affected thereby."
}