{
  "key": "ofrak-community-1.1",
  "short_name": "OFRAK Community License Agreement 1.1",
  "name": "OFRAK Community License Agreement 1.1",
  "category": "Proprietary Free",
  "owner": "Red Balloon Security",
  "homepage_url": "https://github.com/redballoonsecurity/ofrak/blob/master/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-ofrak-community-1.1",
  "faq_url": "https://ofrak.com/license/",
  "ignorable_authors": [
    "Red Balloon"
  ],
  "ignorable_urls": [
    "https://github.com/red-balloon-security/ofrak",
    "https://ofrak.com/docs/license.html"
  ],
  "text": "OFRAK COMMUNITY LICENSE AGREEMENT\nVersion 1.1\nEffective: July 22, 2024\n\nRED BALLOON SECURITY, INC., A DELAWARE CORPORATION, WITH AN ADDRESS AT 639 11TH\nAVENUE, 4TH FLOOR, NEW YORK, NY 10036, USA (\"RED BALLOON\") LICENSES OFRAK AND\nRELATED DOCUMENTATION PURSUANT TO THE OFRAK COMMUNITY LICENSE AGREEMENT\n(COLLECTIVELY WITH THE REGISTRATION FORM, THIS \"AGREEMENT\"). READ THIS\nAGREEMENT CAREFULLY BEFORE ACCESSING, INSTALLING, COPYING AND USING OFRAK UNDER\nTHE OFRAK COMMUNITY AGREEMENT. BY TYPING \"I AGREE\" ON THE REGISTRATION FORM, OR\nOTHERWISE ACCESSING, INSTALLING, COPYING OR OTHERWISE USING OFRAK, YOU\n(\"LICENSEE\") AGREE THAT THE REGISTRATION FORM SHALL BE DEEMED TO BE MUTUALLY\nEXECUTED AND THE REGISTRATION FORM SHALL BE INCORPORATED INTO AND BECOME A\nMATERIAL PART OF THE OFRAK COMMUNITY LICENSE AGREEMENT BETWEEN LICENSEE AND RED\nBALLOON LOCATED AT https://ofrak.com/docs/license.html. YOU REPRESENT THAT YOU\nARE AUTHORIZED TO ACCEPT THIS AGREEMENT ON BEHALF OF LICENSEE. IF LICENSEE DOES\nNOT AGREE TO THE FOREGOING TERMS AND CONDITIONS, DO NOT TYPE \"I AGREE\", OR\nOTHERWISE ACCESS, INSTALL, COPY OR USE OFRAK.\n\n1.\tDefinitions.\n\n1.1\t\"OFRAK\" consists of (a) the source code repository for OFRAK, which can\nbe found at https://github.com/red-balloon-security/ofrak; (b) the following\nPython packages, which are also available via PyPI, the Python Package Index:\nofrak, ofrak_components, ofrak_io, ofrak_type, ofrak_patch_maker, ofrak_angr,\nofrak_binary_ninja, ofrak_ghidra; (c) the OFRAK graphical user interface (GUI);\nand (d) OFRAK documentation. OFRAK includes all updates, improvements, APIs and\nadd-ons provided by Red Balloon with respect thereto that Red Balloon makes\navailable to Licensee under this OFRAK Pro Agreement.  OFRAK is presently made\navailable in three formats:  (i) source code repository, (ii) PyPI Packages and\n(iii) Docker images with dependencies preinstalled.\n\n1.2\t\"Academic Purposes\" means use within a non-profit academic institution\nby its then-current faculty and students for the purposes of non-profit\nscholarly research, classroom and education, and not any other use (including\nwithout limitation, directly or indirectly in connection with any commercial\nactivity such as, for example, sponsored research or consulting services).\nShared Use of OFRAK for an Academic Purpose is permitted only when (a) used for\neducational purposes, (b) access is restricted and not provided to the general\npublic, (c) access is limited to employees and/or students of the same\ninstitution involved in a specific educational activity, and (d) all users\naccept and are subject to this Agreement.\n\n1.3\t\"Non-Commercial Use\" means personal research, evaluation, or\ndevelopment use by an individual, and not use by or on behalf of any commercial\nentity or organization or directly or indirectly in connection with any\ncommercial activity.  For clarity, you cannot make money off of redistributing\nOFRAK code (including Derivatives), OFRAK analysis, OFRAK-modified binaries, or\nother OFRAK outputs.  Non-Commercial Use also excludes any Shared Use.\n\n1.4\t\"Commercial Use\" means any use other than Academic Purposes or\nNon-Commercial Use, including, without limitation, use for any commercial\npurpose or by any commercial entity, including without limitation\nredistributing the OFRAK code (including Derivatives), OFRAK analysis,\nOFRAK-modified binaries, or other OFRAK outputs for any monetary or other\ncommercial consideration.\n\n1.5\t\"Derivatives\" means any modifications, additions, enhancements, or\nderivative works of OFRAK or any component thereof.  For purposes of this\nAgreement, Derivatives shall not include works that remain separable from, or\nmerely link to, the interfaces of OFRAK or any Derivatives.\n\n1.6\t\"Shared Use\" means  any use of OFRAK where the person who set up a\nparticular instance of OFRAK is not the same person interacting with that\ninstance of OFRAK, or where a single instance of OFRAK is used by more than one\nperson (whether on the same or different occasions). This includes, but is not\nlimited to, the use of OFRAK on a server that is accessible by more than one\nperson, or by any person other than the person who set up the use of OFRAK on\nthe said server.\n\n2.\tLicense.  Subject to the terms and conditions of this Agreement, Red\nBalloon grants to you a nonexclusive, nonsublicensable, nontransferable,\nno-charge, royalty-free, limited license to install, use, copy, modify, create\nderivative works of OFRAK only for (a) Academic Purposes and (b) Non-Commercial\nUse and to share Derivatives (i) publicly within the community (via publicly\navailable forks on GitHub.com), (ii) for Shared Use for an Academic Purpose,\nand (iii) with Red Balloon, for the purposes stated in this Agreement.  For\nclarity, the foregoing license does not grant to you any right or license to\ncommercialize, distribute or use OFRAK, Derivatives, OFRAK code, OFRAK\nanalysis, OFRAK-modified binaries, or other OFRAK outputs for any other purpose\nwhatsoever, including Commercial Use, other than Academic Purposes or\nNon-Commercial Use. In the event that you wish to use OFRAK for any other\npurpose, including Commercial Use, you need to contact Red Balloon and enter\ninto a separate OFRAK Pro License, OFRAK Enterprise License or other custom\nagreement. Except for the limited rights and licenses expressly granted\nhereunder, no other license is granted, no other use is permitted.\n\n3.\tDerivatives.  To the extent that you prepare or create any Derivatives,\nyou shall and hereby grant to (a) all users of OFRAK a right and license to\nsuch Derivatives upon the terms and conditions set forth in this Agreement and\n(b) Red Balloon a perpetual, fully paid-up, royalty-free, worldwide and\nirrevocable, right and license to use, copy, modify, enhance, prepare\nderivative works of, distribute, with unlimited right to sublicense, make, have\nmade, sell, have sold, import, export and otherwise commercialize such\nDerivatives.  You acknowledge that Red Balloon may, but is not obligated to,\ninclude your Derivatives in, and otherwise incorporate your Derivatives into,\nthe core OFRAK codebase.  In the event that you create Derivatives, you must\n(i) retain all copyright and other proprietary rights licenses included in the\noriginal OFRAK code, and any other Derivatives, and (ii) make it clear that you\nmodified the original version of OFRAK.  Red Balloon encourages you to make\nyour Derivatives available to the community by forking the OFRAK source code\nrepository on GitHub and publishing your Derivatives on your forked repository,\nbut you are not required to do so.  You represent and warrant that you have\nsufficient rights to any Derivatives and are legally entitled to grant the\nabove rights and licenses. If you are an individual and your\nemployer(s)/institution(s) have rights to intellectual property that you create\nthat includes your Derivatives, you represent that you have received permission\nto make and contribute Derivatives on behalf of that employer/institution.\n\n4.\tOwnership; Restrictions.  Except as expressly and unambiguously set\nforth herein, Red Balloon and its licensors and contributors retain all right,\ntitle and interest in and to OFRAK, Derivatives prepared or created by Red\nBalloon, all copies, modifications and derivative works thereof, including\nwithout limitation, all rights to patent, copyright, trade secret and other\nproprietary or intellectual property rights related to any of the foregoing.\nTo the extent that Licensee creates any Derivatives, subject to the rights and\nlicenses granted herein, Licensee retains ownership of all right, title and\ninterest in and to such Derivatives prepared or created by Licensee, including\nwithout limitation, all intellectual property rights related to any of the\nforegoing.  Licensee will maintain the copyright notice and any other notices\nor identifications that appear on or in OFRAK and any Derivatives or any other\nmedia or documentation that is subject to this OFRAK Pro Agreement.  Licensee\nwill not (and will not allow any third party to):  (a) use OFRAK or any\nDerivatives, except as expressly permitted in this OFRAK Pro Agreement, (b)\nprovide, lease, lend, disclose, use for timesharing or service bureau purposes,\nor otherwise use or allow others to use for the benefit of any third party,\nOFRAK, (c) possess or use OFRAK, or allow the transfer, transmission, export,\nor re-export of OFRAK or portion thereof in violation of any export control\nlaws or regulations administered by the U.S. Commerce Department, U.S. Treasury\nDepartment’s Office of Foreign Assets Control, or any other government agency,\n(d) use OFRAK in any way that violates any applicable law, rule or regulation\nor for any illegal use or activity, or (e) seek any patent or other\nintellectual property rights or protections over or in connection with OFRAK or\nany Derivatives that Licensee prepares or creates.\n\n5.\tFeedback.  In addition to Derivatives, you may, from time to time and\nin your sole discretion, make suggestions for changes, modifications or\nimprovements to OFRAK (\"Feedback\").  Red Balloon shall have an irrevocable,\nperpetual, worldwide, sublicenseable, transferable, full paid-up, royalty free\nright and license to use, distribute and otherwise exploit all Feedback for any\npurpose.\n\n6.\tNo Cost License.  OFRAK and any Derivatives provided pursuant to this\nAgreement shall be provided during the Term at no charge to you.  7.\nServices.  No training or support services are provided under this Agreement.\nRed Balloon may in its discretion respond to support inquiries through Red\nBalloon’s support channels, such as Slack.\n\n8.\tTerm and Termination.  This Agreement shall commence upon the initial\ndownload of OFRAK and shall continue until and unless terminated as set forth\nherein (the \"Term\").  This Agreement may be terminated by Red Balloon\nimmediately upon notice to you in the event that you breach any term or\ncondition of this Agreement. Upon any termination, you shall immediately cease\nall use of OFRAK.  This sentence and the following provisions will survive\ntermination: 1, 3 - 5 and 9 - 12.  Termination is not an exclusive remedy and\nall other remedies will remain available.\n\n9.\tWarranty Disclaimer.  The parties acknowledge that OFRAK is provided\n\"AS IS\" and may not be functional on any machine or in any environment.\nNEITHER RED BALLOON NOR ANY CONTRIBUTOR OF ANY DERIVATIVES MAKE ANY WARRANTIES,\nEXPRESS OR IMPLIED, EITHER IN FACT OR BY OPERATION OF LAW, STATUTORY OR\nOTHERWISE, AND RED BALLOON AND ANY CONTRIBUTOR OF ANY DERIVATIVES EXPRESSLY\nEXCLUDES AND DISCLAIMS ANY WARRANTY OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE, TITLE, ACCURACY, FREEDOM FROM ERRORS, FREEDOM FROM\nPROGRAMMING DEFECTS, NONINTERFERENCE AND NONINFRINGEMENT, AND ALL IMPLIED\nWARRANTIES ARISING OUT OF COURSE OF DEALING, COURSE OF PERFORMANCE AND USAGE OF\nTRADE.  THIS AGREEMENT IS NOT INTENDED FOR USE OF OFRAK IN HAZARDOUS\nENVIRONMENTS REQUIRING FAIL-SAFE PERFORMANCE WHERE THE FAILURE OF OFRAK COULD\nLEAD DIRECTLY TO DEATH, PERSONAL INJURY, OR SIGNIFICANT PHYSICAL OR\nENVIRONMENTAL DAMAGE (\"HIGH RISK ACTIVITIES\").  USE OF OFRAK IN HIGH RISK\nACTIVITIES IS NOT AUTHORIZED PURSUANT TO THIS AGREEMENT.  THE PARTIES AGREE\nTHAT THIS SECTION 9 REPRESENTS A REASONABLE ALLOCATION OF RISK AND THAT RED\nBALLOON WOULD NOT PROCEED IN THE ABSENCE OF SUCH ALLOCATION.\n\n10.\tLimitations.  NEITHER RED BALLOON NOR ANY CONTRIBUTOR OF DERIVATIVES\nSHALL BE RESPONSIBLE OR LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THIS\nAGREEMENT OR TERMS AND CONDITIONS RELATED THERETO UNDER ANY CONTRACT,\nNEGLIGENCE, STRICT LIABILITY OR OTHER THEORY (A) FOR LOSS OR INACCURACY OF\nDATA, OR COST OF PROCUREMENT OF SUBSTITUTE GOODS, SERVICES OR TECHNOLOGY; (B)\nFOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, RELIANCE, SPECIAL, EXEMPLARY OR\nCONSEQUENTIAL DAMAGES INCLUDING, BUT NOT LIMITED TO, LOSS OF REVENUES AND LOSS\nOF PROFITS TO LICENSEE OR ANY THIRD PARTIES; (C) FOR ANY MATTER BEYOND ITS\nREASONABLE CONTROL OR (D) FOR USE YOU OR OTHERS MAY MAKE OF OFRAK, EVEN IF\nADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n11.\tIndemnification.  You agree that (a) Red Balloon and any contributors\nshall have no liability whatsoever for your use of OFRAK or any Derivatives and\n(b) you shall indemnify, and hold harmless, and (upon request) defend Red\nBalloon and any other user or contributor from and against any and all claims,\ndamages, liabilities, losses, and costs (including reasonable attorneys’ fees)\nsuffered or incurred by such party which arise from or relate to your (i) use\nof OFRAK or Derivatives, or (ii) breach of this Agreement.\n\n12.\tMiscellaneous.  Neither this Agreement nor the licenses granted\nhereunder are assignable or transferable by you; any attempt to do so shall be\nvoid.  Red Balloon may assign this Agreement in whole or in part.  Any notice,\nreport, approval or consent required or permitted hereunder shall be in\nwriting.  The provisions hereof are for the benefit of the parties only and not\nfor any other person or entity. If any provision of this Agreement shall be\nadjudged by any court of competent jurisdiction to be unenforceable or invalid,\nthat provision shall be limited or eliminated to the minimum extent necessary\nso that this Agreement shall otherwise remain in full force and effect and\nenforceable.  This Agreement shall be deemed to have been made in, and shall be\nconstrued pursuant to the laws of the State of New York, without regard to\nconflicts of laws provisions thereof, and without regard to the United Nations\nConvention on the International Sale of Goods or the Uniform Computer\nInformation Transactions Act. Any waivers or amendments shall be effective only\nif made in writing.  This Agreement is the complete and exclusive statement of\nthe mutual understanding of the parties and supersedes and cancels all previous\nwritten and oral agreements and communications relating to the subject matter\nof this Agreement."
}