{
  "key": "ogc-2006",
  "is_deprecated": true,
  "replaced_by": [
    "ogc-1.0"
  ],
  "short_name": "OGC Software Notice 2006",
  "name": "OGC Software Notice 2006",
  "category": "Permissive",
  "owner": "Open Geospatial Consortium",
  "homepage_url": "https://www.ogc.org/ogc/software",
  "notes": "duplicate of ogc-1.0",
  "other_urls": [
    "http://www.opengeospatial.org/ogc/legal"
  ],
  "ignorable_copyrights": [
    "Copyright (c) Open Geospatial Consortium, Inc."
  ],
  "ignorable_holders": [
    "Open Geospatial Consortium, Inc."
  ],
  "ignorable_urls": [
    "http://www.opengeospatial.org/ogc/legal"
  ],
  "text": "This OGC work (including software, documents, or other related items) is being\nprovided by the copyright holders under the following license. By obtaining,\nusing and/or copying this work, you (the licensee) agree that you have read,\nunderstood, and will comply with the following terms and conditions:\n\nPermission to use, copy, and modify this software and its documentation, with or\nwithout modification, for any purpose and without fee or royalty is hereby\ngranted, provided that you include the following on ALL copies of the software\nand documentation or portions thereof, including modifications, that you make:\n\n1. The full text of this NOTICE in a location viewable to users of the\nredistributed or derivative work.\n\n2. Any pre-existing intellectual property disclaimers, notices, or terms and\nconditions. If none exist, a short notice of the following form (hypertext is\npreferred, text is permitted) should be used within the body of any\nredistributed or derivative code: \"Copyright © [$date-of-document] Open\nGeospatial Consortium, Inc. All Rights Reserved.\nhttp://www.opengeospatial.org/ogc/legal (Hypertext is preferred, but a textual\nrepresentation is permitted.)\n\n3. Notice of any changes or modifications to the OGC files, including the date\nchanges were made. (We recommend you provide URIs to the location from which the\ncode is derived.)\n\nTHIS SOFTWARE AND DOCUMENTATION IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE\nNO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED\nTO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT\nTHE USE OF THE SOFTWARE OR DOCUMENTATION WILL NOT INFRINGE ANY THIRD PARTY\nPATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SOFTWARE OR DOCUMENTATION.\n\nThe name and trademarks of copyright holders may NOT be used in advertising or\npublicity pertaining to the software without specific, written prior permission.\nTitle to copyright in this software and any associated documentation will at all\ntimes remain with copyright holders."
}