{
  "key": "ogl-1.0a",
  "short_name": "OGL 1.0a",
  "name": "Open Game License v1.0a",
  "category": "Permissive",
  "owner": "Anthony Ronda",
  "homepage_url": "https://raw.githubusercontent.com/anthonyronda/LicenseRef-OGL-1.0a/main/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-ogl-1.0a",
  "other_urls": [
    "https://github.com/anthonyronda/awesome-ogl"
  ],
  "ignorable_copyrights": [
    "Copyright 2000 Wizards of the Coast, Inc 'Wizards",
    "Copyright 2000, Wizards of the Coast, Inc."
  ],
  "ignorable_holders": [
    "Wizards of the Coast, Inc 'Wizards",
    "Wizards of the Coast, Inc."
  ],
  "text": "OPEN GAME LICENSE Version 1.0a\n\nThe following text is the property of Wizards of the Coast, Inc. and is\nCopyright 2000 Wizards of the Coast, Inc (\"Wizards\"). All Rights Reserved.\n\n1. Definitions: (a) \"Contributors\" means the copyright and/or trademark owners\nwho have contributed Open Game Content; (b) \"Derivative Material\" means\ncopyrighted material including derivative works and translations (including into\nother computer languages), potation, modification, correction, addition,\nextension, upgrade, improvement, compilation, abridgment or other form in which\nan existing work may be recast, transformed or adapted; (c) \"Distribute\" means\nto reproduce, license, rent, lease, sell, broadcast, publicly display, transmit\nor otherwise distribute; (d) \"Open Game Content\" means the game mechanic and\nincludes the methods, procedures, processes and routines to the extent such\ncontent does not embody the Product Identity and is an enhancement over the\nprior art and any additional content clearly identified as Open Game Content by\nthe Contributor, and means any work covered by this License, including\ntranslations and derivative works under copyright law, but specifically excludes\nProduct Identity; (e) \"Product Identity\" means product and product line names,\nlogos and identifying marks including trade dress; artifacts; creatures;\ncharacters; stories, storylines, plots, thematic elements, dialogue, incidents,\nlanguage, artwork, symbols, designs, depictions, likenesses, formats, poses,\nconcepts, themes and graphic, photographic and other visual or audio\nrepresentations; names and descriptions of characters, spells, enchantments,\npersonalities, teams, personas, likenesses and special abilities; places,\nlocations, environments, creatures, equipment, magical or supernatural abilities\nor effects, logos, symbols, or graphic designs; and any other trademark or\nregistered trademark clearly identified as Product Identity by the owner of the\nProduct Identity, and which specifically excludes the Open Game Content; (f)\n\"Trademark\" means the logos, names, mark, sign, motto, designs that are used by\na Contributor to identify itself or its products or the associated products\ncontributed to the Open Game License by the Contributor; (g) \"Use\", \"Used\" or\n\"Using\" means to use, Distribute, copy, edit, format, modify, translate and\notherwise create Derivative Material of Open Game Content; (h) \"You\" or \"Your\"\nmeans the licensee in terms of this agreement.\n\n2. The License: This License applies to any Open Game Content that contains a\nnotice indicating that the Open Game Content may only be Used under and in terms\nof this License. You must affix such a notice to any Open Game Content that You\nUse. No terms may be added to or subtracted from this License except as\ndescribed by the License itself. No other terms or conditions may be applied to\nany Open Game Content Distributed using this License.\n\n3. Offer and Acceptance: By Using the Open Game Content You indicate Your\nacceptance of the terms of this License.\n\n4. Grant and Consideration: In consideration for agreeing to use this License,\nthe Contributors grant You a perpetual, worldwide, royalty-free, non-exclusive\nlicense with the exact terms of this License to Use, the Open Game Content.\n\n5. Representation of Authority to Contribute: If You are contributing original\nmaterial as Open Game Content, You represent that Your contributions are Your\noriginal creation and/or You have sufficient rights to grant the rights conveyed\nby this License.\n\n6. Notice of License Copyright: You must update the COPYRIGHT NOTICE portion of\nthis License to include the exact text of the COPYRIGHT NOTICE of any Open Game\nContent You are copying, modifying or Distributing, and You must add the title,\nthe copyright date, and the copyright holder's name to the COPYRIGHT NOTICE of\nany original Open Game Content You Distribute.\n\n7. Use of Product Identity: You agree not to Use any Product Identity, including\nas an indication as to compatibility, except as expressly licensed in another,\nindependent agreement with the owner of each element of that Product Identity.\nYou agree not to indicate compatibility or co-adaptability with any Trademark or\nregistered Trademark in conjunction with a work containing Open Game Content\nexcept as expressly licensed in another, independent agreement with the owner of\nsuch Trademark or registered Trademark. The Use of any Product Identity in Open\nGame Content does not constitute a challenge to the ownership of that Product\nIdentity. The owner of any Product Identity Used in Open Game Content shall\nretain all rights, title and interest in and to that Product Identity.\n\n8. Identification: If You Distribute Open Game Content You must clearly indicate\nwhich portions of the work that You are Distributing are Open Game Content.\n\n9. Updating the License: Wizards or its designated Agents may publish updated\nversions of this License. You may use any authorized version of this License to\ncopy, modify and Distribute any Open Game Content originally Distributed under\nany version of this License.\n\n10. Copy of this License: You MUST include a copy of this License with every\ncopy of the Open Game Content You Distribute.\n\n11. Use of Contributor Credits: You may not market or advertise the Open Game\nContent using the name of any Contributor unless You have written permission\nfrom the Contributor to do so.\n\n12. Inability to Comply: If it is impossible for You to comply with any of the\nterms of this License with respect to some or all of the Open Game Content due\nto statute, judicial order, or governmental regulation then You may not Use any\nOpen Game Material so affected.\n\n13. Termination: This License will terminate automatically if You fail to comply\nwith all terms herein and fail to cure such breach within 30 days of becoming\naware of the breach. All sublicenses shall survive the termination of this\nLicense.\n\n14. Reformation: If any provision of this License is held to be unenforceable,\nsuch provision shall be reformed only to the extent necessary to make it\nenforceable.\n\n15. COPYRIGHT NOTICE\nOpen Game License v 1.0a Copyright 2000, Wizards of the Coast, Inc."
}