{
  "key": "okl",
  "short_name": "OKL license",
  "name": "OKL license",
  "category": "Copyleft",
  "owner": "General Dynamics",
  "homepage_url": "https://gdmissionsystems.com/cyber/products/trusted-computing-cross-domain/microvisor-products/",
  "spdx_license_key": "LicenseRef-scancode-okl",
  "minimum_coverage": 80,
  "text": "1. Redistribution and use of (Software) in source and binary\nforms, with or without modification, are permitted provided that the\nfollowing conditions are met:\n\n    (a) Redistributions of source code must retain this clause 1\n        (including paragraphs (a), (b) and (c)), clause 2 and clause 3\n        (Licence Terms) and the above copyright notice.\n\n    (b) Redistributions in binary form must reproduce the above\n        copyright notice and the Licence Terms in the documentation and/or\n        other materials provided with the distribution.\n\n    (c) Redistributions in any form must be accompanied by information on\n        how to obtain complete source code for:\n       (i) the Software; and\n       (ii) all accompanying software that uses (or is intended to\n       use) the Software whether directly or indirectly.  Such source\n       code must:\n       (iii) either be included in the distribution or be available\n       for no more than the cost of distribution plus a nominal fee;\n       and\n       (iv) be licensed by each relevant holder of copyright under\n       either the Licence Terms (with an appropriate copyright notice)\n       or the terms of a licence which is approved by the Open Source\n       Initative.  For an executable file, \"complete source code\"\n       means the source code for all modules it contains and includes\n       associated build and other files reasonably required to produce\n       the executable.\n\n2. THIS SOFTWARE IS PROVIDED ``AS IS'' AND, TO THE EXTENT PERMITTED BY\nLAW, ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\nPURPOSE, OR NON-INFRINGEMENT, ARE DISCLAIMED.  WHERE ANY WARRANTY IS\nIMPLIED AND IS PREVENTED BY LAW FROM BEING DISCLAIMED THEN TO THE\nEXTENT PERMISSIBLE BY LAW: (A) THE WARRANTY IS READ DOWN IN FAVOUR OF\nTHE COPYRIGHT HOLDER (AND, IN THE CASE OF A PARTICIPANT, THAT\nPARTICIPANT) AND (B) ANY LIMITATIONS PERMITTED BY LAW (INCLUDING AS TO\nTHE EXTENT OF THE WARRANTY AND THE REMEDIES AVAILABLE IN THE EVENT OF\nBREACH) ARE DEEMED PART OF THIS LICENCE IN A FORM MOST FAVOURABLE TO\nTHE COPYRIGHT HOLDER (AND, IN THE CASE OF A PARTICIPANT, THAT\nPARTICIPANT). IN THE LICENCE TERMS, \"PARTICIPANT\" INCLUDES EVERY\nPERSON WHO HAS CONTRIBUTED TO THE SOFTWARE OR WHO HAS BEEN INVOLVED IN\nTHE DISTRIBUTION OR DISSEMINATION OF THE SOFTWARE.\n\n3. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR ANY OTHER PARTICIPANT BE\nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE\nOR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN\nIF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}