{
  "key": "oll-1.0",
  "short_name": "OLL-1.0",
  "name": "Open Logistics License Version 1.0",
  "category": "Permissive",
  "owner": "Open Logistics Foundation",
  "homepage_url": "https://www.openlogisticsfoundation.org/licenses/",
  "spdx_license_key": "LicenseRef-scancode-oll-1.0",
  "ignorable_urls": [
    "https://www.openlogisticsfoundation.org/licenses/"
  ],
  "text": "Open Logistics License\nVersion 1.0, March 2022\nhttps://www.openlogisticsfoundation.org/licenses/\n\nTERMS AND CONDITIONS FOR THE USE, REPRODUCTION AND DISTRIBUTION\n\nß1 Definitions\n\n(1) \"Subject Matter of the License\" means the copyrighted works of the software\ncomponents in source code or object code as well as the other components\nprotected under copyright, design and/or patent law which are made available\nunder this license in accordance with a copyright notice inserted into or\nattached to the work as well as the application and user documentation.\n\n(2) \"License\" means the terms and conditions for the use, reproduction and\ndistribution of the Subject Matter of the License in accordance with the\nprovisions of this document.\n\n(3) \"Licensor(s)\" means the copyright holder(s) or the entity authorised by law\nor contract by the copyright holder(s) to grant the license.\n\n(4) \"You\" (or \"Your\") means a natural or legal person exercising the\npermissions granted by this License.\n\n(5) \"Source Code\" means the version of the code of the software components of\nthe Subject Matter of the License in the programming language.\n\n(6) \"Object Code\" means the interim product after compilation or interpretation\nof the Source Code.\n\n(7) \"Derivative Works\" shall mean any work, whether in Source or Object Code or\nany other form, that is based on (or derived from) the Subject Matter of the\nLicense and for which the editorial revisions, annotations, elaborations, or\nother modifications represent, as a whole, an original work of authorship. For\nthe purposes of this License, Derivative Works shall not include works that\nremain separable from, or merely link (or bind by name) to the interfaces of,\nthe Subject Matter of the License and Derivative Works thereof.\n\n(8) \"Contribution\" means any proprietary work, including the original version\nof the Subject Matter of the License and any changes or additions to such work,\nor Derivative Works of such work, that the copyright holder, or a natural or\nlegal person authorised to make submissions, intentionally submits to the\nLicensor or one of the Licensors to be incorporated into the Subject Matter of\nthe License.  For the purposes of this definition, \"submit\" means any form of\nelectronic or written communication which is sent to the Licensor (or one of\nthe Licensors) or its representatives to discuss or improve the Subject Matter\nof the License, including, but not limited to, communications sent via\nelectronic mailing lists, source code control systems and issue tracking\nsystems; however, communications that are clearly labelled as \"no contribution\"\nby the copyright holder or otherwise identified as such in writing are\nexcluded.\n\n(9) \"Contributor\" means the Licensor and/or any natural or legal person on\nwhose behalf the Licensor receives any Contribution subsequently incorporated\ninto the Subject Matter of the License.\n\nß2 Granting of usage rights\n\nSubject to the terms and conditions of this License and compliance with the\nprovisions of this License, You are hereby granted by all Contributors, for the\nterm of the copyrights in the Subject Matter of the License, the\n\n- royalty-free and non-exclusive,\n- sub-licensable for commercial and non-commercial purposes,\n- worldwide and perpetual,\n- irrevocable and non-terminable\n\nright\n\n- to use in any hardware and software environment, - with regard to the\n  software and data components - in particular to store or load it permanently\n  or temporarily, to display it and run it, including to the extent\n  reproductions are necessary to that end,\n- to modify, interpret, edit or redesign in another way,\n- to store, reproduce, exhibit, publish, distribute in tangible or intangible\n  form, on any medium or in any other way, for commercial and non-commercial\n  purposes, in particular to communicate privately or publicly, also through\n  image, audio and other information carriers, irrespective of whether by wire\n  or wireless means,\n- to use in databases, data networks and online services, including the right\n  to make the software and data components of the Subject Matter of the License\n  available in source code or object code to users of the aforementioned\n  databases, networks and online services for research and retrieval purposes,\n- to allow third parties to use or operate,\n- to use for own purposes but also to provide services to third parties,\n- to distribute\n\nthe Subject Matter of the License in its original or modified, interpreted,\nedited or redesigned form.\n\nThis right of use relates to the Subject Matter of the License in particular\nits source code and object code of the software components in all forms\n(including - where applicable - design rights).\n\nß3 Grant of a patent license\n\nSubject to the terms and conditions of this License and compliance with the\nprovisions of this License, You are hereby granted by each Contributor a\n\n- perpetual,\n- worldwide,\n- non-exclusive,\n- free of charge,\n- irrevocable (with the exception of the restrictions set out in this\n  Section 3)\n\npatent license in all rights deriving from the patents, owned and licensable by\nthe Contributor at the time of the submission of the Contribution, to\n\n- produce,\n- have produced,\n- use,\n- offer for sale,\n- sell,\n- import and otherwise transfer\n\nthe Subject Matter of the License.\n\nHowever, this patent license covers only those rights deriving from the patents\nof the respective Contributors as are indispensable in order not to infringe\nthat patent and only to the extent that the use of the Contributor's respective\nContributions, whether in itself or as a combination with other Contributions\nof the Contributors or any third parties together with the Subject Matter of\nthe License for which these Contributions were submitted, would otherwise\ninfringe that patent. For avoidance of doubt, no patent licenses are granted\nfor the use of the Subject Matter of the License or the Contributions which\nbecome necessary for lawful use because third party modifications are made to\nthe Subject Matter of the License or the respective Contributions after the\nContributions has been submitted by the Contributors. Under no circumstances\nwill anything in this Section 3 be construed as granting, by implication,\nestoppel or otherwise, a license to any patent for which the respective\nContributors have not granted patent rights when they submitted their\nrespective Contributions.\n\nIn the event that You institute judicial patent proceedings against any entity\nor person (including a counterclaim or countersuit in a legal dispute), arguing\nthat the Subject Matter of the License or a Contribution incorporated or\ncontained therein constitutes a patent infringement or a contributory factor to\na patent infringement, all patent licenses which have been granted to You under\nthis License for the Subject Matter of the License as well as this License in\nitself shall be deemed terminated as of the date on which the action is filed.\n\nFor avoidance of doubt, the Contributors are entitled to decide in their own\ndiscretion to abandon respectively maintain any patent designated by patent\nnumber upon delivery of the Subject Matter of the License.\n\nß4 Distribution\n\nYou may reproduce and distribute copies of the Subject Matter of the License or\nDerivative Works on any medium, with or without modifications, (with regard to\nsoftware components) in Source or Object Code, provided that You comply with\nthe following rules:\n\n- You must provide all other recipients of the Subject Matter of the License or\n  of Derivative Works with a copy of this License and inform them that the\n  Subject Matter of the License was originally licensed under this License.\n- You must ensure that modified files contain prominent notices indicating that\n  You have modified the files.\n- You must retain all copyright, patent, trademark and name credit notices in\n  the Subject Matter of the License in the source code of any Derivative Works\n  You distribute, with the exception of those notices which do not belong to\n  any part of the Derivative Works.\n- You must oblige the recipients of the Subject Matter of the License or\n  Derivative Works to incorporate the provisions of this Section 4 into any\n  license under which they distribute the the Subject Matter of the License or\n  Derivative Works to any other recipients.\n\nYou may add Your own copyright notices to Your modifications and state any\nadditional or different license conditions and conditions for the use,\nreproduction or distribution of Your modifications or for these Derivative\nWorks as a whole, provided that Your use, reproduction and distribution of the\nwork in all other respects complies with the terms and conditions set out in\nthis License.\n\nß5 Submission of Contributions\n\nUnless expressly stated otherwise, every Contribution that You have\nintentionally submitted for inclusion in the Subject Matter of the License is\nsubject to this License without any additional terms or conditions applying.\nIrrespective of the above, none of the terms or conditions contained herein may\nbe interpreted to replace or change the terms or conditions of a separate\nlicensing agreement that You may have concluded with a Licensor for such\nContributions, such as a so-called \"Contributor License Agreement\" (CLA).\n\nß6 Trademarks\n\nThis License does not grant permission to use the trade names, trademarks,\nservice marks or product names of the Licensor or of a Contributor.\n\nß7 Limited warranty\n\nThis License is granted free of charge and thus constitutes a gift.\nAccordingly, any warranty is excluded. Work on the Subject Matter of the\nLicense continues on an ongoing basis; it is constantly improved by countless\nContributors. The Subject Matter of the License is not completed and may\ntherefore contain errors (\"bugs\") or additional patents of Contributors or\nthird parties, as is inherent to this type of development.\n\nß8 Limitation of liability\n\nExcept in cases of intent and gross negligence or causing personal injury, the\nContributors, their legal representatives, trustees, officers and employees\nshall not be liable for direct or indirect, material or immaterial loss or\ndamage of any kind arising from the License or the use of the Subject Matter of\nthe License; this applies, among other things, but not exclusively, to loss of\ngoodwill, loss of production, computer failures or errors, loss of data or\neconomic loss or damage, even if the Contributor has been notified of the\npossibility of such loss or damage. Irrespective of the above, the Licensor\nshall only be liable in the scope of statutory product liability, to the extent\nthe respective provisions are applicable to the Subject Matter of the License\nor the Contribution.\n\nExcept in the case of intent, the Contributors, their legal representatives,\ntrustees, officers and employees shall not be liable that any of the\nContributions are free from any claim of infringement of any patent or any\nother intellectual property right owned by any third party, accurate, devoid of\nmistakes, complete and/or usable for any purpose.\n\nß9 Provision of warranties or assumption of additional liability in the event\nof distribution of the Subject Matter of the License\n\nIn the event of distribution of the Subject Matter of the License or Derivative\nWorks, You are free to assume support, warranty, indemnity or other liability\nobligations and/or rights in accordance with this License and to charge a fee\nin return. However, in accepting such obligations, You may act only on Your own\nbehalf and on Your sole responsibility, not on behalf of any other Contributor,\nand You hereby agree to indemnify, defend, and hold each Contributor harmless\nfor any liability incurred by, or claims asserted against, such Contributor by\nreason of your accepting any such warranty or additional liability.\n\nß10 Applicable law\n\nThis License is governed by German law with the exclusion of its provisions on\nthe conflict of laws and with the exclusion of the UN Convention on Contracts\nfor the International Sale of Goods (CISG).\n\nEND OF TERMS AND CONDITIONS"
}