{
  "key": "omg-bpmn-2.0",
  "short_name": "OMG BPMN 2.0",
  "name": "OMG Business Process Model and Notation 2.0",
  "category": "Proprietary Free",
  "owner": "OMG",
  "homepage_url": "https://www.omg.org/spec/BPMN/2.0",
  "spdx_license_key": "LicenseRef-scancode-omg-bpmn-2.0",
  "text_urls": [
    "https://www.omg.org/spec/BPMN/2.0/PDF"
  ],
  "other_urls": [
    "https://issues.apache.org/jira/browse/LEGAL-690"
  ],
  "text": "USE OF SPECIFICATION - TERMS, CONDITIONS & NOTICES\nThe material in this document details an Object Management Group specification in accordance with the terms,\nconditions and notices set forth below. This document does not represent a commitment to implement any portion of this\nspecification in any company's products. The information contained in this document is subject to change without notice.\n\nLICENSES\nThe companies listed above have granted to the Object Management Group, Inc. (OMG) a nonexclusive, royalty-free,\npaid up, worldwide license to copy and distribute this document and to modify this document and distribute copies of the\nmodified version. Each of the copyright holders listed above has agreed that no person shall be deemed to have infringed\nthe copyright in the included material of any such copyright holder by reason of having used the specification set forth\nherein or having conformed any computer software to the specification.\nSubject to all of the terms and conditions below, the owners of the copyright in this specification hereby grant you a fully-\npaid up, non-exclusive, nontransferable, perpetual, worldwide license (without the right to sublicense), to use this\nspecification to create and distribute software and special purpose specifications that are based upon this specification,\nand to use, copy, and distribute this specification as provided under the Copyright Act; provided that: (1) both the\ncopyright notice identified above and this permission notice appear on any copies of this specification; (2) the use of the\nspecifications is for informational purposes and will not be copied or posted on any network computer or broadcast in any\nmedia and will not be otherwise resold or transferred for commercial purposes; and (3) no modifications are made to this\nspecification. This limited permission automatically terminates without notice if you breach any of these terms or\nconditions. Upon termination, you will destroy immediately any copies of the specifications in your possession or control.\n\nPATENTS\nThe attention of adopters is directed to the possibility that compliance with or adoption of OMG specifications may\nrequire use of an invention covered by patent rights. OMG shall not be responsible for identifying patents for which a\nlicense may be required by any OMG specification, or for conducting legal inquiries into the legal validity or scope of\nthose patents that are brought to its attention. OMG specifications are prospective and advisory only. Prospective users are\nresponsible for protecting themselves against liability for infringement of patents.\n\nGENERAL USE RESTRICTIONS\nAny unauthorized use of this specification may violate copyright laws, trademark laws, and communications regulations\nand statutes. This document contains information which is protected by copyright. All Rights Reserved. No part of this\nwork covered by copyright herein may be reproduced or used in any form or by any means--graphic, electronic, or\nmechanical, including photocopying, recording, taping, or information storage and retrieval systems--without permission\nof the copyright owner.\n\nDISCLAIMER OF WARRANTY\nWHILE THIS PUBLICATION IS BELIEVED TO BE ACCURATE, IT IS PROVIDED \"AS IS\" AND MAY CONTAIN\nERRORS OR MISPRINTS. THE OBJECT MANAGEMENT GROUP AND THE COMPANIES LISTED ABOVE\nMAKE NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH REGARD TO THIS PUBLICATION,\nINCLUDING BUT NOT LIMITED TO ANY WARRANTY OF TITLE OR OWNERSHIP, IMPLIED WARRANTY OF\nMERCHANTABILITY OR WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE.\nIN NO EVENT SHALL THE OBJECT MANAGEMENT GROUP OR ANY OF THE COMPANIES LISTED ABOVE\nBE LIABLE FOR ERRORS CONTAINED HEREIN OR FOR DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nCONSEQUENTIAL, RELIANCE OR COVER DAMAGES, INCLUDING LOSS OF PROFITS, REVENUE, DATA OR\nUSE, INCURRED BY ANY USER OR ANY THIRD PARTY IN CONNECTION WITH THE FURNISHING,\nPERFORMANCE, OR USE OF THIS MATERIAL, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.\nThe entire risk as to the quality and performance of software developed using this specification is borne by you. This\ndisclaimer of warranty constitutes an essential part of the license granted to you to use this specification.\n\nRESTRICTED RIGHTS LEGEND\nUse, duplication or disclosure by the U.S. Government is subject to the restrictions set forth in subparagraph (c) (1) (ii) of\nThe Rights in Technical Data and Computer Software Clause at DFARS 252.227-7013 or in subparagraph (c)(1) and (2)\nof the Commercial Computer Software - Restricted Rights clauses at 48 C.F.R. 52.227-19 or as specified in 48 C.F.R. 227-\n7202-2 of the DoD F.A.R. Supplement and its successors, or as specified in 48 C.F.R. 12.212 of the Federal Acquisition\nRegulations and its successors, as applicable. The specification copyright owners are as indicated above and may be\ncontacted through the Object Management Group, 140 Kendrick Street, Needham, MA 02494, U.S.A.\n\nTRADEMARKS\nMDA®, Model Driven Architecture®, UML®, UML Cube logo®, OMG Logo®, CORBA® and XMI® are registered\ntrademarks of the Object Management Group, Inc., and Object Management Group™, OMG™ , Unified Modeling\nLanguage™, Model Driven Architecture Logo™, Model Driven Architecture Diagram™, CORBA logos™, XMI\nLogo™, CWM™, CWM Logo™, IIOP™ , IMM™ , MOF™ , OMG Interface Definition Language (IDL)™ , and OMG\nSystems Modeling Language (OMG SysML)™ are trademarks of the Object Management Group. All other products or\ncompany names mentioned are used for identification purposes only, and may be trademarks of their respective owners.\n\nCOMPLIANCE\nThe copyright holders listed above acknowledge that the Object Management Group (acting itself or through its\ndesignees) is and shall at all times be the sole entity that may authorize developers, suppliers and sellers of computer\nsoftware to use certification marks, trademarks or other special designations to indicate compliance with these materials.\nSoftware developed under the terms of this license may claim compliance or conformance with this specification if and\nonly if the software compliance is of a nature fully matching the applicable compliance points as stated in the\nspecification. Software developed only partially matching the applicable compliance points may claim only that the\nsoftware was based on this specification, but may not claim compliance or conformance with this specification. In the\nevent that testing suites are implemented or approved by Object Management Group, Inc., software developed using this\nspecification may claim compliance or conformance with the specification only if the software satisfactorily completes\nthe testing suites."
}