{
  "key": "openldap-2.3",
  "short_name": "OpenLDAP Public License 2.3",
  "name": "OpenLDAP Public License 2.3",
  "category": "Permissive",
  "owner": "OpenLDAP Foundation",
  "homepage_url": "http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=d32cf54a32d581ab475d23c810b0a7fbaf8d63c3",
  "notes": "Per SPDX.org, this license was released 28 July 2000.",
  "spdx_license_key": "OLDAP-2.3",
  "text_urls": [
    "http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=d32cf54a32d581ab475d23c810b0a7fbaf8d63c3"
  ],
  "minimum_coverage": 70,
  "ignorable_copyrights": [
    "Copyright 1999-2000 The OpenLDAP Foundation, Redwood City, California, USA."
  ],
  "ignorable_holders": [
    "The OpenLDAP Foundation, Redwood City, California, USA."
  ],
  "ignorable_urls": [
    "http://www.openldap.org/"
  ],
  "text": "The OpenLDAP Public License \nVersion 2.3, 28 July 2000 \n\nRedistribution and use of this software and associated documentation \n(\"Software\"), with or without modification, are permitted provided \nthat the following conditions are met: \n\n1. Redistributions of source code must retain copyright statements \nand notices. \n\n2. Redistributions in binary form must reproduce applicable copyright \nstatements and notices, this list of conditions, and the following \ndisclaimer in the documentation and/or other materials provided \nwith the distribution. \n\n3. Redistributions must contain a verbatim copy of this document. \n\n4. The name \"OpenLDAP\" must not be used to endorse or promote \nproducts derived from this Software without prior written permission \nof the OpenLDAP Foundation. \n\n5. Products derived from this Software may not be called \"OpenLDAP\" \nnor may \"OpenLDAP\" appear in their names without prior written \npermission of the OpenLDAP Foundation. \n\n6. Due credit should be given to the OpenLDAP Project \n(http://www.openldap.org/). \n\n7. The OpenLDAP Foundation may revise this license from time to \ntime. Each revision is distinguished by a version number. You \nmay use the Software under terms of this license revision or under \nthe terms of any subsequent revision of the license. \n\nTHIS SOFTWARE IS PROVIDED BY THE OPENLDAP FOUNDATION AND CONTRIBUTORS \n``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT \nNOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND \nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL \nTHE OPENLDAP FOUNDATION OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, \nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES \n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR \nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) \nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, \nSTRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) \nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED \nOF THE POSSIBILITY OF SUCH DAMAGE. \n\nOpenLDAP is a trademark of the OpenLDAP Foundation. \n\nCopyright 1999-2000 The OpenLDAP Foundation, Redwood City, \nCalifornia, USA. All Rights Reserved. Permission to copy and \ndistributed verbatim copies of this document is granted."
}