{
  "key": "openvpn-as-eula",
  "short_name": "OpenVPN-AS EULA",
  "name": "OpenVPN Access Server EULA",
  "category": "Proprietary Free",
  "owner": "OpenVPN",
  "homepage_url": "http://openvpn.net/index.php/license.html",
  "spdx_license_key": "LicenseRef-scancode-openvpn-as-eula",
  "other_urls": [
    "http://openvpn.net/index.php/license.html"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2009-2013 OpenVPN Technologies, Inc."
  ],
  "ignorable_holders": [
    "OpenVPN Technologies, Inc."
  ],
  "ignorable_urls": [
    "http://openvpn.net/"
  ],
  "text": "OpenVPN Access Server End User License Agreement (OpenVPN-AS EULA)\n\n1.    Copyright Notice: OpenVPN Access Server License;\nCopyright (c) 2009-2013 OpenVPN Technologies, Inc. All rights reserved.\n\"OpenVPN\" is a trademark of OpenVPN Technologies, Inc.\n\n2. Redistribution of OpenVPN Access Server binary forms and related documents,\nare permitted provided that redistributions of OpenVPN Access Server binary\nforms and related documents reproduce the above copyright notice as well as a\ncomplete copy of this EULA.\n\n3. You agree not to reverse engineer, decompile, disassemble, modify, translate,\nmake any attempt to discover the source code of this software, or create\nderivative works from this software.\n\n4. The OpenVPN Access Server is bundled with other open source software\ncomponents, some of which fall under different licenses. By using OpenVPN or any\nof the bundled components, you agree to be bound by the conditions of the\nlicense for each respective component. For more information, you can find our\ncomplete EULA (End-User License Agreement) on our website (http://openvpn.net),\nand a copy of the EULA is also distributed with the Access Server in the file\n/usr/local/openvpn_as/license.txt.\n\n5. This software is provided \"as is\" and any expressed or implied warranties,\nincluding, but not limited to, the implied warranties of merchantability and\nfitness for a particular purpose are disclaimed. In no event shall OpenVPN\nTechnologies, Inc. be liable for any direct, indirect, incidental, special,\nexemplary, or consequential damages (including, but not limited to, procurement\nof substitute goods or services; loss of use, data, or profits; or business\ninterruption) however caused and on any theory of liability, whether in\ncontract, strict liability, or tort (including negligence or otherwise) arising\nin any way out of the use of this software, even if advised of the possibility\nof such damage.\n\n6. OpenVPN Technologies, Inc. is the sole distributor of OpenVPN Access Server\nlicenses. This agreement and licenses granted by it may not be assigned,\nsublicensed, or otherwise transferred by licensee without prior written consent\nof OpenVPN Technologies Inc. Any licenses violating this provision will be\nsubject to revocation and deactivation, and will not be eligible for refunds.\n\n7. A purchased license entitles you to use this software for the duration of\ntime denoted on your license key on any one (1) particular device, up to the\nconcurrent user limit specified by your license. Multiple license keys may be\nactivated to achieve a desired concurrency limit on this given device. Unless\notherwise prearranged with OpenVPN Technologies, Inc., concurrency counts on\nlicense keys are not to be divided for use amongst multiple devices. Upon\nactivation of the first purchased license key in this software, you agree to\nforego any free licenses or keys that were given to you for demonstration\npurposes, and as such, the free licenses will not appear after the activation of\na purchased key. You are responsible for the timely activation of these licenses\non your desired server of choice. Refunds on purchased license keys are only\npossible within 30 days of purchase of license key, and then only if the license\nkey has not already been activated on a system. To request a refund, contact us\nthrough our support ticket system using the account you have used to purchase\nthe license key. Exceptions to this policy may be given for machines under\nfailover mode, and when the feature is used as directed in the OpenVPN Access\nServer user manual. In these circumstances, a user is granted one (1) license\nkey (per original license key) for use solely on failover purposes free of\ncharge. Other failover and/or load balancing use cases will not be eligible for\nthis exception, and a separate license key would have to be acquired to satisfy\nthe licensing requirements. To request a license exception, please file a\nsupport ticket in the OpenVPN Access Server ticketing system. A staff member\nwill be responsible for determining exception eligibility, and we reserve the\nright to decline any requests not meeting our eligibility criteria, or requests\nwhich we believe may be fraudulent in nature.\n\n8. Activating a license key ties it to the specific hardware/software\ncombination that it was activated on, and activated license keys are\nnontransferable. Substantial software and/or hardware changes may invalidate an\nactivated license. In case of substantial software and/or hardware changes,\ncaused by for example, but not limited to failure and subsequent repair or\nalterations of (virtualized) hardware/software, our software product will\nautomatically attempt to contact our online licensing systems to renegotiate the\nlicensing state. On any given license key, you are limited to three (3)\nautomatic renegotiations within the license key lifetime. After these\nrenegotiations are exhausted, the license key is considered invalid, and the\nactivation state will be locked to the last valid system configuration it was\nactivated on. OpenVPN Technologies, Inc. reserves the right to grant exceptions\nto this policy for license holders under extenuating circumstances, and such\nexceptions can be requested through a ticket via the OpenVPN Access Server\nticketing system.\n\n9. Once an activated license key expires or becomes invalid, the concurrency\nlimit on our software product will decrease by the amount of concurrent\nconnections previously granted by the license key. If all of your purchased\nlicense key(s) have expired, the product will revert to demonstration mode,\nwhich allows a maximum of two (2) concurrent users to be connected to your\nserver. Prior to your license expiration date(s), OpenVPN Technologies, Inc.\nwill attempt to remind you to renew your license(s) by sending periodic email\nmessages to the licensee email address on record. You are solely responsible for\nthe timely renewal of your license key(s) prior to their expiration if continued\noperation is expected after the license expiration date(s). OpenVPN\nTechnologies, Inc. will not be responsible for any misdirected and/or\nundeliverable email messages, nor does it have an obligation to contact you\nregarding your expiring license keys.\n\n10. Any valid license key holder is entitled to use our ticketing system for\nsupport questions or issues specifically related to the OpenVPN Access Server\nproduct. To file a ticket, go to our website at http://openvpn.net/ and sign in\nusing the account that was registered and used to purchase the license key(s).\nYou can then access the support ticket system through our website and submit a\nsupport ticket. Tickets filed in the ticketing system are answered on a best-\neffort basis. OpenVPN Technologies, Inc. staff reserve the right to limit\nresponses to users of our demo / expired licenses, as well as requests that\nsubstantively deviate from the OpenVPN Access Server product line. Tickets\nrelated to the open source version of OpenVPN will not be handled here.\n\n11. Purchasing a license key does not entitle you to any special rights or\nprivileges, except the ones explicitly outlined in this user agreement. Unless\notherwise arranged prior to your purchase with OpenVPN Technologies, Inc.,\nsoftware maintenance costs and terms are subject to change after your initial\npurchase without notice. In case of price decreases or special promotions,\nOpenVPN Technologies, Inc. will not retrospectively apply credits or price\nadjustments toward any licenses that have already been issued. Furthermore, no\ndiscounts will be given for license maintenance renewals unless this is\nspecified in your contract with OpenVPN Technologies, Inc."
}