{
  "key": "openssh",
  "short_name": "OpenSSH License",
  "name": "OpenSSH License",
  "category": "Permissive",
  "owner": "OpenBSD Project",
  "homepage_url": "https://github.com/openssh/openssh-portable/blob/V_7_3_P1/LICENCE",
  "notes": "composite",
  "spdx_license_key": "SSH-OpenSSH",
  "other_urls": [
    "http://www.openssh.org/",
    "https://github.com/openssh/openssh-portable/blob/1b11ea7c58cd5c59838b5fa574cd456d6047b2d4/LICENCE#L10"
  ],
  "minimum_coverage": 80,
  "ignorable_copyrights": [
    "Copyright (c) 1983, 1990, 1992, 1993, 1995 The Regents of the University of California",
    "Copyright (c) 1995 Tatu Ylonen <ylo@cs.hut.fi> , Espoo, Finland",
    "Copyright (c) 1998 CORE SDI S.A., Buenos Aires, Argentina",
    "Copyright 1995, 1996 by David Mazieres <dm@lcs.mit.edu>",
    "Copyright Patrick Powell 1995"
  ],
  "ignorable_holders": [
    "CORE SDI S.A., Buenos Aires, Argentina",
    "David Mazieres",
    "Patrick Powell",
    "Tatu Ylonen , Espoo, Finland",
    "The Regents of the University of California"
  ],
  "ignorable_authors": [
    "Antoon Bosselaers <antoon.bosselaers@esat.kuleuven.ac.be>",
    "Patrick Powell (papowell@astart.com)",
    "Paulo Barreto <paulo.barreto@terra.com.br>",
    "Vincent Rijmen <vincent.rijmen@esat.kuleuven.ac.be>"
  ],
  "ignorable_urls": [
    "http://www.core-sdi.com/",
    "http://www.cs.hut.fi/crypto"
  ],
  "ignorable_emails": [
    "antoon.bosselaers@esat.kuleuven.ac.be",
    "dm@lcs.mit.edu",
    "futo@core-sdi.com",
    "papowell@astart.com",
    "paulo.barreto@terra.com.br",
    "phk@login.dknet.dk",
    "vincent.rijmen@esat.kuleuven.ac.be",
    "ylo@cs.hut.fi"
  ],
  "text": "This file is part of the OpenSSH software.\n\nThe licences which components of this software fall under are as\nfollows.  First, we will summarize and say that all components\nare under a BSD licence, or a licence more free than that.\n\nOpenSSH contains no GPL code.\n\n1)\n     * Copyright (c) 1995 Tatu Ylonen <ylo@cs.hut.fi>, Espoo, Finland\n     *                    All rights reserved\n     *\n     * As far as I am concerned, the code I have written for this software\n     * can be used freely for any purpose.  Any derived versions of this\n     * software must be clearly marked as such, and if the derived work is\n     * incompatible with the protocol description in the RFC file, it must be\n     * called by a name other than \"ssh\" or \"Secure Shell\".\n\n    [Tatu continues]\n     *  However, I am not implying to give any licenses to any patents or\n     * copyrights held by third parties, and the software includes parts that\n     * are not under my direct control.  As far as I know, all included\n     * source code is used in accordance with the relevant license agreements\n     * and can be used freely for any purpose (the GNU license being the most\n     * restrictive); see below for details.\n\n    [However, none of that term is relevant at this point in time.  All of\n    these restrictively licenced software components which he talks about\n    have been removed from OpenSSH, i.e.,\n\n     - RSA is no longer included, found in the OpenSSL library\n     - IDEA is no longer included, its use is deprecated\n     - DES is now external, in the OpenSSL library\n     - GMP is no longer used, and instead we call BN code from OpenSSL\n     - Zlib is now external, in a library\n     - The make-ssh-known-hosts script is no longer included\n     - TSS has been removed\n     - MD5 is now external, in the OpenSSL library\n     - RC4 support has been replaced with ARC4 support from OpenSSL\n     - Blowfish is now external, in the OpenSSL library\n\n    [The licence continues]\n\n    Note that any information and cryptographic algorithms used in this\n    software are publicly available on the Internet and at any major\n    bookstore, scientific library, and patent office worldwide.  More\n    information can be found e.g. at \"http://www.cs.hut.fi/crypto\".\n\n    The legal status of this program is some combination of all these\n    permissions and restrictions.  Use only at your own responsibility.\n    You will be responsible for any legal consequences yourself; I am not\n    making any claims whether possessing or using this is legal or not in\n    your country, and I am not taking any responsibility on your behalf.\n\n\n\t\t\t    NO WARRANTY\n\n    BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\n    FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\n    OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\n    PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\n    OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\n    TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\n    PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\n    REPAIR OR CORRECTION.\n\n    IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\n    WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\n    REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\n    INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\n    OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\n    TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\n    YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\n    PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\n    POSSIBILITY OF SUCH DAMAGES.\n\n2)\n    The 32-bit CRC compensation attack detector in deattack.c was\n    contributed by CORE SDI S.A. under a BSD-style license.\n\n     * Cryptographic attack detector for ssh - source code\n     *\n     * Copyright (c) 1998 CORE SDI S.A., Buenos Aires, Argentina.\n     *\n     * All rights reserved. Redistribution and use in source and binary\n     * forms, with or without modification, are permitted provided that\n     * this copyright notice is retained.\n     *\n     * THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED\n     * WARRANTIES ARE DISCLAIMED. IN NO EVENT SHALL CORE SDI S.A. BE\n     * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY OR\n     * CONSEQUENTIAL DAMAGES RESULTING FROM THE USE OR MISUSE OF THIS\n     * SOFTWARE.\n     *\n     * Ariel Futoransky <futo@core-sdi.com>\n     * <http://www.core-sdi.com>\n\n3)\n    ssh-keyscan was contributed by David Mazieres under a BSD-style\n    license.\n\n     * Copyright 1995, 1996 by David Mazieres <dm@lcs.mit.edu>.\n     *\n     * Modification and redistribution in source and binary forms is\n     * permitted provided that due credit is given to the author and the\n     * OpenBSD project by leaving this copyright notice intact.\n\n4)\n    The Rijndael implementation by Vincent Rijmen, Antoon Bosselaers\n    and Paulo Barreto is in the public domain and distributed\n    with the following license:\n\n     * @version 3.0 (December 2000)\n     *\n     * Optimised ANSI C code for the Rijndael cipher (now AES)\n     *\n     * @author Vincent Rijmen <vincent.rijmen@esat.kuleuven.ac.be>\n     * @author Antoon Bosselaers <antoon.bosselaers@esat.kuleuven.ac.be>\n     * @author Paulo Barreto <paulo.barreto@terra.com.br>\n     *\n     * This code is hereby placed in the public domain.\n     *\n     * THIS SOFTWARE IS PROVIDED BY THE AUTHORS ''AS IS'' AND ANY EXPRESS\n     * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n     * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n     * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE\n     * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n     * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n     * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n     * BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\n     * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE\n     * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\n     * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n5)\n    One component of the ssh source code is under a 3-clause BSD license,\n    held by the University of California, since we pulled these parts from\n    original Berkeley code.\n\n     * Copyright (c) 1983, 1990, 1992, 1993, 1995\n     *      The Regents of the University of California.  All rights reserved.\n     *\n     * Redistribution and use in source and binary forms, with or without\n     * modification, are permitted provided that the following conditions\n     * are met:\n     * 1. Redistributions of source code must retain the above copyright\n     *    notice, this list of conditions and the following disclaimer.\n     * 2. Redistributions in binary form must reproduce the above copyright\n     *    notice, this list of conditions and the following disclaimer in the\n     *    documentation and/or other materials provided with the distribution.\n     * 3. Neither the name of the University nor the names of its contributors\n     *    may be used to endorse or promote products derived from this software\n     *    without specific prior written permission.\n     *\n     * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND\n     * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n     * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n     * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE\n     * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n     * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n     * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n     * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n     * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n     * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n     * SUCH DAMAGE.\n\n6)\n    Remaining components of the software are provided under a standard\n    2-term BSD licence with the following names as copyright holders:\n\n\tMarkus Friedl\n\tTheo de Raadt\n\tNiels Provos\n\tDug Song\n\tAaron Campbell\n\tDamien Miller\n\tKevin Steves\n\tDaniel Kouril\n\tWesley Griffin\n\tPer Allansson\n\tNils Nordman\n\tSimon Wilkinson\n\n    Portable OpenSSH additionally includes code from the following copyright\n    holders, also under the 2-term BSD license:\n\n\tBen Lindstrom\n\tTim Rice\n\tAndre Lucas\n\tChris Adams\n\tCorinna Vinschen\n\tCray Inc.\n\tDenis Parker\n\tGert Doering\n\tJakob Schlyter\n\tJason Downs\n\tJuha Yrjˆl‰\n\tMichael Stone\n\tNetworks Associates Technology, Inc.\n\tSolar Designer\n\tTodd C. Miller\n\tWayne Schroeder\n\tWilliam Jones\n\tDarren Tucker\n\tSun Microsystems\n\tThe SCO Group\n\tDaniel Walsh\n\tRed Hat, Inc\n\tSimon Vallet / Genoscope\n\n     * Redistribution and use in source and binary forms, with or without\n     * modification, are permitted provided that the following conditions\n     * are met:\n     * 1. Redistributions of source code must retain the above copyright\n     *    notice, this list of conditions and the following disclaimer.\n     * 2. Redistributions in binary form must reproduce the above copyright\n     *    notice, this list of conditions and the following disclaimer in the\n     *    documentation and/or other materials provided with the distribution.\n     *\n     * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR\n     * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\n     * OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\n     * IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,\n     * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\n     * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n     * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n     * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n     * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\n     * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n8) Portable OpenSSH contains the following additional licenses:\n\n    a) md5crypt.c, md5crypt.h\n\n\t * \"THE BEER-WARE LICENSE\" (Revision 42):\n\t * <phk@login.dknet.dk> wrote this file.  As long as you retain this\n\t * notice you can do whatever you want with this stuff. If we meet\n\t * some day, and you think this stuff is worth it, you can buy me a\n\t * beer in return.   Poul-Henning Kamp\n\n    b) snprintf replacement\n\n\t* Copyright Patrick Powell 1995\n\t* This code is based on code written by Patrick Powell\n\t* (papowell@astart.com) It may be used for any purpose as long as this\n\t* notice remains intact on all source code distributions\n\n    c) Compatibility code (openbsd-compat)\n\n       Apart from the previously mentioned licenses, various pieces of code\n       in the openbsd-compat/ subdirectory are licensed as follows:\n\n       Some code is licensed under a 3-term BSD license, to the following\n       copyright holders:\n\n\tTodd C. Miller\n\tTheo de Raadt\n\tDamien Miller\n\tEric P. Allman\n\tThe Regents of the University of California\n\tConstantin S. Svintsoff\n\n\t* Redistribution and use in source and binary forms, with or without\n\t* modification, are permitted provided that the following conditions\n\t* are met:\n\t* 1. Redistributions of source code must retain the above copyright\n\t*    notice, this list of conditions and the following disclaimer.\n\t* 2. Redistributions in binary form must reproduce the above copyright\n\t*    notice, this list of conditions and the following disclaimer in the\n\t*    documentation and/or other materials provided with the distribution.\n\t* 3. Neither the name of the University nor the names of its contributors\n\t*    may be used to endorse or promote products derived from this software\n\t*    without specific prior written permission.\n\t*\n\t* THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND\n\t* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n\t* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n\t* ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE\n\t* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n\t* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n\t* OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n\t* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n\t* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n\t* OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n\t* SUCH DAMAGE.\n\n       Some code is licensed under an ISC-style license, to the following\n       copyright holders:\n\n\tInternet Software Consortium.\n\tTodd C. Miller\n\tReyk Floeter\n\tChad Mynhier\n\n\t* Permission to use, copy, modify, and distribute this software for any\n\t* purpose with or without fee is hereby granted, provided that the above\n\t* copyright notice and this permission notice appear in all copies.\n\t*\n\t* THE SOFTWARE IS PROVIDED \"AS IS\" AND TODD C. MILLER DISCLAIMS ALL\n\t* WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES\n\t* OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL TODD C. MILLER BE LIABLE\n\t* FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n\t* WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION\n\t* OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN\n\t* CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n       Some code is licensed under a MIT-style license to the following\n       copyright holders:\n\n\tFree Software Foundation, Inc.\n\n\t* Permission is hereby granted, free of charge, to any person obtaining a  *\n\t* copy of this software and associated documentation files (the            *\n\t* \"Software\"), to deal in the Software without restriction, including      *\n\t* without limitation the rights to use, copy, modify, merge, publish,      *\n\t* distribute, distribute with modifications, sublicense, and/or sell       *\n\t* copies of the Software, and to permit persons to whom the Software is    *\n\t* furnished to do so, subject to the following conditions:                 *\n\t*                                                                          *\n\t* The above copyright notice and this permission notice shall be included  *\n\t* in all copies or substantial portions of the Software.                   *\n\t*                                                                          *\n\t* THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS  *\n\t* OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF               *\n\t* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.   *\n\t* IN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,   *\n\t* DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR    *\n\t* OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR    *\n\t* THE USE OR OTHER DEALINGS IN THE SOFTWARE.                               *\n\t*                                                                          *\n\t* Except as contained in this notice, the name(s) of the above copyright   *\n\t* holders shall not be used in advertising or otherwise to promote the     *\n\t* sale, use or other dealings in this Software without prior written       *\n\t* authorization.                                                           *\n\t****************************************************************************/\n\n\n------\n$OpenBSD: LICENCE,v 1.19 2004/08/30 09:18:08 markus Exp $"
}