{
  "key": "openldap-2.4",
  "short_name": "OpenLDAP Public License 2.4",
  "name": "OpenLDAP Public License 2.4",
  "category": "Permissive",
  "owner": "OpenLDAP Foundation",
  "homepage_url": "http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=cd1284c4a91a8a380d904eee68d1583f989ed386",
  "notes": "Per SPDX.org, this license was released 8 December 2000.",
  "spdx_license_key": "OLDAP-2.4",
  "text_urls": [
    "http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=cd1284c4a91a8a380d904eee68d1583f989ed386"
  ],
  "minimum_coverage": 70,
  "ignorable_copyrights": [
    "Copyright 1999-2000 The OpenLDAP Foundation, Redwood City, California, USA."
  ],
  "ignorable_holders": [
    "The OpenLDAP Foundation, Redwood City, California, USA."
  ],
  "text": "The OpenLDAP Public License \nVersion 2.4, 8 December 2000 \n\nRedistribution and use of this software and associated documentation \n(\"Software\"), with or without modification, are permitted provided \nthat the following conditions are met: \n\n1. Redistributions of source code must retain copyright statements \nand notices. \n\n2. Redistributions in binary form must reproduce applicable copyright \nstatements and notices, this list of conditions, and the following \ndisclaimer in the documentation and/or other materials provided \nwith the distribution. \n\n3. Redistributions must contain a verbatim copy of this document. \n\n4. The names and trademarks of the authors and copyright holders \nmust not be used in advertising or otherwise to promote the sale, \nuse or other dealing in this Software without specific, written \nprior permission. \n\n5. Due credit should be given to the OpenLDAP Project. \n\n6. The OpenLDAP Foundation may revise this license from time to \ntime. Each revision is distinguished by a version number. You \nmay use the Software under terms of this license revision or under \nthe terms of any subsequent revision of the license. \n\nTHIS SOFTWARE IS PROVIDED BY THE OPENLDAP FOUNDATION AND CONTRIBUTORS \n``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT \nNOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND \nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL \nTHE OPENLDAP FOUNDATION OR ITS CONTRIBUTORS BE LIABLE FOR ANY \nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL \nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE \nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS \nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER \nIN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR \nOTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN \nIF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. \n\nOpenLDAP is a trademark of the OpenLDAP Foundation. \n\nCopyright 1999-2000 The OpenLDAP Foundation, Redwood City, \nCalifornia, USA. All Rights Reserved. Permission to copy and \ndistributed verbatim copies of this document is granted."
}