{
  "key": "openjdk-exception",
  "short_name": "OpenJDK Exception",
  "name": "OpenJDK Classpath and Assembly Exception",
  "category": "Copyleft Limited",
  "owner": "Oracle Corporation",
  "homepage_url": "http://openjdk.java.net/legal/",
  "notes": "this exception is the combination of the classpath exception with extra\nterms and found only in the OpenJDK\n",
  "is_exception": true,
  "spdx_license_key": "LicenseRef-scancode-openjdk-exception",
  "other_spdx_license_keys": [
    "Assembly-exception"
  ],
  "text_urls": [
    "http://openjdk.java.net/legal/gplv2+ce.html",
    "http://openjdk.java.net/legal/assembly-exception.html",
    "http://openjdk.java.net/legal/exception-modules-2007-05-08.html"
  ],
  "ignorable_urls": [
    "http://openjdk.java.net/legal/exception-modules-2007-05-08.html",
    "http://www.gnu.org/copyleft/gpl.html"
  ],
  "text": "\"CLASSPATH\" EXCEPTION TO THE GPL\n\nCertain source files distributed by Oracle America and/or its affiliates are\nsubject to the following clarification and special exception to the GPL, but\nonly where Oracle has expressly included in the particular source file's header\nthe words \"Oracle designates this particular file as subject to the \"Classpath\"\nexception as provided by Oracle in the LICENSE file that accompanied this code.\"\n\n    Linking this library statically or dynamically with other modules is making\n    a combined work based on this library.  Thus, the terms and conditions of\n    the GNU General Public License cover the whole combination.\n\n    As a special exception, the copyright holders of this library give you\n    permission to link this library with independent modules to produce an\n    executable, regardless of the license terms of these independent modules,\n    and to copy and distribute the resulting executable under terms of your\n    choice, provided that you also meet, for each linked independent module,\n    the terms and conditions of the license of that module.  An independent\n    module is a module which is not derived from or based on this library.  If\n    you modify this library, you may extend this exception to your version of\n    the library, but you are not obligated to do so.  If you do not wish to do\n    so, delete this exception statement from your version.\n\nOpenJDK Assembly Exception\n\nThe OpenJDK source code made available by Sun at openjdk.java.net and\nopenjdk.dev.java.net (\"OpenJDK Code\") is distributed under the terms of\nthe GNU General Public License <http://www.gnu.org/copyleft/gpl.html>\nversion 2 only (\"GPL2\"), with the following clarification and special\nexception.\n\nLinking this OpenJDK Code statically or dynamically with other code is\nmaking a combined work based on this library.  Thus, the terms and\nconditions of GPL2 cover the whole combination.\n\nAs a special exception, Sun gives you permission to link this OpenJDK\nCode with certain code licensed by Sun as indicated at\nhttp://openjdk.java.net/legal/exception-modules-2007-05-08.html\n(\"Designated Exception Modules\") to produce an executable, regardless of\nthe license terms of the Designated Exception Modules, and to copy and\ndistribute the resulting executable under GPL2, provided that the\nDesignated Exception Modules continue to be governed by the licenses\nunder which they were offered by Sun.\n\nAs such, it allows licensees and sublicensees of Sun's GPL2 OpenJDK Code\nto build an executable that includes those portions of necessary code\nthat Sun could not provide under GPL2 (or that Sun has provided under\nGPL2 with the Classpath exception).  If you modify or add to the OpenJDK\ncode, that new GPL2 code may still be combined with Designated Exception\nModules if the new code is made subject to this exception by its\ncopyright holder.\n\n\nOpenJDK Designated Exception Modules\n\n8 May 2007\n\nFor purposes of those files in the OpenJDK distribution that are subject\nto the Assembly Exception, the following shall be deemed Designated\nException Modules:\n\nThose files in the OpenJDK distribution available at openjdk.java.net,\nopenjdk.dev.java.net, and download.java.net to which Sun has applied the\nClasspath Exception,\n\nAny of your derivative works of #1 above, to the extent you license them\nunder the GPLv2 with the Classpath Exception as defined in the OpenJDK\ndistribution available at openjdk.java.net, openjdk.dev.java.net, or\ndownload.java.net,\n\nAny files in the OpenJDK distribution that are made available at\nopenjdk.java.net, openjdk.dev.java.net, or download.java.net under a\nbinary code license, and\n\nAny files in the OpenJDK distribution that are made available at\nopenjdk.java.net, openjdk.dev.java.net, or download.java.net under an\nopen source license other than GPL, and your derivatives thereof that\nare in compliance with the applicable open source license."
}