{
  "key": "openldap-1.2",
  "short_name": "OpenLDAP Public License 1.2",
  "name": "OpenLDAP Public License 1.2",
  "category": "Copyleft Limited",
  "owner": "OpenLDAP Foundation",
  "homepage_url": "http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=42b0383c50c299977b5893ee695cf4e486fb0dc7",
  "notes": "Per SPDX.org, this license was released 1 September 1998. This license was\nissued four time, but only with formatting differences.\n",
  "spdx_license_key": "OLDAP-1.2",
  "text_urls": [
    "http://www.openldap.org/devel/gitweb.cgi?p=openldap.git;a=blob;f=LICENSE;hb=42b0383c50c299977b5893ee695cf4e486fb0dc7"
  ],
  "minimum_coverage": 70,
  "ignorable_copyrights": [
    "Copyright 1998, The OpenLDAP Foundation"
  ],
  "ignorable_holders": [
    "The OpenLDAP Foundation"
  ],
  "text": "The OpenLDAP Public License \n\nVersion 1.2, 1 September 1998 \nCopyright 1998, The OpenLDAP Foundation. \nAll Rights Reserved. \n\nNote: \nThis license is derived from the \"Artistic License\" as distributed \nwith the Perl Programming Language. As differences may exist, \nthe complete license should be read. \n\nPREAMBLE \n\nThe intent of this document is to state the conditions under which \na Package may be copied, such that the Copyright Holder maintains \nsome semblance of artistic control over the development of the \npackage, while giving the users of the package the right to use \nand distribute the Package in a more-or-less customary fashion, \nplus the right to make reasonable modifications. \n\nDefinitions: \n\n\"Package\" refers to the collection of files distributed by the \nCopyright Holder, and derivatives of that collection of files \ncreated through textual modification. \n\n\"Standard Version\" refers to such a Package if it has not been \nmodified, or has been modified in accordance with the wishes \nof the Copyright Holder. \n\n\"Copyright Holder\" is whoever is named in the copyright or \ncopyrights for the package. \n\n\"You\" is you, if you're thinking about copying or distributing \nthis Package. \n\n\"Reasonable copying fee\" is whatever you can justify on the \nbasis of media cost, duplication charges, time of people \ninvolved, and so on. (You will not be required to justify it \nto the Copyright Holder, but only to the computing community \nat large as a market that must bear the fee.) \n\n\"Freely Available\" means that no fee is charged for the item \nitself, though there may be fees involved in handling the item. \nIt also means that recipients of the item may redistribute it \nunder the same conditions they received it. \n\n1. You may make and give away verbatim copies of the source form \nof the Standard Version of this Package without restriction, provided \nthat you duplicate all of the original copyright notices and \nassociated disclaimers. \n\n2. You may apply bug fixes, portability fixes and other modifications \nderived from the Public Domain or from the Copyright Holder. A \nPackage modified in such a way shall still be considered the Standard \nVersion. \n\n3. You may otherwise modify your copy of this Package in any way, \nprovided that you insert a prominent notice in each changed file \nstating how and when you changed that file, and provided that you \ndo at least ONE of the following: \n\na) place your modifications in the Public Domain or otherwise \nmake them Freely Available, such as by posting said modifications \nto Usenet or an equivalent medium, or placing the modifications \non a major archive site such as uunet.uu.net, or by allowing \nthe Copyright Holder to include your modifications in the \nStandard Version of the Package. \n\nb) use the modified Package only within your corporation or \norganization. \n\nc) rename any non-standard executables so the names do not \nconflict with standard executables, which must also be provided, \nand provide a separate manual page for each non-standard \nexecutable that clearly documents how it differs from the \nStandard Version. \n\nd) make other distribution arrangements with the Copyright \nHolder. \n\n4. You may distribute the programs of this Package in object code \nor executable form, provided that you do at least ONE of the \nfollowing: \n\na) distribute a Standard Version of the executables and library \nfiles, together with instructions (in the manual page or \nequivalent) on where to get the Standard Version. \n\nb) accompany the distribution with the machine-readable source \nof the Package with your modifications. \n\nc) accompany any non-standard executables with their corresponding \nStandard Version executables, giving the non-standard executables \nnon-standard names, and clearly documenting the differences in \nmanual pages (or equivalent), together with instructions on \nwhere to get the Standard Version. \n\nd) make other distribution arrangements with the Copyright \nHolder. \n\n5. You may charge a reasonable copying fee for any distribution of \nthis Package. You may charge any fee you choose for support of \nthis Package. You may not charge a fee for this Package itself. \nHowever, you may distribute this Package in aggregate with other \n(possibly commercial) programs as part of a larger (possibly \ncommercial) software distribution provided that you do not advertise \nthis Package as a product of your own. \n\n6. The scripts and library files supplied as input to or produced \nas output from the programs of this Package do not automatically \nfall under the copyright of this Package, but belong to whomever \ngenerated them, and may be sold commercially, and may be aggregated \nwith this Package. \n\n7. C subroutines supplied by you and linked into this Package in \norder to emulate subroutines and variables of the language defined \nby this Package shall not be considered part of this Package, but \nare the equivalent of input as in Paragraph 6, provided these \nsubroutines do not change the language in any way that would cause \nit to fail the regression tests for the language. \n\n8. The name of the Copyright Holder may not be used to endorse or \npromote products derived from this software without specific prior \nwritten permission. \n\n9. THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR \nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED \nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE. \n\nThe End"
}