{
  "key": "osgi-spec-2.0",
  "short_name": "OSGi Specification License 2.0",
  "name": "OSGi Specification License Version 2.0",
  "category": "Proprietary Free",
  "owner": "OSGi Alliance",
  "homepage_url": "https://www.osgi.org/developer/specifications/licensing/",
  "spdx_license_key": "LicenseRef-scancode-osgi-spec-2.0",
  "ignorable_urls": [
    "http://www.osgi.org/"
  ],
  "text": "OSGi Specification License, Version 2.0.\n\nLicense Grant\n\nOSGi Alliance (\"OSGi\") hereby grants you a fully-paid, non-exclusive, non-\ntransferable, worldwide, limited license (without the right to sublicense),\nunder OSGi’s applicable intellectual property rights to view, download, and\nreproduce this OSGi Specification (\"Specification\") which follows this License\nAgreement (\"Agreement\"). You are not authorized to create any derivative work of\nthe Specification. However, to the extent that an implementation of the\nSpecification would necessarily be a derivative work of the Specification, OSGi\nalso grants you a perpetual, non-exclusive, worldwide, fully paid-up, royalty\nfree, limited license (without the right to sublicense) under any applicable\ncopyrights, to create and/or distribute an implementation of the Specification\nthat: (i) fully implements the Specification including all its required\ninterfaces and functionality; (ii) does not modify, subset, superset or\notherwise extend the OSGi Name Space, or include any public or protected\npackages, classes, Java interfaces, fields or methods within the OSGi Name Space\nother than those required and authorized by the Specification. An implementation\nthat does not satisfy limitations (i)-(ii) is not considered an implementation\nof the Specification, does not receive the benefits of this license, and must\nnot be described as an implementation of the Specification. An implementation of\nthe Specification must not claim to be a compliant implementation of the\nSpecification unless it passes the OSGi Compliance Tests for the Specification\nin accordance with OSGi processes. \"OSGi Name Space\" shall mean the public class\nor interface declarations whose names begin with \"org.osgi\" or any recognized\nsuccessors or replacements thereof.\n\nOSGi Participants (as such term is defined in the OSGi Intellectual Property\nRights Policy) have made non-assert and licensing commitments regarding patent\nclaims necessary to implement the Specification, if any, under the OSGi\nIntellectual Property Rights Policy which is available for examination on the\nOSGi public web site (www.osgi.org).\n\nNo Warranties and Limitation of Liability\n\nTHE SPECIFICATION IS PROVIDED \"AS IS,\" AND OSGi AND ANY OTHER AUTHORS MAKE NO\nREPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED\nTO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-\nINFRINGEMENT, OR TITLE; THAT THE CONTENTS OF THE SPECIFICATION ARE SUITABLE FOR\nANY PURPOSE; NOR THAT THE IMPLEMENTATION OF SUCH CONTENTS WILL NOT INFRINGE ANY\nTHIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS. OSGi AND ANY OTHER\nAUTHORS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SPECIFICATION OR THE\nPERFORMANCE OR IMPLEMENTATION OF THE CONTENTS THEREOF.\n\nCovenant Not to Assert\n\nAs a material condition to this license you hereby agree, to the extent that you\nhave any patent claims which are necessarily infringed by an implementation of\nthe Specification, not to assert any such patent claims against the creation,\ndistribution or use of an implementation of the Specification.\n\nGeneral\n\nThe name and trademarks of OSGi or any other Authors may NOT be used in any\nmanner, including advertising or publicity pertaining to the Specification or\nits contents without specific, written prior permission. Title to copyright in\nthe Specification will at all times remain with OSGi.\n\nNo other rights are granted by implication, estoppel or otherwise."
}