{
  "key": "oswego-concurrent",
  "short_name": "Oswego Concurrent License",
  "name": "Oswego Concurrent License",
  "category": "Permissive",
  "owner": "Oswego SUNY",
  "homepage_url": "http://g.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/concurrent/intro.html",
  "spdx_license_key": "LicenseRef-scancode-oswego-concurrent",
  "text_urls": [
    "http://g.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/concurrent/intro.html",
    "http://gee.cs.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/sun-u.c.license.pdf"
  ],
  "faq_url": "http://g.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/concurrent/intro.html",
  "ignorable_copyrights": [
    "Copyright (c) 1994-2000 Sun Microsystems, Inc."
  ],
  "ignorable_holders": [
    "Sun Microsystems, Inc."
  ],
  "ignorable_urls": [
    "http://g.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/concurrent/intro.html",
    "http://gee.cs.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/sun-u.c.license.pdf"
  ],
  "text": "http://g.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/concurrent/intro.html\n\nAll classes are released to the public domain and may be used for any purpose\nwhatsoever without permission or acknowledgment. Portions of the CopyOnWriteArrayList\nand ConcurrentReaderHashMap classes are adapted from Sun JDK source code. These are\ncopyright of Sun Microsystems, Inc, and are used with their kind permission, as\ndescribed in this license.\n\nhttp://gee.cs.oswego.edu/dl/classes/EDU/oswego/cs/dl/util/sun-u.c.license.pdf\n\nTECHNOLOGY LICENSE FROM SUN MICROSYSTEMS, INC. TO DOUG LEA\n\nWhereas Doug Lea desires to utlized certain Java Software technologies in the\nutil.concurrent technology; and Whereas Sun Microsystems, Inc. (\"Sun\") desires that\nDoug Lea utilize certain Java Software technologies in the util.concurrent\ntechnology; Therefore the parties agree as follows, effective May 31, 2002:\n\n\"Java Software technologies\" means classes/java/util/ArrayList.java, and\nclasses/java/util/HashMap.java.\n\nThe Java Software technologies are Copyright (c) 1994-2000 Sun Microsystems, Inc. All\nrights reserved. \n\nSun hereby grants Doug Lea a non-exclusive, worldwide, non- transferrable license to\nuse, reproduce, create derivate works of, and distribute the Java Software and\nderivative works thereof in source and binary forms as part of a larger work, and to\nsublicense the right to use, reproduce and distribute the Java Software and Doug\nLea's derivative works as the part of larger works through multiple tiers of\nsublicensees provided that the following conditions are met: \n\n-Neither the name of or trademarks of Sun may be used to endorse or promote products\nincluding or derived from the Java Software technology without specific prior written\npermission; and \n\n-Redistributions of source or binary code must contain the above copyright notice,\nthis notice and and the following disclaimers:\n\nThis software is provided \"AS IS,\" without a warranty of any kind. ALL EXPRESS OR\nIMPLIED CONDITIONS, REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE HEREBY\nEXCLUDED. SUN MICROSYSTEMS, INC. AND ITS LICENSORS SHALL NOT BE LIABLE FOR ANY\nDAMAGES SUFFERED BY LICENSEE AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE\nSOFTWARE OR ITS DERIVATIVES. IN NO EVENT WILL SUN MICROSYSTEMS, INC. OR ITS LICENSORS\nBE LIABLE FOR ANY LOST REVENUE, PROFIT OR DATA, OR FOR DIRECT, INDIRECT, SPECIAL,\nCONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND REGARDLESS OF THE\nTHEORY OF LIABILITY, ARISING OUT OF THE USE OF OR INABILITY TO USESOFTWARE, EVEN IF\nSUN MICROSYSTEMS, INC. HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nYou acknowledge that Software is not designed,licensed or intended for use in the\ndesign, construction, operation or maintenance of any nuclear facility.\n\nsigned [Doug Lea] dated"
}