{
  "key": "owal-1.0",
  "short_name": "Opera Web Applications License 1.0",
  "name": "Opera Web Applications License v1.0",
  "category": "Proprietary Free",
  "owner": "Opera Software ASA",
  "spdx_license_key": "LicenseRef-scancode-owal-1.0",
  "minimum_coverage": 50,
  "ignorable_copyrights": [
    "(c) Copyright 2006 Opera Software ASA."
  ],
  "ignorable_holders": [
    "Opera Software ASA."
  ],
  "text": "OPERA Web Applications License Version 1.0\n© Copyright 2006 Opera Software ASA. All rights reserved.\nOPERA SOFTWARE ASA (\"OPERA\") IS WILLING TO PERMIT USE OF THIS SOFTWARE\nBY YOU, ONLY UPON THE CONDITION THAT YOU ACCEPT ALL OF THE TERMS\nCONTAINED IN THIS DOCUMENT. PLEASE READ THE TERMS AND CONDITIONS OF THIS\nAGREEMENT CAREFULLY. IF YOU ARE NOT WILLING TO BE BOUND, YOU ARE NOT\nALLOWED TO ACCESS THE CONTENTS OF, STUDY OR MAKE USE OF THE SOFTWARE IN\nANY WAY.\n\nTerms of Agreement\n\n1.Definitions\n  a)\"Original Code\" means:\n    The original version of the program accompanying this Agreement as\n    released by Opera Software ASA (\"OPERA\"), including source code, object\n    code and documentation, if any.\n  b)\"Covered Code\" means:\n    The Original Source Code, Contributions, the combination of the Original\n    Code and Contributions, and/or any respective portions thereof.\n  c)\"Contribution\" means:\n    in the case of OPERA, the Original Code, and\n    in the case of each Contributor, changes to the Original code, and\n    additions to the Original Code; where such changes and/or additions to\n    the Original Code originate from and are distributed by that particular\n    Contributor. A Contribution 'originates' from a Contributor if it was\n    added to the Original Code by such Contributor itself or anyone acting\n    on such Contributor's behalf.\n    Contributions do not include additions to the Original Code which: (i)\n    are separate modules of software distributed in conjunction with the\n    Original Code under their own license agreement, and (ii) are not\n    derivative works of the Original Code.\n  d)\"Contributor\" means:\n    OPERA and any other entity that distributes the Covered Code.\n  e)\"Recipient\" means:\n    Anyone who receives the Covered Code under this Agreement, including all\n    Contributors.\n  f)\"Larger Work\" means:\n    A work which combines Covered Code or portions thereof with code not\n    governed by the terms of this Agreement, specifically additions to the\n    Original Code which: (i) are separate modules of software distributed in\n    conjunction with the Original Code under their own license agreement,\n    and (ii) are not derivative works of the Original Code.\n2.Grant of Rights\n  a)Subject to the terms of this Agreement, each Contributor hereby grants\n    Recipient a non-exclusive, worldwide, royalty-free copyright license to\n    reproduce, prepare derivative works of, publicly display, publicly\n    perform, distribute and sublicense the Contribution of such Contributor,\n    if any, and such derivative works, in source code and object code form.\n    The limited license granted in this Section is only for the integration\n    of the Contribution with or for the use of the Contribution in\n    connection with other proprietary software of OPERA, including but not\n    limited to OPERA’s browser software.\n  b)Recipient understands that although each Contributor grants the\n    licenses to its Contributions set forth herein, no assurances are\n    provided by any Contributor that the Covered Code does not infringe the\n    patent or other intellectual property rights of any other entity. Each\n    Contributor disclaims any liability to Recipient for claims brought by\n    any other entity based on infringement of intellectual property rights\n    or otherwise. As a condition to exercising the rights and licenses\n    granted hereunder, each Recipient hereby assumes sole responsibility to\n    secure any other intellectual property rights needed, if any.\n  c)Each Contributor represents that to its knowledge it has sufficient\n    copyright rights in its Contribution, if any, to grant the copyright\n    license set forth in this Agreement.\n  d)Except as expressly stated in this Agreement, no other rights or\n    licenses, express or implied, are granted by OPERA herein, including but\n    not limited to any rights to trademarks, service marks or logos\n    belonging to OPERA, OPERA’s suppliers or to any Contributor.\n\n3.Requirements\n  a)A Contributor may choose to distribute the Larger Work under its own\n    license agreement, provided that:\n      1.it complies with the terms and conditions of this Agreement;\n      2.and its license agreement:\n        1.effectively disclaims on behalf of all Contributors all warranties and\n          conditions, express and implied, including warranties or conditions of\n          title and non-infringement, and implied warranties or conditions of\n          merchantability and fitness for a particular purpose;\n        2.effectively excludes on behalf of all Contributors all liability for\n          damages, including direct, indirect, special, incidental and\n          consequential damages, such as lost profits;\n      3.states that any provisions which differ from this Agreement are\n        offered by that Contributor alone and not by any other party;\n      4.states that the Contribution only may be integrated with or used with\n        other proprietary software of OPERA, including but not limited to\n        OPERA’s browser software.\n      5.and states that source code for the Covered Code is available from\n        such Contributor, and informs licensees how to obtain it in a reasonable\n        manner on or through a medium customarily used for software exchange.\n  b)When the Covered Code is made available:\n    1. it must be made available under this Agreement; and a copy of this\n      Agreement must be included with each copy of the Covered Code.\n    2.Each Contributor must duplicate, to the extent it does not already\n      exist, the notice in Exhibit A in each file of the Covered Code of all\n      Contributions, and cause the modified files to carry prominent notices\n      stating that the contributor changed the files and the date of any\n      change.\n    3.In addition, each Contributor must identify itself as the originator\n      of its Contribution, if any, in a manner that reasonably allows\n      subsequent Recipients to identify the originator of the Contribution.\n\n4.No Warranty\n  EXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE COVERED CODE IS\n  PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY\n  KIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY\n  WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR\n  FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely responsible\n  for determining the appropriateness of using and distributing the\n  Covered Code for commercial and non-commercial purposes and assumes all\n  risks associated with its exercise of rights under this Agreement,\n  including but not limited to the risks and costs of Covered Code errors,\n  compliance with applicable laws, damage to or loss of data, code or\n  equipment, and unavailability or interruption of operations.\n5.Disclaimer of Liability\n  EXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR\n  ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT,\n  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING\n  WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF\n  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR\n  DISTRIBUTION OF THE COVERED CODE OR THE EXERCISE OF ANY RIGHTS GRANTED\n  HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n6. General\n  If any provision of this Agreement is invalid or unenforceable under\n  applicable law, it shall not affect the validity or enforceability of\n  the remainder of the terms of this Agreement, and without further action\n  by the parties hereto, such provision shall be reformed to the minimum\n  extent necessary to make such provision valid and enforceable.\n\n  All Recipient's rights under this Agreement shall terminate if it fails\n  to comply with any of the material terms or conditions of this Agreement\n  and does not cure such failure in a reasonable period of time after\n  becoming aware of such noncompliance. If all Recipient's rights under\n  this Agreement terminate, Recipient agrees to cease use and distribution\n  of the Covered Code as soon as reasonably practicable. However,\n  Recipient's obligations under this Agreement and any licenses granted by\n  Recipient relating to the Covered Code shall continue and survive.\n\n  OPERA may publish new versions (including revisions) of this Agreement\n  from time to time. Each new version of the Agreement will be given a\n  distinguishing version number. The Covered Code (including\n  Contributions) may always be distributed subject to the version of the\n  Agreement under which it was received. In addition, after a new version\n  of the Agreement is published, Contributor may elect to distribute the\n  Covered Code (including its Contributions) under the new version. No one\n  other than OPERA has the right to modify this Agreement. Except as\n  expressly stated in Section 2(a), Recipient receives no rights or\n  licenses to the intellectual property of any Contributor under this\n  Agreement, whether expressly, by implication, estoppel or otherwise. All\n  rights in the Covered Code not expressly granted under this Agreement\n  are reserved.\n\n  This Agreement is governed by the laws of Norway. Any and all disputes\n  arising out of the rights and obligations in this Agreement shall be\n  submitted to ordinary court proceedings. You accept the Oslo City Court\n  as legal venue under this Agreement."
}