{
  "key": "parity-7.0.0",
  "short_name": "The Parity Public License 7.0.0",
  "name": "The Parity Public License 7.0.0",
  "category": "Copyleft",
  "owner": "Kyle Mitchell",
  "homepage_url": "https://paritylicense.com/versions/7.0.0.html",
  "spdx_license_key": "Parity-7.0.0",
  "text": "The Parity Public License 7.0.0\n\nContributor: contributor name\n\nSource Code: source\n\nPurpose\nThis license allows you to use and share this software for free, but you have to share software that builds on it alike.\n\nAgreement\nIn order to receive this license, you have to agree to its rules. Those rules are both obligations under that agreement and conditions to your license. Don’t do anything with this software that triggers a rule you can’t or won’t follow.\n\nNotices\nMake sure everyone who gets a copy of any part of this software from you, with or without changes, also gets the text of this license and the contributor and source code lines above.\n\nCopyleft\nContribute software you develop, operate, or analyze with this software, including changes or additions to this software. When in doubt, contribute.\n\nPrototypes\nYou don’t have to contribute any change, addition, or other software that meets all these criteria:\n\nYou don’t use it for more than thirty days.\n\nYou don’t share it outside the team developing it, other than for non-production user testing.\n\nYou don’t develop, operate, or analyze other software with it for anyone outside the team developing it.\n\nReverse Engineering\nYou may use this software to operate and analyze software you can’t contribute in order to develop alternatives you can and do contribute.\n\nContribute\nTo contribute software:\n\nPublish all source code for the software in the preferred form for making changes through a freely accessible distribution system widely used for similar source code so the contributor and others can find and copy it.\n\nMake sure every part of the source code is available under this license or another license that allows everything this license does, such as the Blue Oak Model License 1.0.0, the Apache License 2.0, the MIT license, or the two-clause BSD license.\n\nTake these steps within thirty days.\n\nNote that this license does not allow you to change the license terms for this software. You must follow Notices.\n\nExcuse\nYou’re excused for unknowingly breaking Copyleft if you contribute as required, or stop doing anything requiring this license, within thirty days of learning you broke the rule. You’re excused for unknowingly breaking Notices if you take all practical steps to comply within thirty days of learning you broke the rule.\n\nDefense\nDon’t make any legal claim against anyone accusing this software, with or without changes, alone or with other technology, of infringing any patent.\n\nCopyright\nThe contributor licenses you to do everything with this software that would otherwise infringe their copyright in it.\n\nPatent\nThe contributor licenses you to do everything with this software that would otherwise infringe any patents they can license or become able to license.\n\nReliability\nThe contributor can’t revoke this license.\n\nNo Liability\nAs far as the law allows, this software comes as is, without any warranty or condition, and the contributor won’t be liable to anyone for any damages related to this software or this license, under any kind of legal claim."
}