{
  "key": "php-2.0.2",
  "short_name": "PHP License 2.0.2",
  "name": "PHP License 2.0.2",
  "category": "Permissive",
  "owner": "PHP Project",
  "homepage_url": "http://www.php.net/license/2_02.txt",
  "spdx_license_key": "LicenseRef-scancode-php-2.0.2",
  "osi_url": "http://www.opensource.org/licenses/php.html",
  "minimum_coverage": 60,
  "ignorable_copyrights": [
    "Copyright (c) 1999 - 2002 The PHP Group"
  ],
  "ignorable_holders": [
    "The PHP Group"
  ],
  "ignorable_urls": [
    "http://www.php.net/",
    "http://www.php.net/license/ZendGrant",
    "http://www.zend.com/license/ZendLicense"
  ],
  "ignorable_emails": [
    "group@php.net"
  ],
  "text": "-------------------------------------------------------------------- \n                  The PHP License, version 2.02\nCopyright (c) 1999 - 2002 The PHP Group. All rights reserved.\n-------------------------------------------------------------------- \n\nRedistribution and use in source and binary forms, with or without\nmodification, is permitted provided that the following conditions\nare met:\n\n  1. Redistributions of source code must retain the above copyright\n     notice, this list of conditions and the following disclaimer. \n \n  2. Redistributions in binary form must reproduce the above \n     copyright notice, this list of conditions and the following \n     disclaimer in the documentation and/or other materials provided\n     with the distribution.\n \n  3. The name \"PHP\" must not be used to endorse or promote products \n     derived from this software without prior permission from the \n     PHP Group.  This does not apply to add-on libraries or tools\n     that work in conjunction with PHP.  In such a case the PHP\n     name may be used to indicate that the product supports PHP.\n \n  4. The PHP Group may publish revised and/or new versions of the\n     license from time to time. Each version will be given a\n     distinguishing version number.\n     Once covered code has been published under a particular version\n     of the license, you may always continue to use it under the\n     terms of that version. You may also choose to use such covered\n     code under the terms of any subsequent version of the license\n     published by the PHP Group. No one other than the PHP Group has\n     the right to modify the terms applicable to covered code created\n     under this License.\n\n  5. Redistributions of any form whatsoever must retain the following\n     acknowledgment:\n     \"This product includes PHP, freely available from\n     http://www.php.net/\".\n\n  6. The software incorporates the Zend Engine, a product of Zend\n     Technologies, Ltd. (\"Zend\"). The Zend Engine is licensed to the\n     PHP Association (pursuant to a grant from Zend that can be\n     found at http://www.php.net/license/ZendGrant/) for\n     distribution to you under this license agreement, only as a\n     part of PHP.  In the event that you separate the Zend Engine\n     (or any portion thereof) from the rest of the software, or\n     modify the Zend Engine, or any portion thereof, your use of the\n     separated or modified Zend Engine software shall not be governed\n     by this license, and instead shall be governed by the license\n     set forth at http://www.zend.com/license/ZendLicense/. \n\n\n\nTHIS SOFTWARE IS PROVIDED BY THE PHP DEVELOPMENT TEAM ``AS IS'' AND \nANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A \nPARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE PHP\nDEVELOPMENT TEAM OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, \nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES \n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR \nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\nSTRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\nOF THE POSSIBILITY OF SUCH DAMAGE.\n\n-------------------------------------------------------------------- \n\nThis software consists of voluntary contributions made by many\nindividuals on behalf of the PHP Group.\n\nThe PHP Group can be contacted via Email at group@php.net.\n\nFor more information on the PHP Group and the PHP project, \nplease see <http://www.php.net>."
}