{
  "key": "prosperity-2.0",
  "short_name": "Prosperity Public License 2.0",
  "name": "The Prosperity Public License 2.0",
  "category": "Source-available",
  "owner": "Kyle Mitchell",
  "homepage_url": "https://licensezero.com/licenses/prosperity",
  "spdx_license_key": "LicenseRef-scancode-prosperity-2.0",
  "text_urls": [
    "https://github.com/licensezero/prosperity-public-license/blob/v2.0.0/LICENSE.mustache"
  ],
  "text": "The Prosperity Public License 2.0\n\nCopyright Notice: {Licensor Name}\n\nSource Notice: {https://example.com/project}\n\nThis license lets you use and share this software for free,\nwith a trial-length time limit on commercial use. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe either the contributor's\ncopyright in it, any patent claim the contributor can license\nthat covers this software as of the contributor's latest\ncontribution, or both.\n\n1. You must limit use of this software in any manner primarily\n   intended for or directed toward commercial advantage or\n   private monetary compensation to a trial period of 32\n   consecutive calendar days. This limit does not apply to use in\n   developing feedback, modifications, or extensions that you\n   contribute back to those giving this license.\n\n2. Ensure everyone who gets a copy of this software from you, in\n   source code or any other form, gets the text of this license\n   and the contributor and source code lines above.\n\n3. Do not make any legal claim against anyone for infringing any\n   patent claim they would infringe by using this software alone,\n   accusing this software, with or without changes, alone or as\n   part of a larger application.\n\nYou are excused for unknowingly breaking rule 1 if you stop\ndoing anything requiring this license within 30 days of\nlearning you broke the rule.\n\n**This software comes as is, without any warranty at all. As far\nas the law allows, the contributor will not be liable for any\ndamages related to this software or this license, for any kind of\nlegal claim.**"
}