{
  "key": "prosperity-1.0.1",
  "short_name": "Prosperity Public License 1.0.1",
  "name": "The Prosperity Public License 1.0.1",
  "category": "Proprietary Free",
  "owner": "Kyle Mitchell",
  "homepage_url": "https://licensezero.com/licenses/prosperity",
  "spdx_license_key": "LicenseRef-scancode-prosperity-1.0.1",
  "text_urls": [
    "https://github.com/licensezero/prosperity-public-license/blob/master/LICENSE.mustache"
  ],
  "other_urls": [
    "https://github.com/dependabot/dependabot-core/blob/master/LICENSE"
  ],
  "text": "The Prosperity Public License 1.0.1\n\nCopyright Notice: {Licensor Name}\n\nSource Notice: {https://example.com/project}\n\nThis license lets you use and share this software for free,\nwith a trial-length time limit on commercial use. Specifically:\n\nIf you follow the rules below, you may do everything with this\nsoftware that would otherwise infringe my copyright in it or any\npatent claim I can license that covers this software as of my\nlatest contribution.\n\n1. You must limit use of this software in any manner primarily\n   intended for or directed toward commercial advantage or\n   private monetary compensation to a trial period of 32\n   consecutive calendar days. This limit does not apply to use in\n   developing feedback, modifications, or extensions that you\n   contribute back to those giving this license.\n\n2. Ensure everyone who gets a copy of this software from you,\n   in source code or any other form, gets the text of this\n   license and the copyright and source notices above.\n\n3. Do not make any legal claim against anyone for infringing\n   any patent claim they would infringe by using this software\n   alone, accusing this software, with or without changes,\n   alone or as part of a larger program.\n\nYou are excused for unknowingly breaking rule 1 if you stop\ndoing anything requiring this license within 30 days of\nlearning you broke the rule.\n\n**This software comes as is, without any warranty at all. As far\nas the law allows, I will not be liable for any damages related\nto this software or this license, for any kind of legal claim.**"
}