{
  "key": "psion-s3aemul",
  "short_name": "Psion User LIcence for S3AEMUL",
  "name": "Psion User LIcence for S3AEMUL",
  "category": "Proprietary Free",
  "owner": "Psion",
  "homepage_url": "https://psion.gtkc.net/psion-gmbh/emulator/serie3a/licence.txt",
  "spdx_license_key": "LicenseRef-scancode-psion-s3aemul",
  "text": "PSION PLC BUSINESS/INSTITUTION/GOVERNMENT/HOME USER LICENCE\n                                  for\n                                S3AEMUL\n---------------------------------------------------------------------\n                                LICENCE\n\n NOTICE TO THE USER (\"licensee\"): CAREFULLY READ THE FOLLOWING LEGAL\nAGREEMENT. THE LICENSEE'S USE OF THIS SOFTWARE IS CONDITIONAL UPON\nCOMPLIANCE BY THE LICENSEE WITH THE TERMS OF THIS AGREEMENT.\n\ni).  S3AEMUL may be used on a royalty free basis.\n\nii). You may copy and distribute copies of S3AEMUL in the same form\n     as you receive it, without any files being removed, altered or\n     added.  You may not copy it in any other form.\n\n Note: \"S3AEMUL\" consists of the following files: licence.txt (this\nuser licence agreement), readme.txt (a documentation file), and\ns3aemul.exe, epoc.dll, epoc.rmi, hhserver.par, rtm.exe, and\ndpmi16bi.ovl (software files).\n\n---------------------------------------------------------------------\n\n                               COPYRIGHT\n\n S3AEMUL is protected by United Kingdom copyright laws and\ninternational treaty provisions. The licensee acknowledges that no\ntitle to the intellectual property in S3AEMUL is transferred to the\nlicensee. The licensee further acknowledges that full ownership\nrights to S3AEMUL will remain the exclusive property of Psion PLC,\nand that the licensee will not acquire any rights to S3AEMUL except\nas expressly set forth in this licence. The licensee agrees that any\ncopies of S3AEMUL made by the licensee will contain the same\nproprietary notices which appear on and in the original release of\nS3AEMUL.\n\n                          REVERSE ENGINEERING\n\n The licensee agrees that he or she will not attempt to reverse\ncompile, modify, translate or disassemble S3AEMUL, in whole or in part.\n\n                              NO WARRANTY\n\n BECAUSE PSION S3AEMUL IS LICENSED FREE OF CHARGE, WE PROVIDE\nABSOLUTELY NO WARRANTY, TO THE EXTENT PERMITTED BY APPLICABLE LAW.\nEXCEPT WHERE OTHERWISE STATED IN WRITING, PSION PLC PROVIDE S3AEMUL\n\"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE\nRISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. \nSHOULD THE S3AEMUL PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW WILL PSION PLC BE\nLIABLE TO YOU FOR DAMAGES, INCLUDING ANY LOST PROFITS, LOST MONIES,\nOR OTHER SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF\nTHE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO\nLOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nTHIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH PROGRAMS\nNOT DISTRIBUTED BY PSION PLC), EVEN IF YOU HAVE BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES, OR FOR ANY CLAIM BY ANY OTHER PARTY."
}