{
  "key": "pygres-2.2",
  "short_name": "PyGres License 2.2",
  "name": "PyGres License v2.2",
  "category": "Permissive",
  "owner": "Unspecified",
  "spdx_license_key": "LicenseRef-scancode-pygres-2.2",
  "text_urls": [
    "http://shell.vex.net/viewvc.cgi/pygresql/trunk/module/pgmodule.c?view=markup&pathrev=431"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 1995, Pascal Andre (andre@via.ecp.fr)",
    "copyright 1997, 1998, 1999 by D'Arcy J.M. Cain (darcy@druid.net)"
  ],
  "ignorable_holders": [
    "D'Arcy J.M. Cain",
    "Pascal Andre"
  ],
  "ignorable_emails": [
    "andre@chimay.via.ecp.fr",
    "andre@via.ecp.fr",
    "darcy@druid.net"
  ],
  "text": "PyGres, version 2.2 A Python interface for PostgreSQL database. Written by\nD'Arcy J.M. Cain, (darcy@druid.net).  Based heavily on code written by\nPascal Andre, andre@chimay.via.ecp.fr. Copyright (c) 1995, Pascal Andre\n(andre@via.ecp.fr).\n\nPermission to use, copy, modify, and distribute this software and its\ndocumentation for any purpose, without fee, and without a written\nagreement is hereby granted, provided that the above copyright notice and\nthis paragraph and the following two paragraphs appear in all copies or in\nany new file that contains a substantial portion of this file.\n\nIN NO EVENT SHALL THE AUTHOR BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT,\nSPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS,\nARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE\nAUTHOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nTHE AUTHOR SPECIFICALLY DISCLAIMS ANY WARRANTIES, INCLUDING, BUT NOT LIMITED\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS ON AN \"AS IS\" BASIS, AND THE\nAUTHOR HAS NO OBLIGATIONS TO PROVIDE MAINTENANCE, SUPPORT, UPDATES,\nENHANCEMENTS, OR MODIFICATIONS.\n\nFurther modifications copyright 1997, 1998, 1999 by D'Arcy J.M. Cain\n(darcy@druid.net) subject to the same terms and conditions as above."
}