{
  "key": "qca-technology",
  "short_name": "QCA Technology License",
  "name": "Qualcomm Atheros Technology License",
  "category": "Proprietary Free",
  "owner": "Qualcomm Atheros",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENCE.atheros_firmware",
  "spdx_license_key": "LicenseRef-scancode-qca-technology",
  "text": "Redistribution and use in binary forms, without\nmodification, are permitted (subject to the limitations in the\ndisclaimer below) provided that the following conditions are met:\n\n* Redistributions must reproduce the above copyright notice, this list\n  of conditions, and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of Qualcomm Atheros, Inc. nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\n* No Reverse engineering, decompiling, decrypting, or disassembling of\n  this software is permitted.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. NO LICENSES OR OTHER RIGHTS,\nWHETHER EXPRESS, IMPLIED, BASED ON ESTOPPEL OR OTHERWISE, ARE GRANTED\nTO ANY PARTY'S PATENTS, PATENT APPLICATIONS, OR PATENTABLE INVENTIONS\nBY VIRTUE OF THIS LICENSE OR THE DELIVERY OR PROVISION BY QUALCOMM\nATHEROS, INC. OF THE SOFTWARE.\n\nIN NO EVENT SHALL THE COPYRIGHT OWNER OR ANY CONTRIBUTOR BE LIABLE FOR\nANY INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND REGARDLESS OF ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\nOTHERWISE) ARISING IN ANY WAY OUT OF OR RESULTING FROM THE USE OF THE\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN ANY\nEVENT, THE TOTAL AGGREGATE LIABILITY THAT MAY BE IMPOSED ON QUALCOMM\nATHEROS, INC. FOR ANY DIRECT DAMAGES ARISING UNDER OR RESULTING FROM\nTHIS AGREEMENT OR IN CONNECTION WITH ANY USE OF THE SOFTWARE SHALL NOT\nEXCEED A TOTAL AMOUNT OF US$5.00.\n\nIF ANY OF THE ABOVE PROVISIONS ARE HELD TO BE VOID, INVALID,\nUNENFORCEABLE, OR ILLEGAL, THE OTHER PROVISIONS SHALL CONTINUE IN FULL\nFORCE AND EFFECT."
}