{
  "key": "qca-linux-firmware",
  "short_name": "QCA Linux Firmware License",
  "name": "QCA Linux Firmware License",
  "category": "Proprietary Free",
  "owner": "Qualcomm Atheros",
  "homepage_url": "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENSE.QualcommAtheros_ath10k",
  "spdx_license_key": "LicenseRef-scancode-qca-linux-firmware",
  "text_urls": [
    "https://git.kernel.org/pub/scm/linux/kernel/git/firmware/linux-firmware.git/tree/LICENSE.QualcommAtheros_ar3k"
  ],
  "ignorable_urls": [
    "git://git.kernel.org/pub/scm/linux/kernel/git/firmware/"
  ],
  "text": "Redistribution. Reproduction and redistribution in binary form, without\nmodification, for use solely in conjunction with a Qualcomm Atheros, Inc.\nchipset, is permitted provided that the following conditions are met:\n\n  • Redistributions must reproduce the above copyright notice and the following\n    disclaimer in the documentation and/or other materials provided with the\n    distribution.\n\n  • Neither the name of Qualcomm Atheros, Inc. nor the names of its suppliers\n    may be used to endorse or promote products derived from this Software\n    without specific prior written permission.\n\n  • No reverse engineering, decompilation, or disassembly of this Software is\n    permitted.\n\nLimited patent license. Qualcomm Atheros, Inc. (“Licensor”) grants you\n(“Licensee”) a limited, worldwide, royalty-free, non-exclusive license under\nthe Patents to make, have made, use, import, offer to sell and sell the\nSoftware. No hardware per se is licensed hereunder.\nThe term “Patents” as used in this agreement means only those patents or patent\napplications owned solely and exclusively by Licensor as of the date of\nLicensor’s submission of the Software and any patents deriving priority (i.e.,\nhaving a first effective filing date) therefrom. The term “Software” as used in\nthis agreement means the firmware image submitted by Licensor, under the terms\nof this license, to git://git.kernel.org/pub/scm/linux/kernel/git/firmware/\nlinux-firmware.git.\nNotwithstanding anything to the contrary herein, Licensor does not grant and\nLicensee does not receive, by virtue of this agreement or the Licensor’s\nsubmission of any Software, any license or other rights under any patent or\npatent application owned by any affiliate of Licensor or any other entity\n(other than Licensor), whether expressly, impliedly, by virtue of estoppel or\nexhaustion, or otherwise.\n\nDISCLAIMER. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND\nCONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,\nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL\nTHE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\nBUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS\nOF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\nTORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\nUSE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}