{
  "key": "qlogic-microcode",
  "short_name": "QLogic Microcode",
  "name": "QLogic Microcode",
  "category": "Permissive",
  "owner": "QLogic",
  "notes": "this is a Linux firmware BSD-like license with some weird extra terms",
  "spdx_license_key": "LicenseRef-scancode-qlogic-microcode",
  "text": "You may redistribute the hardware specific firmware binary file\nunder the following terms:\n\n1. Redistribution of source code (only if applicable),\n   must retain the above copyright notice, this list of\n   conditions and the following disclaimer.\n\n2. Redistribution in binary form must reproduce the above\n   copyright notice, this list of conditions and the\n   following disclaimer in the documentation and/or other\n   materials provided with the distribution.\n\n3. The name of QLogic Corporation may not be used to\n   endorse or promote products derived from this software\n   without specific prior written permission\n\nREGARDLESS OF WHAT LICENSING MECHANISM IS USED OR APPLICABLE,\nTHIS PROGRAM IS PROVIDED BY QLOGIC CORPORATION \"AS IS'' AND ANY\nEXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR\nBE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\nOUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\nUSER ACKNOWLEDGES AND AGREES THAT USE OF THIS PROGRAM WILL NOT\nCREATE OR GIVE GROUNDS FOR A LICENSE BY IMPLICATION, ESTOPPEL, OR\nOTHERWISE IN ANY INTELLECTUAL PROPERTY RIGHTS (PATENT, COPYRIGHT,\nTRADE SECRET, MASK WORK, OR OTHER PROPRIETARY RIGHT) EMBODIED IN\nANY OTHER QLOGIC HARDWARE OR SOFTWARE EITHER SOLELY OR IN\nCOMBINATION WITH THIS PROGRAM."
}