{
  "key": "qualcomm-turing",
  "short_name": "Qualcomm Turing License",
  "name": "Qualcomm Turing License",
  "category": "Permissive",
  "owner": "Qualcomm",
  "homepage_url": "https://github.com/arantius/tivodecode/blob/master/Turing.h",
  "spdx_license_key": "LicenseRef-scancode-qualcomm-turing",
  "text_urls": [
    "https://github.com/arantius/tivodecode/blob/master/Turing.h"
  ],
  "ignorable_authors": [
    "QUALCOMM Incorporated"
  ],
  "text": "This software is free for commercial and non-commercial use subject to\nthe following conditions:\n\n1.  Copyright remains vested in QUALCOMM Incorporated, and Copyright\nnotices in the code are not to be removed.  If this package is used in\na product, QUALCOMM should be given attribution as the author of the\nTuring encryption algorithm. This can be in the form of a textual\nmessage at program startup or in documentation (online or textual)\nprovided with the package.\n\n2.  Redistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\na. Redistributions of source code must retain the copyright notice,\n   this list of conditions and the following disclaimer.\n\nb. Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the\n   distribution.\n\nc. All advertising materials mentioning features or use of this\n   software must display the following acknowledgement:  This product\n   includes software developed by QUALCOMM Incorporated.\n\n3.  THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE AND AGAINST\nINFRINGEMENT ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n4.  The license and distribution terms for any publically available version\nor derivative of this code cannot be changed, that is, this code cannot\nsimply be copied and put under another distribution license including\nthe GNU Public License.\n\n5.  The Turing family of encryption algorithms are covered by patents in\nthe United States of America and other countries. A free and\nirrevocable license is hereby granted for the use of such patents to\nthe extent required to utilize the Turing family of encryption\nalgorithms for any purpose, subject to the condition that any\ncommercial product utilising any of the Turing family of encryption\nalgorithms should show the words \"Encryption by QUALCOMM\" either on the\nproduct or in the associated documentation."
}