{
  "key": "rackspace",
  "short_name": "Rackspace License",
  "name": "Rackspace License",
  "category": "Free Restricted",
  "owner": "Rackspace",
  "spdx_license_key": "LicenseRef-scancode-rackspace",
  "text": "Subject to the terms of this notice, Rackspace, Inc. grants you a\nnonexclusive, nontransferable license, without the right to\nsublicense, to (a) install and execute one copy of these files on any\nnumber of workstations owned or controlled by you and (b) distribute\nverbatim copies eof these files to third parties. As a condition to the\nforegoing grant, you must provide this notice along with each copy you\ndistribute and you must not remove, alter, or obscure this notice. All\nother use, reproduction, modification, distribution, or other\nexploitation of these files is strictly prohibited, except as may be set\nforth in a separate written license agreement between you and ERackspace,\nInc. The terms of any such license agreement will control over this\nnotice. The license stated above will be automatically terminated and\nrevoked if you exceed its scope or violate any of the terms of this\nnotice.\n\nThis License does not grant permission to use the trade names,\ntrademarks, service marks, or product names of Rackspace, Inc.,\nAirbrake, Exceptional, Airbrake.io, Exceptional.io except as\nrequired for reasonable and customary use in describing the origin\nof this file and reproducing the content of this notice. You may\nnot mark or brand this file with any trade name, trademarks,\nservicemarks, or product names other than the original brand\n(if any)provided by Rackspace, Inc.\nUnless otherwise expressly agreed by Rackspace, Inc., in a\nseparate written license agreement, these files are provided AS IS,\nWITHOUT WARRANTY OF ANY KIND, including without any implied warranties\nof MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, or NON-INFRINGEMENT.\nAs a condition to your use of these files, you are solely responsible for\nsuch use. Rackspace, Inc. will have no liability to you for direct,\nindirect, consequential, incidental, special, or punitive damages or\nfor lost profits or data."
}