{
  "key": "radiance-sl-v2.0",
  "short_name": "Radiance Software License v2.0",
  "name": "Radiance Software License, Version 2.0",
  "category": "Copyleft Limited",
  "owner": "Radiance",
  "homepage_url": "https://github.com/LBNL-ETA/Radiance/blob/master/License.txt",
  "spdx_license_key": "LicenseRef-scancode-radiance-sl-v2.0",
  "ignorable_copyrights": [
    "Copyright (c) 1990 to 2022, The Regents of the University of California, through Lawrence Berkeley National Laboratory"
  ],
  "ignorable_holders": [
    "The Regents of the University of California, through Lawrence Berkeley National Laboratory"
  ],
  "text": "The Radiance Software License, Version 2.0\n\nRadiance v5.4 Copyright (c) 1990 to 2022, The Regents of the University of\nCalifornia, through Lawrence Berkeley National Laboratory (subject to receipt\nof any required approvals from the U.S. Dept. of Energy).  All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n(1) Redistributions of source code must retain the above copyright notice,\nthis list of conditions and the following disclaimer.\n\n(2) Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in the\ndocumentation and/or other materials provided with the distribution.\n\n(3) Neither the name of the University of California, Lawrence Berkeley\nNational Laboratory, U.S. Dept. of Energy nor the names of its contributors\nmay be used to endorse or promote products derived from this software\nwithout specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\nYou are under no obligation whatsoever to provide any bug fixes, patches,\nor upgrades to the features, functionality or performance of the source\ncode (\"Enhancements\") to anyone; however, if you choose to make your\nEnhancements available either publicly, or directly to Lawrence Berkeley\nNational Laboratory, without imposing a separate written license agreement\nfor such Enhancements, then you hereby grant the following license: a\nnon-exclusive, royalty-free perpetual license to install, use, modify,\nprepare derivative works, incorporate into other computer software,\ndistribute, and sublicense such enhancements or derivative works thereof,\nin binary and source code form."
}