{
  "key": "realm-platform-extension-2017",
  "short_name": "Realm Platform Extensions License 2017",
  "name": "Realm Platform Extensions License 2017",
  "category": "Proprietary Free",
  "owner": "Realm",
  "homepage_url": "https://github.com/realm/realm-studio/blob/channel/major-10/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-realm-platform-extension-2017",
  "faq_url": "http://realm.io/pricing/",
  "ignorable_copyrights": [
    "Copyright (c) 2011-2017 Realm Inc"
  ],
  "ignorable_holders": [
    "Realm Inc"
  ],
  "ignorable_urls": [
    "http://realm.io/pricing"
  ],
  "text": "Realm Platform Extensions License\n\n  Copyright (c) 2011-2017 Realm Inc All rights reserved\n\n  Redistribution and use in binary form, with or without modification, is\n  permitted provided that the following conditions are met:\n\n  1. You agree not to attempt to decompile, disassemble, reverse engineer or\n  otherwise discover the source code from which the binary code was derived.\n  You may, however, access and obtain a separate license for most of the\n  source code from which this Software was created, at\n  http://realm.io/pricing/.\n\n  2. Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n  3. Neither the name of the copyright holder nor the names of its\n  contributors may be used to endorse or promote products derived from this\n  software without specific prior written permission.\n\n  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE\n  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n  POSSIBILITY OF SUCH DAMAGE."
}