{
  "key": "redpanda-community-la",
  "short_name": "Redpanda Community License Agreement",
  "name": "Redpanda Community License Agreement",
  "category": "Source-available",
  "owner": "Redpanda",
  "homepage_url": "https://github.com/redpanda-data/redpanda/blob/dev/licenses/rcl.md",
  "spdx_license_key": "LicenseRef-scancode-redpanda-community-la",
  "ignorable_urls": [
    "https://cla-assistant.io/redpanda-data/redpanda",
    "https://github.com/redpanda-data/redpanda",
    "https://redpanda.com/contact"
  ],
  "text": "**Redpanda Community License Agreement**\n\nPlease read this Redpanda Community License Agreement (the “Agreement”)\ncarefully before using Redpanda (as defined below), which is offered by\nRedpanda Data, Inc. or its affiliated Legal Entities (“Redpanda Data”).\n\nBy downloading Redpanda or using it in any manner, You agree that You\nhave read and agree to be bound by the terms of this Agreement. If You\nare accessing Redpanda on behalf of a Legal Entity, You represent and\nwarrant that You have the authority to agree to these terms on its\nbehalf and the right to bind that Legal Entity to this Agreement. Use of\nRedpanda is expressly conditioned upon Your assent to all the terms of\nthis Agreement, to the exclusion of all other terms.\n\n1.  **<span class=\"smallcaps\">Definitions</span>.** In addition to other\n    terms defined elsewhere in this Agreement, the terms below have the\n    following meanings.\n\n(a) “Redpanda” shall mean the event streaming platform provided by Redpanda Data, including both Redpanda Core and Redpanda Enterprise Edition, as defined below.\n\n(b) “Redpanda Core” shall mean the version of Redpanda, available free of charge at https://github.com/redpanda-data/redpanda.\n\n(c) “Redpanda Enterprise Edition” shall mean the additional features made available by Redpanda Data, the use of which is subject to additional terms set out below.\n\n(d) “Contribution” shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted Redpanda Data for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to Redpanda Data or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, Redpanda Data for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as “Not a Contribution.”\n\n(e) “Contributor” shall mean any copyright owner or individual or Legal Entity authorized by the copyright owner, other than Redpanda Data, from whom Redpanda Data receives a Contribution that Redpanda Data subsequently incorporates within the Work.\n\n(f) “Derivative Works” shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work, such as a translation, abridgement, condensation, or any other recasting, transformation, or adaptation for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.\n\n(g) “Legal Entity” shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, “control” means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n(h) “License” shall mean the terms and conditions for use, reproduction, and distribution of a Work as defined by this Agreement.\n\n(i) “Licensor” shall mean Redpanda Data or a Contributor, as applicable.\n\n(j) “Object” form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.\n\n(k) “Source” form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.\n\n(l) “Third Party Works” shall mean Works, including Contributions, and other technology owned by a person or Legal Entity other than Redpanda Data, as indicated by a copyright notice that is included in or attached to such Works or technology.\n\n(m) “Work” shall mean the work of authorship, whether in Source or Object form, made available under a License, as indicated by a copyright notice that is included in or attached to the work.\n\n(n) “You” (or “Your”) shall mean an individual or Legal Entity exercising permissions granted by this License.\n\n2.  **<span class=\"smallcaps\">Licenses</span>**.\n\n    1.  **License to Redpanda Core.** The License for Redpanda Core is\n        the Business Source License v.1.1 (\"BSL License\"). Please see\n        the text of the Redpanda [BSL License](bsl.md) for full terms.\n        Redpanda Core is a no-cost, entry-level license and as such,\n        contains the following disclaimers: TO THE EXTENT PERMITTED BY\n        APPLICABLE LAW, REDPANDA CORE IS PROVIDED ON AN “AS IS” BASIS.\n        LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS, EXPRESS\n        OR IMPLIED, INCLUDING (WITHOUT LIMITATION) WARRANTIES OF\n        MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\n        NON-INFRINGEMENT, AND TITLE. For clarity, the terms of this\n        Agreement, other than the relevant definitions in Section 1 and\n        this Section 2(a) do not apply to Redpanda Core.\n\n    2.  **License to Redpanda Enterprise Edition.**\n\n        1.  ***Grant of Copyright License:*** Subject to the terms of\n            this Agreement, Licensor hereby grants to You a worldwide,\n            non-exclusive, non-transferable limited license to\n            reproduce, prepare Enterprise Derivative Works (as defined\n            below) of, publicly display, publicly perform, sublicense,\n            and distribute Redpanda Enterprise Edition for Your business\n            purposes, for so long as You are not in violation of this\n            Section 2(b) and are current on all payments required by\n            Section 4 below.\n\n        2.  ***Grant of Patent License:*** Subject to the terms of this\n            Agreement, Licensor hereby grants to You a worldwide,\n            non-exclusive, non-transferable limited patent license to\n            make, have made, use, offer to sell, sell, import, and\n            otherwise transfer Redpanda Enterprise Edition, where such\n            license applies only to those patent claims licensable by\n            Licensor that are necessarily infringed by their\n            Contribution(s) alone or by combination of their\n            Contribution(s) with the Work to which such Contribution(s)\n            was submitted. If You institute patent litigation against\n            any entity (including a cross-claim or counterclaim in a\n            lawsuit) alleging that the Work or a Contribution\n            incorporated within the Work constitutes direct or\n            contributory patent infringement, then any patent licenses\n            granted to You under this License for that Work shall\n            terminate as of the date such litigation is filed.\n\n        3.  ***License to Third Party Works:*** From time to time\n            Redpanda Data may use, or provide You access to, Third Party\n            Works in connection Redpanda Enterprise Edition. You\n            acknowledge and agree that in addition to this Agreement,\n            Your use of Third Party Works is subject to all other terms\n            and conditions set forth in the License provided with or\n            contained in such Third Party Works. Some Third Party Works\n            may be licensed to You solely for use with Redpanda\n            Enterprise Edition under the terms of a third party License,\n            or as otherwise notified by Redpanda Data, and not under the\n            terms of this Agreement. You agree that the owners and third\n            party licensors of Third Party Works are intended third\n            party beneficiaries to this Agreement.\n\n        4.  ***Use Restriction:*** You may make use of Redpanda\n            Enterprise Edition, provided that you may not use Redpanda\n            Enterprise Edition for a Streaming or Queuing Service. A\n            “Streaming or Queueing Service” is a commercial offering\n            that allows third parties (other than your employees and\n            individual contractors) to access the functionality of\n            Redpanda Enterprise Edition by performing an action directly\n            or indirectly that causes the creation of a topic in the\n            Work. For clarity, a Streaming or Queuing Service would\n            include providers of infrastructure services, such as cloud\n            services, hosting services, data center services and\n            similarly situated third parties (including affiliates of\n            such entities) that would offer Redpanda Enterprise Edition\n            in connection with a broader service offering to customers\n            or subscribers of such of such third party’s core services.\n\n3.  **<span class=\"smallcaps\">Support</span>.** From time to time, in\n    its sole discretion, Redpanda Data may offer professional services or\n    support for Redpanda, which may now or in the future be subject to\n    additional fees.\n\n4.  **<span class=\"smallcaps\">Fees for Redpanda Enterprise Edition or\n    Redpanda Support.</span>**\n\n    1.  **Fees.** The License to Redpanda Enterprise Edition is\n        conditioned upon Your payment of the fees specified on\n        [pricing](https://redpanda.com/contact) which You agree to pay to Redpanda Data in accordance\n        with the payment terms set out on that page. Any professional\n        services or support for Redpanda may also be subject to Your\n        payment of fees, which will be specified by Redpanda Data when you\n        sign up to receive such professional services or support.\n        Redpanda Data reserves the right to change the fees at any time\n        with prior written notice; for recurring fees, any such\n        adjustments will take effect as of the next payment period.\n\n    2.  **Overdue Payments and Taxes.** Overdue payments are subject to\n        a service charge equal to the lesser of 1.5% per month or the\n        maximum legal interest rate allowed by law, and You shall pay\n        all Redpanda Data’s reasonable costs of collection, including court\n        costs and attorneys’ fees. Fees are stated and payable in U.S.\n        dollars and are exclusive of all sales, use, value added and\n        similar taxes, duties, withholdings and other governmental\n        assessments (but excluding taxes based on Redpanda Data’s income)\n        that may be levied on the transactions contemplated by this\n        Agreement in any jurisdiction, all of which are Your\n        responsibility unless you have provided Redpanda Data with a valid\n        tax-exempt certificate.\n\n    3.  **Record-keeping and Audit.** If fees for Redpanda Enterprise\n        Edition are based on the number of cores or servers running on\n        Redpanda Enterprise Edition or another use-based unit of\n        measurement, You must maintain complete and accurate records\n        with respect Your use of Redpanda Enterprise Edition and will\n        provide such records to Redpanda Data for inspection or audit upon\n        Redpanda Data’s reasonable request. If an inspection or audit\n        uncovers additional usage by You for which fees are owed under\n        this Agreement, then You shall pay for such additional usage at\n        Redpanda Data’s then-current rates.\n\n5.  **<span class=\"smallcaps\">Trial License.</span>** If You have signed\n    up for a trial or evaluation of Redpanda Enterprise Edition, Your\n    License to Redpanda Enterprise Edition is granted without charge for\n    the trial or evaluation period specified when You signed up, or if\n    no term was specified, for thirty (30) calendar days, provided that\n    Your License is granted solely for purposes of Your internal\n    evaluation of Redpanda Enterprise Edition during the trial or\n    evaluation period (a “Trial License”). You may not use Redpanda\n    Enterprise Edition under a Trial License more than once in any\n    twelve (12) month period. Redpanda Data may revoke a Trial License at\n    any time and for any reason. Sections 3, 4, 9 and 11 of this\n    Agreement do not apply to Trial Licenses.\n\n6.  **<span class=\"smallcaps\">Redistribution.</span>** You may reproduce\n    and distribute copies of the Work or Derivative Works thereof in any\n    medium, with or without modifications, and in Source or Object form,\n    provided that You meet the following conditions:\n\n    1.  You must give any other recipients of the Work or Derivative\n        Works a copy of this License; and\n\n    2.  You must cause any modified files to carry prominent notices\n        stating that You changed the files; and\n\n    3.  You must retain, in the Source form of any Derivative Works that\n        You distribute, all copyright, patent, trademark, and\n        attribution notices from the Source form of the Work, excluding\n        those notices that do not pertain to any part of the Derivative\n        Works; and\n\n    4.  If the Work includes a “NOTICE” text file as part of its\n        distribution, then any Derivative Works that You distribute must\n        include a readable copy of the attribution notices contained\n        within such NOTICE file, excluding those notices that do not\n        pertain to any part of the Derivative Works, in at least one of\n        the following places: within a NOTICE text file distributed as\n        part of the Derivative Works; within the Source form or\n        documentation, if provided along with the Derivative Works; or,\n        within a display generated by the Derivative Works, if and\n        wherever such third-party notices normally appear. The contents\n        of the NOTICE file are for informational purposes only and do\n        not modify the License. You may add Your own attribution notices\n        within Derivative Works that You distribute, alongside or as an\n        addendum to the NOTICE text from the Work, provided that such\n        additional attribution notices cannot be construed as modifying\n        the License.\n\n    5.  You may add Your own copyright statement to Your modifications\n        and may provide additional or different license terms and\n        conditions for use, reproduction, or distribution of Your\n        modifications, or for any such Derivative Works as a whole,\n        provided Your use, reproduction, and distribution of the Work\n        otherwise complies with the conditions stated in this License.\n\n    6.  **Enterprise Derivative Works.** Derivative Works of Redpanda\n        Enterprise Edition (“Enterprise Derivative Works”) may be made,\n        reproduced and distributed in any medium, with or without\n        modifications, in Source or Object form, provided that each\n        Enterprise Derivative Work will be considered to include a\n        License to Redpanda Enterprise Edition and thus will be subject\n        to the payment of fees to Redpanda Data by any user of the\n        Enterprise Derivative Work.\n\n7.  **<span class=\"smallcaps\">Submission of Contributions.</span>**\n    Unless You explicitly state otherwise, any Contribution\n    intentionally submitted for inclusion in Redpanda by You to\n    Redpanda Data shall be under the terms and conditions of\n    [https://cla-assistant.io/redpanda-data/redpanda] (which is based off of the\n    Apache License), without any additional terms or conditions,\n    payments of royalties or otherwise to Your benefit. Notwithstanding\n    the above, nothing herein shall supersede or modify the terms of any\n    separate license agreement You may have executed with Redpanda Data\n    regarding such Contributions.\n\n8.  **<span class=\"smallcaps\">Trademarks.</span>** This License does not\n    grant permission to use the trade names, trademarks, service marks,\n    or product names of Licensor, except as required for reasonable and\n    customary use in describing the origin of the Work and reproducing\n    the content of the NOTICE file.\n\n9.  **<span class=\"smallcaps\">Limited Warranty.</span>**\n\n    1.  **Warranties.** Redpanda Data warrants to You that: (i) Redpanda\n        Enterprise Edition will materially perform in accordance with\n        the applicable documentation for ninety (90) days after initial\n        delivery to You; and (ii) any professional services performed by\n        Redpanda Data under this Agreement will be performed in a\n        workmanlike manner, in accordance with general industry\n        standards.\n\n    2.  **Exclusions.** Redpanda Data’s warranties in this Section 9 do not\n        extend to problems that result from: (i) Your failure to\n        implement updates issued by Redpanda Data during the warranty\n        period; (ii) any alterations or additions (including Enterprise\n        Derivative Works and Contributions) to Redpanda not performed by\n        or at the direction of Redpanda Data; (iii) failures that are not\n        reproducible by Redpanda Data; (iv) operation of Redpanda\n        Enterprise Edition in violation of this Agreement or not in\n        accordance with its documentation; (v) failures caused by\n        software, hardware or products not licensed or provided by\n        Redpanda Data hereunder; or (vi) Third Party Works.\n\n    3.  **Remedies.** In the event of a breach of a warranty under this\n        Section 9, Redpanda Data will, at its discretion and cost, either\n        repair, replace or re-perform the applicable Works or services\n        or refund a portion of fees previously paid to Redpanda Data that\n        are associated with the defective Works or services. This is\n        Your exclusive remedy, and Redpanda Data’s sole liability, arising\n        in connection with the limited warranties herein.\n\n10.  **<span class=\"smallcaps\">Disclaimer of Warranty.</span>** EXCEPT AS\n    SET OUT IN SECTION 9, UNLESS REQUIRED BY APPLICABLE LAW, LICENSOR\n    PROVIDES THE WORK (AND EACH CONTRIBUTOR PROVIDES ITS CONTRIBUTIONS)\n    ON AN “AS IS” BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,\n    EITHER EXPRESS OR IMPLIED, ARISING OUT OF COURSE OF DEALING, COURSE\n    OF PERFORMANCE, OR USAGE IN TRADE, INCLUDING, WITHOUT LIMITATION,\n    ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT,\n    MERCHANTABILITY, CORRECTNESS, RELIABILITY, OR FITNESS FOR A\n    PARTICULAR PURPOSE, ALL OF WHICH ARE HEREBY DISCLAIMED. YOU ARE\n    SOLELY RESPONSIBLE FOR DETERMINING THE APPROPRIATENESS OF USING OR\n    REDISTRIBUTING WORKS AND ASSUME ANY RISKS ASSOCIATED WITH YOUR\n    EXERCISE OF PERMISSIONS UNDER THE APPLICABLE LICENSE FOR SUCH WORKS.\n\n11. **<span class=\"smallcaps\">Limited Indemnity.</span>**\n\n    1.  **Indemnity.** Redpanda Data will defend, indemnify and hold You\n        harmless against any third party claims, liabilities or expenses\n        incurred (including reasonable attorneys’ fees), as well as\n        amounts finally awarded in a settlement or a non-appealable\n        judgement by a court (“Losses”), to the extent arising from any\n        claim or allegation by a third party that Redpanda Enterprise\n        Edition infringes or misappropriates a valid United States\n        patent, copyright or trade secret right of a third party;\n        provided that You give Redpanda Data: (i) prompt written notice of\n        any such claim or allegation; (ii) sole control of the defense\n        and settlement thereof; and (iii) reasonable cooperation and\n        assistance in such defense or settlement. If any Work within\n        Redpanda Enterprise Edition becomes or, in Redpanda Data’s opinion,\n        is likely to become, the subject of an injunction, Redpanda Data\n        may, at its option, (A) procure for You the right to continue\n        using such Work, (B) replace or modify such Work so that it\n        becomes non-infringing without substantially compromising its\n        functionality, or, if (A) and (B) are not commercially\n        practicable, then (C) terminate Your license to the allegedly\n        infringing Work and refund to You a prorated portion of the\n        prepaid and unearned fees for such infringing Work. The\n        foregoing states the entire liability of Redpanda Data with respect\n        to infringement of patents, copyrights, trade secrets or other\n        intellectual property rights.\n\n    2.  **Exclusions.** The foregoing obligations shall not apply\n        to: (i) Works modified by any party other than Redpanda Data\n        (including Enterprise Derivative Works and Contributions), if\n        the alleged infringement relates to such modification, (ii)\n        Works combined or bundled with any products, processes or\n        materials not provided by Redpanda Data where the alleged\n        infringement relates to such combination, (iii) use of a version\n        of Redpanda Enterprise Edition other than the version that was\n        current at the time of such use, as long as a non-infringing\n        version had been released, (iv) any Works created to Your\n        specifications, (v) infringement or misappropriation of any\n        proprietary right in which You have an interest, or (vi) Third\n        Party Works. You will defend, indemnify and hold Redpanda Data\n        harmless against any Losses arising from any such claim or\n        allegation, subject to conditions reciprocal to those in Section\n        11(a).\n\n12. **<span class=\"smallcaps\">Limitation of Liability.</span>** In no\n    event and under no legal or equitable theory, whether in tort\n    (including negligence), contract, or otherwise, unless required by\n    applicable law (such as deliberate and grossly negligent acts), and\n    notwithstanding anything in this Agreement to the contrary, shall\n    Licensor or any Contributor be liable to You for (i) any amounts in\n    excess, in the aggregate, of the fees paid by You to Redpanda Data\n    under this Agreement in the twelve (12) months preceding the date\n    the first cause of liability arose), or (ii) any indirect, special,\n    incidental, punitive, exemplary, reliance, or consequential damages\n    of any character arising as a result of this Agreement or out of the\n    use or inability to use the Work (including but not limited to\n    damages for loss of goodwill, profits, data or data use, work\n    stoppage, computer failure or malfunction, cost of procurement of\n    substitute goods, technology or services, or any and all other\n    commercial damages or losses), even if such Licensor or Contributor\n    has been advised of the possibility of such damages. THESE\n    LIMITATIONS SHALL APPLY NOTWITHSTANDING THE FAILURE OF THE ESSENTIAL\n    PURPOSE OF ANY LIMITED REMEDY.\n\n13. **<span class=\"smallcaps\">Accepting Warranty or Additional\n    Liability.</span>** While redistributing Works or Derivative Works\n    thereof, and without limiting your obligations under Section 6, You\n    may choose to offer, and charge a fee for, acceptance of support,\n    warranty, indemnity, or other liability obligations and/or rights\n    consistent with this License. However, in accepting such\n    obligations, You may act only on Your own behalf and on Your sole\n    responsibility, not on behalf of any other Contributor, and only if\n    You agree to indemnify, defend, and hold Redpanda Data and each other\n    Contributor harmless for any liability incurred by, or claims\n    asserted against, such Contributor by reason of your accepting any\n    such warranty or additional liability.\n\n14. **<span class=\"smallcaps\">General.</span>**\n\n    1.  **Relationship of Parties.** You and Redpanda Data are independent\n        contractors, and nothing herein shall be deemed to constitute\n        either party as the agent or representative of the other or both\n        parties as joint venturers or partners for any purpose.\n\n    2.  **Export Control.** You shall comply with the U.S. Foreign\n        Corrupt Practices Act and all applicable export laws,\n        restrictions and regulations of the U.S. Department of Commerce,\n        and any other applicable U.S. and foreign authority.\n\n    3.  **Assignment.** This Agreement and the rights and obligations\n        herein may not be assigned or transferred, in whole or in part,\n        by You without the prior written consent of Redpanda Data. Any\n        assignment in violation of this provision is void. This\n        Agreement shall be binding upon, and inure to the benefit of,\n        the successors and permitted assigns of the parties.\n\n    4.  **Governing Law.** This Agreement shall be governed by and\n        construed under the laws of the State of California and the\n        United States without regard to conflicts of laws provisions\n        thereof, and without regard to the Uniform Computer Information\n        Transactions Act.\n\n    5.  **Attorneys’ Fees.** In any action or proceeding to enforce\n        rights under this Agreement, the prevailing party shall be\n        entitled to recover its costs, expenses and attorneys’ fees.\n\n    6.  **Severability.** If any provision of this Agreement is held to\n        be invalid, illegal or unenforceable in any respect, that\n        provision shall be limited or eliminated to the minimum extent\n        necessary so that this Agreement otherwise remains in full force\n        and effect and enforceable.\n\n    7.  **Entire Agreement; Waivers; Modification.** This Agreement\n        constitutes the entire agreement between the parties relating to\n        the subject matter hereof and supersedes all proposals,\n        understandings, or discussions, whether written or oral,\n        relating to the subject matter of this Agreement and all past\n        dealing or industry custom. The failure of either party to\n        enforce its rights under this Agreement at any time for any\n        period shall not be construed as a waiver of such rights. No\n        changes, modifications or waivers to this Agreement will be\n        effective unless in writing and signed by both parties."
}