{
  "key": "rh-eula-lgpl",
  "short_name": "Red Hat EULA JBoss Enterprise Middleware License",
  "name": "Red Hat EULA JBoss Enterprise Middleware License",
  "category": "Copyleft Limited",
  "owner": "Red Hat",
  "homepage_url": "https://www.redhat.com/f/pdf/licenses/GLOBAL_EULA_JBoss_English_20101110.pdf",
  "spdx_license_key": "LicenseRef-scancode-rh-eula-lgpl",
  "ignorable_copyrights": [
    "Copyright (c) 2010 Red Hat, Inc."
  ],
  "ignorable_holders": [
    "Red Hat, Inc."
  ],
  "ignorable_urls": [
    "http://www.redhat.com/about/corporate/trademark/",
    "http://www.redhat.com/licenses/thirdparty/eula.html"
  ],
  "text": "This end user license agreement (\"EULA\") governs the use of the JBoss\nEnterprise Middleware and any related updates, source code, appearance,\nstructure and organization (the \"Programs\"), regardless of the delivery\nmechanism.\n\n1. License Grant. Subject to the following terms, Red Hat, Inc. (\"Red\nHat\") grants to you a perpetual, worldwide license to the Programs (each\nof which may include multiple software components) pursuant to the GNU\nLesser General Public License v. 2.1. With the exception of certain\nimage files identified in Section 2 below, each software component is\ngoverned by a license that permits you to run, copy, modify, and\nredistribute (subject to certain obligations in some cases) the software\ncomponent. This EULA pertains solely to the Programs and does not limit\nyour rights under, or grant you rights that supersede, the license terms\napplicable to any particular component.\n\n2. Intellectual Property Rights. The Programs and each of their\ncomponents are owned by Red Hat and other licensors and are protected\nunder copyright law and under other laws as applicable. Title to the\nPrograms and any component, or to any copy, modification, or merged\nportion shall remain with Red Hat and other licensors, subject to the\napplicable license. The \"JBoss\" trademark, \"Red Hat\" trademark, the\nindividual Program trademarks, and the \"Shadowman\" logo are registered\ntrademarks of Red Hat and its affiliates in the U.S. and other\ncountries. This EULA does not permit you to distribute the Programs\nusing Red Hat's trademarks, regardless of whether they have been\nmodified. You may make a commercial redistribution of the Programs only\nif (a) permitted under a separate written agreement with Red Hat\nauthorizing such commercial redistribution or (b) you remove and\nreplaced all occurrences of Red Hat trademarks and logos. Modifications\nto the software may corrupt the Programs. You should read the\ninformation found at http://www.redhat.com/about/corporate/trademark/\nbefore distributing a copy of the Programs.\n\n3. Limited Warranty. Except as specifically stated in this Section 3, a\nseparate agreement with Red Hat, or a license for a particular\ncomponent, to the maximum extent permitted under applicable law, the\nPrograms and the components are provided and licensed \"as is\" without\nwarranty of any kind, expressed or implied, including the implied\nwarranties of merchantability, non-infringement or fitness for a\nparticular purpose. Red Hat warrants that the media on which the\nPrograms and the components are provided will be free from defects in\nmaterials and manufacture under normal use for a period of 30 days from\nthe date of delivery to you. Neither Red Hat nor its affiliates warrant\nthat the functions contained in the Programs will meet your requirements\nor that the operation of the Programs will be entirely error free,\nappear or perform precisely as described in the accompanying\ndocumentation, or comply with regulatory requirements. This warranty\nextends only to the party that purchases subscription services for the\nPrograms from Red Hat and/or its affiliates or a Red Hat authorized\ndistributor.\n\n4. Limitation of Remedies and Liability. To the maximum extent permitted\nby applicable law, your exclusive remedy under this EULA is to return\nany defective media within 30 days of delivery along with a copy of your\npayment receipt and Red Hat, at its option, will replace it or refund\nthe money you paid for the media. To the maximum extent permitted under\napplicable law, under no circumstances will Red Hat, its affiliates, any\nRed Hat authorized distributor, or the licensor of any component\nprovided to you under this EULA be liable to you for any incidental or\nconsequential damages, including lost profits or lost savings arising\nout of the use or inability to use the Programs or any component, even\nif Red Hat, its affiliates, an authorized distributor, and/or licensor\nhas been advised of the possibility of such damages. In no event shall\nRed Hat's or its affiliates’ liability, an authorized distributor’s\nliability or the liability of the licensor of a component provided to\nyou under this EULA exceed the amount that you paid to Red Hat for the\nmedia under this EULA.\n\n5. Export Control. As required by the laws of the United States and\nother countries, you represent and warrant that you: (a) understand that\nthe Programs and their components may be subject to export controls\nunder the U.S. Commerce Department’s Export Administration Regulations\n(\"EAR\"); (b) are not located in a prohibited destination country under\nthe EAR or U.S. sanctions regulations (currently Cuba, Iran, Iraq, North\nKorea, Sudan and Syria, subject to change as posted by the United States\ngovernment); (c) will not export, re-export, or transfer the Programs to\nany prohibited destination, persons or entities on the U.S. Bureau of\nIndustry and Security Denied Parties List or Entity List, or the U.S.\nOffice of Foreign Assets Control list of Specially Designated Nationals\nand Blocked Persons, or any similar lists maintained by other countries,\nwithout the necessary export license(s) or authorizations(s); (d) will\nnot use or transfer the Programs for use in connection with any nuclear,\nchemical or biological weapons, missile technology, or military end-uses\nwhere prohibited by an applicable arms embargo, unless authorized by the\nrelevant government agency by regulation or specific license; (e)\nunderstand and agree that if you are in the United States and export or\ntransfer the Programs to eligible end users, you will, to the extent\nrequired by EAR Section 740.17(e), submit semi-annual reports to the\nCommerce Department’s Bureau of Industry and Security, which include the\nname and address (including country) of each transferee; and (f)\nunderstand that countries including the United States may restrict the\nimport, use, or export of encryption products (which may include the\nPrograms and the components) and agree that you shall be solely\nresponsible for compliance with any such import, use, or export\nrestrictions.\n\n6. Third Party Programs. Red Hat may distribute third party software\nprograms with the Programs that are not part of the Programs. These\nthird party software programs are not required to run the Programs, are\nprovided as a convenience to you, and are subject to their own license\nterms. The license terms either accompany the third party software\nprograms or can be viewed at\nhttp://www.redhat.com/licenses/thirdparty/eula.html. If you do not agree\nto abide by the applicable license terms for the third party software\nprograms, then you may not install them. If you wish to install the\nthird party software programs on more than one system or transfer the\nthird party software programs to another party, then you must contact\nthe licensor of the applicable third party software programs.\n\n7. General. If any provision of this EULA is held to be unenforceable,\nthe enforceability of the remaining provisions shall not be affected.\nAny claim, controversy or dispute arising under or relating to this EULA\nshall be governed by the laws of the State of New York and of the United\nStates, without regard to any conflict of laws provisions. The rights\nand obligations of the parties to this EULA shall not be governed by the\nUnited Nations Convention on the International Sale of Goods.\n\nCopyright © 2010 Red Hat, Inc. All rights reserved. \"Red Hat,\" \"JBoss\"\nand the JBoss logo are registered trademarks of Red Hat, Inc. All other\ntrademarks are the property of their respective owners."
}