{
  "key": "ril-2019",
  "short_name": "RIL 2019",
  "name": "RIL (Rick's Internet Licence) 3-Clause License 2019",
  "category": "Permissive",
  "owner": "SupportIntelligence",
  "homepage_url": "https://github.com/SupportIntelligence/Icewater/blob/master/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-ril-2019",
  "text": "RIL (Rick's Internet Licence) 3-Clause License\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n * If you use this and you meet mee in person you SHOULD offer me a drink and  a meal. \n   Should you have come to my place and I've fed you before you can offer me anything you MUST\n   offer thanks. If you are a company using this and you have't paid for it you SHOULD tell me \n   how it has helped and the offer me a beer or scotch. If you have given this to your customers \n   you should offer me bottles or casks of very good spirits and a free place to stay for a week. \n   Rick Wesson reserves the right to ammend this contract in any fuckin state of mind.\n \nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}