{
  "key": "rocket-master-terms-2022",
  "short_name": "Rocket Software Master Terms 2022",
  "name": "Rocket Software Master Terms and Conditions 2022",
  "category": "Commercial",
  "owner": "Rocket Software",
  "homepage_url": "https://github.com/RocketSoftware/jcl-projcl-vscode-ext/blob/master/LICENSE.txt",
  "spdx_license_key": "LicenseRef-scancode-rocket-master-terms-2022",
  "ignorable_copyrights": [
    "(c) Assumption of Defense",
    "(c) Force Majeure"
  ],
  "ignorable_holders": [
    "Assumption of Defense",
    "Force Majeure"
  ],
  "text": "Rocket Software\n\nMaster Terms and Conditions\n\nRocket Software, Inc. or its subsidiary designated on an Order Form (\"Rocket\")\nprovides software Products and related Services according to these Software\nLicense and Services Terms (\"Terms\"). By executing an Order Form dated on or\nafter the date of these Terms, Customer agrees, for itself and its majority\nowned subsidiaries, these Terms apply to the first Order Form Customer executes\n(together, the \"Agreement\") each Order Form thereafter, Customer's rights and\nobligations, and previously purchased Products and Services. Each Order Form is\na separate contract incorporating these Terms and are the entire terms governing\nCustomer's purchase of Products and/or Services. The parties agree that they may\ndo business electronically, including contract formation, order placement and\nacceptance. An order Customer places and Rocket accepts on any Rocket website\nwill create fully enforceable obligations subject to these Terms.\n\nA. GENERAL TERMS\n\n1. INTELLECTUAL PROPERTY OWNERSHIP\n\nRocket, its affiliates or licensors own and retain all right, title and interest\nin all Intellectual Property in Products, Services, Deliverables, Documentation,\n(except as otherwise specified herein), developments, research data, designs,\nlayout, methodologies, processes and procedures, models, formulae, documents,\ndrawings, plans, specifications and other Rocket information, proprietary\nmaterials and all derivative works. To the extent that any right, title or\ninterest in or to any Rocket's Intellectual Property may not automatically vest\nin Rocket by operation of law, Customer irrevocably transfers, assigns and\nconveys all right, title, and interest therein to Rocket. At Rocket's request\nand expense Customer will promptly take any action and execute any documents\nnecessary to vest full title in Rocket or its licensor.\n\n2. CONFIDENTIALITY\n\n(a) Confidential Information. Whether or not disclosed orally or marked as\nconfidential, Confidential Information includes the Agreement; Order Forms,\nProducts, Deliverables, and Services; either party's non-public data or\npersonally identifiable information regarding employees or customer(s) residing\non the party's computer systems; Intellectual Property, and Rocket's proposals,\nspecifications, manuals, product roadmaps, financial data, pricing, and results\nof benchmark tests. Confidential Information does not include information that\nis (i) publicly available without breach of the Agreement; (ii) reasonably shown\nto Disclosing Party's satisfaction to have been known by Receiving Party prior\nto disclosure or independently developed by Receiving Party subsequent to\ndisclosure without breach of these Terms; or (iii) obtained by Receiving Party\nfrom a third party without confidentiality obligation. Products are not deemed\nto be placed in the public domain by Rocket. Receiving Party will promptly\nnotify Disclosing Party if it is compelled by a court or legal process to\ndisclose Confidential Information and will take any reasonable action requested\nby Disclosing Party to maintain the confidentiality of the Confidential\nInformation.\n\n(b) Non-disclosure. Customer will use best efforts to prevent disclosure to\nRocket of any personally identifiable information (PII) regarding Customer's\nemployees or customer(s). Customer is solely responsible for complying with any\nrequirements regarding PII disclosed to Rocket, other than Rocket's\nconfidentiality obligations hereunder. Receiving Party will use Disclosing\nParty's Confidential Information solely to perform its obligations under the\nAgreement. Receiving Party will take commercially reasonable steps to safeguard\nDisclosing Party's Confidential Information, including no less than the steps\ntaken to protect its own Confidential Information. Receiving Party must not\ndisclose Disclosing Party's Confidential Information except to its employees\nbound by written confidentiality obligations, or Affiliates under a duty of\nconfidentiality, no less restrictive than these Terms. Receiving Party must\npromptly notify Disclosing Party in writing of unauthorized use or disclosure of\nConfidential Information. Receiving Party, at its expense, must take all\nreasonable action to recover Confidential Information and prevent further\nunauthorized use or disclosure, including action for seizure and injunctive\nrelief. If Receiving Party fails to do so in a timely manner, Disclosing Party\nmay take reasonable action to do so at Receiving Party's expense, and Receiving\nParty must reasonably cooperate.\n\n3. INTELLECTUAL PROPERTY INDEMNIFICATION\n\n(a) By Rocket.\n\n(i) Rocket will defend, at its expense, a third party legal action, suit or\nproceeding against Customer (\"Claim\") to the extent that a Product, or a\nDeliverable that is a Product proprietary derivative work, as delivered by\nRocket to Customer (\"Indemnified Product\") directly infringes a valid U.S.\npatent or copyright. Rocket will indemnify Customer for any judgment finally\nawarded against Customer or settlement agreed by Rocket for such Claim to the\nextent of the Indemnified Product's infringement, provided (1) Customer notifies\nRocket promptly in writing of the Claim, (2) Rocket has sole control over the\ndefense or settlement, and (3) Customer fully cooperates with Rocket, providing\nall documents and information in Customer's possession relevant to the Claim,\nand Customer makes personnel available to testify or consult with Rocket.\n\n(ii) If an Indemnified Product becomes, or in Rocket's opinion is likely to\nbecome subject to a Claim, Rocket may, at its option and expense, (1) acquire\nthe right for Customer to continue using the Indemnified Product, (2) replace or\nmodify the Indemnified Product or create a workaround so that the Indemnified\nProduct is functionally equivalent and non-infringing, or (3) terminate the\nLicense for the Indemnified Product and give Customer a credit for the Product\nFee paid by Customer for the infringing part of the Indemnified Product, less a\nreasonable allowance for the time Customer used the Indemnified Product.\n\n(iii) Rocket is not obligated or liable for a Claim due to: (1) use of an\nIndemnified Product not according to the Agreement and Documentation, (2)\nmodification of an Indemnified Product made by anyone other than Rocket, or\nmodification made by Rocket for non-standard features or functionality for\nCustomer or according to Customer's directions, (3) any products, equipment,\nsoftware, or data not supplied by Rocket, (4) use of an Indemnified Product\ncombined with any other products, equipment, software, or data not supplied by\nRocket if infringement would not occur without  the combination, (5) a release\nof Indemnified Product other than the most current release available or\nCustomer's failure to install a revision, update or release that would have\neliminated the infringement, (6) Customer's designs, instructions, plans or\nspecifications, or (7) use of an Indemnified Product combined with a Customer or\nthird party use, process or method if infringement would not occur without the\ncombination.\n\n(b) By Customer.\n\n(i) Customer will defend, at its expense, a third party claim against Rocket (1)\nthat any product, information, data or material provided by Customer infringes\nanother party's intellectual property rights, other than a Claim for which\nRocket is responsible according to Section A3(a) above, or (2) arising from\nCustomer's or its Affiliates' failure to comply with the License or\nConfidentiality terms of the Agreement.\n\n(ii) Customer will indemnify Rocket for any damages, or amounts agreed as\nsettlement, for the claim, provided (1) Rocket notifies Customer promptly in\nwriting of the claim, (2) Customer has sole control over the defense or\nsettlement, and (3) Rocket cooperates with Customer, providing all documents and\ninformation in Rocket's possession relevant to the claim, and Rocket makes\npersonnel available to testify or consult with Customer as reasonably needed.\n\n(c) Assumption of Defense. If a party fails to defend or settle a claim\naccording to this Section A3 in a timely manner, the other party may assume\ndefense of the claim at the indemnifying party's expense, and the indemnifying\nparty will reasonably cooperate. Neither party may make an admission of fault on\nbehalf of the other party, or agree to the settlement of a claim binding the\nother party that does not contain a full release of liability for the other\nparty, without written consent. (d) Limitation. THIS SECTION A3 DESCRIBES EACH\nPARTY'S SOLE LIABILITY AND THE OTHER PARTY'S SOLE REMEDY FOR INTELLECTUAL\nPROPERTY INFRINGEMENT INDEMNIFICATION.\n\n(d) Professional Services Indemnity.  Each party will defend, at their expense,\nany action brought against the other party for bodily injury, death, or tangible\nproperty damage to the extent caused by the gross negligence or willful\nmisconduct of the defending party relating to a Professional Services\nengagement. The defending party will indemnify the other party for and pay\ndamages finally awarded in such action, or agreed as a settlement by the\nindemnifying party, if (a) the other party promptly notifies the indemnifying\nparty in writing of the claim, (b) the indemnifying party has sole control over\nthe defense or settlement, and (c) the other party cooperates in the\nindemnifying party's defense or settlement. If a party with an indemnification\nobligation fails to defend or settle a claim in a timely manner, the other party\nmay assume the defense at the obligated party's expense, and the obligated party\nwill reasonably cooperate. Neither party may, without the other party's written\nconsent, agree to a settlement that: (a) binds the other party, (b) does not\ncontain a full release of the other party, or (c) admits fault on behalf of the\nother party. THIS SECTION A3(d) DESCRIBES EACH PARTY'S SOLE LIABILITY AND THE\nOTHER PARTY'S SOLE REMEDY FOR PROFESSIONAL SERVICES INDEMNIFICATION.\n\n4. LIMITATION OF LIABILITY\n\n(a) ROCKET, ITS AFFILIATES AND LICENSORS WILL NOT BE LIABLE FOR (i) ANY\nCONSEQUENTIAL, INDIRECT, SPECIAL, PUNITIVE OR INCIDENTAL DAMAGES, (ii) ANY\nINTERRUPTION OF BUSINESS OR OPERATIONS, COST OF COVER, GOODWILL, TOLL FRAUD, OR\nLOSS OF DATA, PROFITS, OR REVENUE, OR FAILURE OF A REMEDY TO ACHIEVE ITS\nESSENTIAL PURPOSE.\n\n(b) EXCEPT FOR A CLAIM FOR INFRINGEMENT UNDER SECTION A3, DEATH OR BODILY INJURY\nCLAIMS, TANGIBLE PROPERTY DAMAGE, WILLFUL MISCONDUCT, OR FRAUD, ROCKET, ITS\nAFFILIATES AND LICENSORS WILL NOT BE LIABLE FOR ANY DAMAGES THAT EXCEED THE\nAMOUNT CUSTOMER PAID IN THE PRECEDING 12 MONTHS FOR THE PRODUCT OR SERVICE THAT\nGAVE RISE TO THE CLAIM.\n\n(c) THE LIMITATIONS IN THIS SECTION A4 WILL APPLY TO ANY DAMAGES, HOWEVER\nCAUSED, UNDER ANY THEORY OF LIABLITY, WHETHER FOR BREACH OF CONTRACT, TORT,\nMISREPRESENTATION, NEGLIGENCE, THE USE OR PERFORMANCE OF A PRODUCT OR SERVICE,\nOR OTHERWISE, AND REGARDLESS OF WHETHER THE DAMAGES WERE FORESEEABLE OR\nUNFORSEEABLE. ROCKET WILL NOT BE LIABLE FOR ANY CLAIM BROUGHT MORE THAN 12\nMONTHS AFTER CUSTOMER BECAME AWARE OF THE ISSUE GIVING RISE TO THE CLAIM.\nROCKET'S FAILURE TO EXERCISE A RIGHT OR REMEDY IS NOT A WAIVER.\n\n5. DISPUTE RESOLUTION\n\nThe parties will attempt in good faith to resolve any controversy or claim\npromptly through business discussions and will, upon written request, escalate a\ndispute to executive management for resolution.  If the parties fail to resolve\nthe dispute within 30 days of written request, or any longer period agreed in\nwriting, the parties may pursue the remedies to which they are entitled. This\nclause will not restrict either party's right to seek injunctive relief.\n\n6. INJUNCTIVE RELIEF\n\nCustomer's failure to comply with the License or Confidentiality terms of the\nAgreement would result in irreparable harm to Rocket that may be intangible but\nreal and is incapable of complete remedy by award of damages. Customer agrees\n(a) Rocket has the right to an injunction or other court order and may proceed\ndirectly to court to specifically enforce Customer's obligations, (b) no finding\nof irreparable harm or other condition to injunctive relief is required, (c) an\norder may be entered to compel Customer to act or refrain from acting or\nthreatened action, and (d) if an injunction is granted, Customer will pay\nRocket's reasonable expenses and attorney fees, in addition to any other relief\ngranted. Rocket shall have the right to pursue all remedies at law and in equity\nfor such a breach.\n\n7. MISCELLANEOUS\n\n(a) Agreement. The Agreement supersedes all other oral or written terms,\nproposals or representations in effect between the parties regarding Rocket\nProducts and Services. Any terms in a subsequent or contemporaneous Order Form\nthat are inconsistent with these Terms will control for that Order Form only,\nand the General Terms may only be modified by a written amendment signed by both\nparties. Inconsistent terms of Customer's purchase order are excluded regardless\nof Rocket accepting the purchase order for payment purposes. If any Agreement\nterm is illegal, invalid, or unenforceable, the other terms remain in full force\nand effect and any term that is intended to survive the Agreement termination\nwill survive.\n\n(b) Assignment. Customer may not assign the Agreement, an Order Form, or any of\nits obligations, rights or remedies, in whole or in part, without Rocket's prior\nwritten approval in its sole discretion.\n\n(c) Force Majeure. Neither party is liable for delay or failing to perform its\nobligations due to a cause beyond its reasonable control and without fault or\nnegligence, except Customer's failure to perform its payment obligations.\n\n(d) Governing Law, Jurisdiction and Region-Specific Terms Massachusetts laws\ngovern the Agreement, the parties' performance, rights and obligations,\nexcluding conflict of law principles that would apply the law of any other\njurisdiction. Each party waives the right to jury trial for a claim in law or\nequity. The United Nations Convention on Contracts for the International Sale of\nGoods and the Uniform Computer Information Transaction Act, as adopted, do not\napply. US, North and South America, and Rest of World. For customers located in\nthe United States, North and South America, and any other jurisdiction not\ncovered by the region-specific terms below (Rest of World), the following terms\napply: Governing Law; This Agreement is governed by the laws of the Commonwealth\nof Massachusetts and the United States, without regard to choice or conflict of\nlaw rules thereof.  U.S. Government Use. The Rocket Services are based upon\ncommercial computer software. If the user or licensee of an Rocket Service is an\nagency, department or other entity of the United States Government, the use,\nduplication, reproduction, release, modification, disclosure or transfer of the\nRocket Service, or any related documentation of any kind, including technical\ndata and manuals, is restricted by a license agreement or by this Agreement in\naccordance with Federal Acquisition Regulations 12.211 (Technical Data) and\n12.212 (Computer Software) for civilian purposes and Defense Federal Acquisition\nRegulation Supplement 227.7202-3 (Rights in Commercial Computer Software or\nComputer Software Documentation). The Rocket Services were developed fully at\nprivate expense. All other use is prohibited. If greater rights are needed, a\nmutually acceptable written amendment specifically conveying these rights must\nbe included as part of this Agreement.  General. The Uniform Computer\nInformation Transactions Act (UCITA) do not apply to this Agreement regardless\nof when or where adopted.\n\nUK, IE, Middle East, Africa, Russia, and India. For customers located in the\nRepublic of Ireland, the United Kingdom, British Crown Dependencies, British\nOverseas Territories, Middle East, Africa, Russia, and India the following terms\napply: Governing Law; Jurisdiction and Venue. This Agreement is governed by the\nlaws of England and Wales and the parties submit to the exclusive jurisdiction\nand venue of courts located in England.\n\nGermany, Austria, and Switzerland (\"DACH\"). For customers located in DACH, the\nfollowing terms apply: Governing Law; Jurisdiction and Venue. This Agreement is\ngoverned by the laws of Germany and the parties submit to the exclusive\njurisdiction and venue of courts located in Germany.  Clarification on Liability\nCap under Section A.4(Limitation of Liability). THE PARTIES AGREE THAT THE\nLIABILITY CAP AT SECTION A.4 APPLIES FOR SLIGHTLY NEGLIGENT INFRINGEMENT OF A\nMATERIAL CONTRACTUAL OBLIGATION, WHOSE FULFILLMENT IS ESSENTIAL IN ACCOMPLISHING\nTHE CONTRACT AND ON WHOSE FULFILLMENT THE OTHER PARTY CAN REGULARLY DEPEND\n(\"CARDINAL DUTY\"/ \"KARDINALPFLICHT\"). THE PARTIES SPECIFICALLY AGREE THAT THE\nTYPICAL FORESEEABLE DAMAGE AND BREACHES OF A CARDINAL DUTY WILL NOT EXCEED IN\nAGGREGATE THE LIABILITY CAP SET OUT IN SECTION A.4.  Additional Exceptions on\nLiability under Section A.4 NONE OF THE LIMITATIONS IN SECTION A.4 EXCLUDES\nEITHER PARTY'S LIABILITY FOR DAMAGES DIRECTLY RESULTING FROM: (I) INTENT; (II)\nGROSS NEGLIGENCE; (III) CULPABLE INJURY TO LIFE, BODY AND HEALTH; (IV) IN CASE\nOF A BREACH OF GUARANTEE, WHICH MUST BE EXPLICITLY NAMED A \"GUARANTEE\"; OR (V)\nMANDATORY LIABILITIES UNDER THE PRODUCT LIABILITY ACT.\n\nNetherlands and Rest of Europe. For customers located in the Netherlands and\nEuropean countries not covered by other region-specific terms above, the\nfollowing terms apply: Governing Law; Jurisdiction and Venue. This Agreement is\ngoverned by the laws of the Netherlands and the parties submit to the exclusive\njurisdiction and venue of court located in Rotterdam. Any court proceedings will\nbe conducted in English, to the extent available.  Additional Exceptions on\nLiability under Section A.4(Limitation on Liability). NONE OF THE LIMITATIONS IN\nSECTION A.4 EXCLUDES EITHER PARTY'S LIABILITY FOR EITHER PARTY'S LIABILITY FOR\nINTENT OR GROSS NEGLIGENCE (OPZET OF BEWUSTE ROEKELOOSHEID) OF THAT PARTY OR ITS\nMANAGERIAL STAFF.\n\nAustralia, Zealand And Asia Pacific. For customers located in Australia and New\nZealand and Asia Pacific the following terms apply: Governing Law; Jurisdiction\nand Venue. This Agreement is governed by the laws of Australia and New South\nWales and the parties submit to the exclusive jurisdiction and venue of courts\nlocated in Sydney.\n\n(e) Compliance with Laws; Export. Customer will comply with U.S., foreign, and\ninternational laws and regulations, including without limitation the U.S.\nForeign Corrupt Practices Act, U.K. Bribery Act, other anti-corruption laws,\nU.S. Export Administration and Treasury Department's Office of Foreign Assets\nControl regulations, and other anti-boycott and import regulations.  Customer\nagrees: (i) that the export, re-export, transfer, re-transfer, sale, supply,\naccess to, or use of the Products, Deliverables or Services to or in a country\nother than the country in which the Product , Deliverables or  Services were\nfirst provided to Customer, or to, by, or for a different end user or end use\nmay require a U.S. or other government license or other authorization; and (ii)\nnot to, directly or indirectly, export, re-export, transfer, re-transfer, sell,\nsupply, or allow access to or use of the Products, Deliverables or Services to,\nin, by, or for sanctioned, embargoed, or prohibited countries, persons, or end\nuses under U.S. or other applicable law (collectively, \"Prohibited Uses\").\nCustomer is responsible for screening for Prohibited Uses and obtaining any\nrequired licenses or other authorizations and shall indemnify Rocket for any\nviolation by Customer of any applicable export controls and/or economic\nsanctions laws and regulations. Rocket may terminate the Agreement and Licenses\nimmediately if Rocket determines, in its sole discretion, that Customer has\nbreached, intends to breach, or insists upon breaching any of the provisions in\nthis clause.\n\n(f) Language. The parties agree that the Agreement and all related documents are\nin English.\n\n(g) No Agency.  Each party is an independent contractor and may not commit the\nother party without written authorization. The Agreement does not create an\nemployment, joint venture, partner, or agency relationship.\n\n(h) Non-Solicitation. For the Agreement term and 1 year after the termination\ndate, without Rocket's written consent, Customer will not, directly or\nindirectly, hire or solicit any Rocket employee, former employee, or contractor\n(except as a result of a generally advertised recruiting solicitation), or\nattempt to or interfere with Rocket's business.\n\n(i) Notice. Notice or approval must be in writing signed by a party's authorized\nrepresentative, sent to the address on the Order Form or otherwise specified in\nwriting by a party. Notice must be sent by mail or overnight courier with return\nreceipt, and is effective 1 business day after being sent by overnight courier\nor 3 business days after being sent by mail.\n\n(j) Publicity. Rocket may use Customer's name in press releases, product\nbrochures, and other marketing materials to indicate they are Rocket's customer.\nRocket will use Customer's trademarks, service marks, logos or branding,\naccording to Customer's branding guidelines, which Customer will make available\nto Rocket.\n\n(k) Taxes. Product and Service Fees do not include taxes. Customer will pay all\nsales, use, property, customs, excise, value added and other taxes (\"Tax\")\nimposed upon the purchase, sale, license, or use of Products and/or Services,\nregardless whether the Tax is included in the invoice Rocket sends to Customer,\nexcept taxes on Rocket's net income. Fees payable by Customer will not be\nreduced by any Tax and Customer will pay invoiced Fees and Tax, or Customer will\nprovide a tax exemption certificate or tax payment receipt prior to Rocket's\nDelivery of Products or performance of Services, or proof of payment for Tax\nwithin 30 days from invoice date.\n\n(l) Payment. Unless specified otherwise by Rocket in writing, Customer's payment\nis due within 30 days from date of invoice. Late payment is a material breach of\nCustomer's obligation, upon which Rocket may suspend Product Delivery and\nService performance. Customer will pay to Rocket all reasonable costs and\nexpenses for collection of overdue amounts, including legal fees. Rocket may\nreview Customer's financial condition, payment and credit history and notify\nCustomer of any additional payment or credit requirements. Customer must notify\nRocket in writing of any disputed invoice within 15 days of invoice receipt or\nits right to dispute the invoice will be deemed waived. Customer will pay Fees\nas invoiced regardless of any warranty claim.\n\n9. DEFINITIONS\n\n(a) Affiliate means a legal entity that is controlled by Customer through\nownership of 51% or more of its outstanding equity that may order Products and\nServices by executing an Order Form as a customer under these Terms, subject to\nRocket's written approval.\n\n(b) Concurrent User means a User authorized to use a Product or Service\nconcurrently with other Concurrent Users, limited by a maximum number of\nConcurrent Users at any one time.\n\n(c) Confidential Information means any material, data, or information, in any\nform or media, that is proprietary or confidential to a party and is marked as\nconfidential, or not marked but by its nature or treatment by its owner should\nreasonably be considered to be confidential.\n\n(d) Customer means the legal entity executing the initial Order Form.\n\n(e) Day means calendar day unless specified as business day.\n\n(f) Deliverable means materials or work product specified as a \"deliverable\" in\nan Order Form that Rocket provides or creates with Professional Services,\nincluding without limitation software programming, application program\ninterfaces, information, documents, reports, technical and non-technical data,\nspecifications and other material, including derivative works. Deliverables do\nnot include Products.\n\n(g) Deliver(y) means Rocket has provided, and Customer is deemed to have\naccepted, a Product through electronic access.\n\n(h) Disclosing Party means a party whose Confidential Information is disclosed\nto the other party.\n\n(i) Documentation means Rocket's user manuals and training materials provided to\nCustomer electronically or physically.\n\n(j) Enterprise License means a Measured License limited to the use required\nwithin a certain business unit or corporate entity specified in the Order Form\nmeasured as of the Order Form date.\n\n(k) Fee means Rocket's price for a Product or Service specified in an Order\nForm.\n\n(l) Intellectual Property means all intellectual property, including without\nlimitation, inventions, patents, copyrights, trademarks, service marks, trade\nnames, trade secrets, know-how, moral rights, licenses, and any other intangible\nproprietary or property rights, registered or not, under statute and/or common\nlaw.\n\n(m) License means Customer's non-exclusive, non-transferable right to use the\nlicensed Products, Services, Deliverables or materials for its own internal\nbusiness operations, according to the Documentation, and subject to the\nAgreement's restrictions.\n\n(n) Measured License means a License for the time period, number and type of\nUsers, transactions, copies, seats, instructions per second (MIPS) or other\nquantity or measure specified for each Product listed in an Order Form.\n\n(o) Named User means an individual identified User authorized to use a Product\nor Service. A new Named User may replace a prior Named User.\n\n(p) Order Form means a quote, SOW, or registration form provided by Rocket to\nCustomer that includes the Products, Services, Fees and a unique Rocket\nreference number for each Order Form.\n\n(q) Products means Rocket proprietary software products.\n\n(r) Product Warranty means Rocket's limited warranty for Products.\n\n(s) Professional Services means the professional consulting services, standard\ninstallation, integration and configuration services, and time and materials\nservices Rocket provides as an independent contractor.\n\n(t) Receiving Party means a party receiving the other party's Confidential\nInformation.\n\n(u) Service(s) means Support Services and/or Professional Services.\n\n(v) Service Warranty means Rocket's limited warranty specified for Support\nServices or Professional Services.\n\n(w) SOW means a statement of work that documents materials and services for a\nproject that Rocket provides, generally for Professional Services engagements,\nincluding a project plan, resources and actions provided by each party and a\npayment schedule.\n\n(x) Support Period means a time period defined in an Order Form during which\nRocket will provide Support Services.\n\n(y) Support Service(s) means Rocket's current standard maintenance and support\nservices, policies and procedures for Products.\n\n(z) User means a Named User or Concurrent User employed by and authorized by\nCustomer to use a Product or Service for Customer's internal business purposes.\n\nB. PRODUCT PURCHASE/LICENSE/MAINTENANCE SUPPORT TERMS\n\n1. ORDERS\n\nRocket will provide an Order Form to Customer that includes the Products,\nSupport Services, Fees, other Services, and Rocket reference number for each\norder. Customer will place a binding order, subject to Rocket's acceptance, by\nsending Rocket a signed Order Form.\n\n2. LICENSE\n\n(a) Grant. Rocket grants to Customer a Measured License for each Product listed\nin the Order Form, in object code form, and related Documentation. Customer may\nmake one copy of the Product for non-production backup purposes. Customer's\nright to use the Product as an Enterprise License or a type of Measured License\nis specified in the Order Form. Customer's actual use will not decrease (but may\nincrease) the scope of the License granted and the Fees due.\n\n(b) Restrictions. Customer will not:\n(i) Rent, lease, or sublicense a Product, or use a Product as a service bureau\nor for hosting as an application service provider;\n(ii) Permit any third party to access or use a Product or Documentation, except\nfor Customer's Affiliates using a Product or Documentation for Customer's\ninternal business operations, provided Customer (a) ensures its Affiliates\ncomply with the terms of the Agreement and (b) is liable for their acts and\nomissions;\n(iii) Transfer or use a Product or Documentation to or in a country other than\nthat to which Rocket first provides it;\n(iv) Use a Product except as specified in the Documentation;\n(v) Translate, modify or make derivative works of a Product or Documentation;\n(vi) Reverse engineer, , decompile or disassemble a Product, except as permitted\nby law after Customer has disclosed its intended activities in writing to\nRocket;\n(vii) Exceed the time period for the License, or use a Product in excess of the\nMeasured License or Enterprise License, which Customer purchased;\n(viii) Use a Product in production if provided under a testing, evaluation,\ndevelopment or other non-production License;\n(ix) Alter a Product's copyright or other intellectual property rights notices;\n(x) Infringe or misappropriate Rocket's or its licensors' Intellectual Property.\n\n(c) Verification. Customer will keep accurate records measuring its use of the\nProducts according to its License. Rocket has the right to audit Customer's\nrecords and operations to verify Customer's Product use according to the License\nand the Agreement. Audits will be scheduled at a mutually agreed date and time\nduring Customer's usual business hours. If Rocket determines that Customer's\nProduct use exceeds the License Customer purchased, Customer will immediately\npay Rocket the current Fees for the additional Product use, including reasonably\nestimated arrears for Support Service Fees, and reimburse Rocket's reasonable\nexpenses to perform the audit. THE LIMITATION OF LIABILITY SET FORTH IN SECTION\nA4 DOES NOT APPLY TO CUSTOMER'S PRODUCT USE EXCEEDING ITS LICENSE OR\nMISAPPROPRIATION OF A PRODUCT.\n\n(d) Termination. Rocket may terminate a License by written notice (i)\nimmediately, if Customer infringes or misappropriates Rocket's or its licensors'\nIntellectual Property or fails to comply with the License Terms; (ii) as\nspecified in the Warranty Terms; and (iii) if Customer materially breaches the\nAgreement, subject to any specified cure period. Upon termination Customer will\nimmediately return or destroy all Product and, upon Rocket's request, provide\nwritten certification of such destruction.\n\n(e) Excluded Components. The provisions of this paragraph do not apply to the\nextent they are held to be invalid or unenforceable under the law that  governs\nthis Agreement. Notwithstanding any of the terms in this Agreement or any other\nagreement Licensee may have with Rocket (a) the third party suppliers of such\nExcluded Components, as described in the Notices file included with the included\nwith the Software, (the \"Suppliers\") provide the components WITHOUT WARRANTIES\nOF ANY KIND and, such Suppliers DISCLAIM ANY AND ALL EXPRESS AND IMPLIED\nWARRANTIES AND CONDITIONS INCLUDING, BUT NOT LIMITED TO, THE WARRANTY OF TITLE,\nNON-INFRINGEMENT OR INTERFERENCE AND THE IMPLIED WARRANTIES AND CONDITIONS OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, WITH RESPECT TO THE\nEXCLUDED COMPONENTS; (b)  the Suppliers shall not be liable for any direct,\nindirect, incidental, special, exemplary, punitive or consequential damages,\nincluding but not limited to lost data, lost savings, and lost profits, with\nrespect to the Excluded Components; and, (c) neither Rocket nor the Suppliers\nshall be liable to Licensee for any claims arising directly or indirectly from\nor related to the Excluded Components. Notices with respect to the Excluded\nComponents, including instructions for obtaining source code (as applicable) for\ncertain Excluded Components, may be found in the NOTICES file(s) that\naccompanies the Software.\n\n3. SUPPORT SERVICES\n\n(a) Support Services. Rocket will provide Support Services purchased by Customer\naccording to Rocket's current standard policies and procedures as revised from\ntime to time. Rocket's standard Support Services generally include (i)\ncommercially reasonable efforts to resolve problems or bugs in the Product which\nsubstantially impair the functionality described in Rocket's published technical\nspecifications; (ii) revisions and updates for Products containing code fixes,\nimprovements or enhancements to existing functionality as available; (iii)\naccess to online problem reporting, tracking, and self-help tools; and (iv)\ntelephone support for trained Customer personnel during purchased support hours.\nSupport Services do not include onsite support which may be purchased if\navailable.\n\n(b) Support Period; Termination. Support Service is available for a minimum 12\nmonth Support Period, unless a longer period is specified in an Order Form, and\nthe initial Support Period begins on the Product Delivery date. The Support\nPeriod will renew automatically for subsequent Support Periods equal to the\ninitial Support Period unless either party provides written notice of\ntermination at least 60 days prior to the end of the current Support Period.\nRocket may suspend or terminate Support Service upon written notice if Customer\nbreaches its obligations including timely payment for any Support Period. Upon\ntermination Customer will, at Rocket's direction, return or destroy any Rocket\nmaterials, Confidential Information and Documentation, and Customer will\nimmediately pay Rocket all fees due for the remainder of the Support Period and\nany other fees accrued as of the termination date.\n\n4. PRODUCT DELIVERY\n\nAll Products provided to Customer by Rocket are subject to these Terms. Risk of\nloss for Products passes to Customer upon Delivery. Customer is responsible for\ncustoms clearance, documents, and paying any customs duties and import fees.\n\n5. FEES AND PAYMENT\n\n(a) Product Fees. Customer will pay to Rocket the Product Fees according to an\nOrder Form, along with shipping, handling, taxes and any similar fees.\n\n(b) Support Service Fees. Support Service Fees for the initial Support Period\nare included in the Product Order Form. Rocket will provide an Order Form or\ninvoice for each renewal Support Period at Rocket's current list price, and\nCustomer will pay the Support Service Fees when due, according to the Order Form\nor invoice. Rocket may not provide renewal Support Services if Customer does not\npay the renewal Fees to Rocket prior to the end of the current Support Period.\nIf Customer's Support Services lapse at any time, renewal will be subject to\nRocket's re-instatement policies and fees. Payment that is invoiced in arrears\nfor any Support Period is due and payable on invoice date.\n\n6. WARRANTIES\n\n(a) Products. Rocket warrants that Product will perform substantially according\nto Rocket's current published technical specifications on the Product Delivery\ndate, when used according to the Documentation. Customer must provide a written\nProduct Warranty claim to Rocket within 90 days of the Delivery date. Customer\nmust provide remote or local access to the Product if required by Rocket to\nperform Product Warranty service. Rocket will repair or replace a Product not\nconforming to the Product Warranty, or, at its option, refund the part of the\nProduct Fees paid for the Product that does not conform, and the Product License\nterminates. Upon License termination, Customer will cease using and destroy the\nProduct.\n\n(b) Support Services. Rocket warrants that Support Services will be performed in\na commercially reasonable manner consistent with general industry standards that\napply to similar services. Customer must provide a written Service Warranty\nclaim to Rocket within 15 days after the date Rocket provided the Service.\nRocket, at its option, will re-perform Service not complying with the Service\nWarranty at no additional charge, or refund the part of the Fee, if paid, for\nthe Service which does not comply with the Service Warranty.\n\n(c) Disclaimer. Product Warranty or Support Service Warranty does not cover\nproblems caused by (i) abuse, misuse, alteration, neglect, accident,\nunauthorized repair or installation, or acts or omissions of any party other\nthan Rocket; (ii) electrical systems, fire or water damage, Customer's hardware,\nsoftware, networks, or systems; or (iii) Customer not using Product according to\nRocket's current published technical specifications. EXCEPT AS SET FORTH IN\nSECTIONS 6(a) AND (b) ABOVE, ROCKET, ITS AFFILIATES AND LICENSORS DISCLAIM ALL\nOTHER WARRANTIES, REPRESENTATIONS AND GUARANTEES, EXPRESS OR IMPLIED, ORAL OR\nWRITTEN, FOR PRODUCTS OR SERVICES, THEIR USE, SUFFICIENCY, ACCURACY,\nRELIABILITY, TIMELINESS, QUALITY, SUITABILITY, AVAILABILITY, OR COMPLETENESS,\nSTATUTORY OR OTHERWISE, INCLUDING WITHOUT LIMITATION, (i) MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT, OR (ii) THAT SUPPORT\nSERVICES OR OPERATION OF PRODUCTS WILL BE UNINTERRUPTED OR ERROR FREE, OR\nOPERATE IN COMBINATION WITH ANY OTHER HARDWARE, SOFTWARE, SYSTEM, OR DATA; (iii)\nERRORS OR DEFECTS WILL BE CORRECTED. THIS SECTION B6 DESCRIBES ROCKET'S SOLE\nLIABILITY AND CUSTOMER'S SOLE REMEDY FOR A PRODUCT OR SUPPORT SERVICE WARRANTY\nCLAIM.\n\nC. PROFESSIONAL SERVICES\n\n1. PROFESSIONAL SERVICES ORDER Customer will order the Professional Services it\nrequires as specified in Section B(1) above, which Rocket may perform remotely\nor on site as appropriate. The Order Form will describe the Professional\nServices and any of the following that apply: project plan, resources and\nactions provided by each party, Deliverables, Fees, expenses, and payment\nschedule.\n\n2. PROFESSIONAL SERVICES FEES AND PAYMENT\n\nCustomer will pay to Rocket, according to each Order Form:  (a) Fees for time\nand Deliverables; (b) Rocket's expenses incurred with the Professional Services;\nand (c) any additional fees and expenses incurred by Rocket due to changes in\nthe scope of Services to be provided, Customer's failure to fulfill its\nobligations in a timely manner, or reassignment of personnel or rescheduling\nwithout Rocket's fault. Professional Services Fees are due and invoiced as\nServices are performed. Customer will pay Fees and expenses for all Professional\nServices and Deliverables provided until the end of each Service engagement.\nRocket will itemize invoices for expenses and provide receipts if Customer\nrequests. All Professional Services Rocket provides are billable, regardless of\nwhether the Professional Services are requested by Customer to assist with a\nwarranty or maintenance issue, which will be addressed by Rocket's Support\nServices organization. Support for third party products is provided by the third\nparty supplier.\n\n3. DELIVERABLES\n\n(a) Ownership.\n\n(i) Rocket may designate in writing Deliverables as \"Type I Deliverables,\" \"Type\nII Deliverables,\" or otherwise as agreed. If not specified in writing,\nDeliverables are Type II Deliverables. Customer's data and Confidential\nInformation are Customer's exclusive property in which Customer retains all\nright, title and interest, and are not Deliverables even if included with\nDeliverables provided by Rocket, such as in a report or dashboard. Rocket\nProducts are governed by separate license terms.\n(ii)                Type I Deliverables are Deliverables created solely for\nCustomer during the Professional Service performance period in which Customer\nwill have all right, title, and interest, including copyright. Rocket will\nretain a copy of Type I Deliverables. Rocket's Intellectual Property and\nConfidential Information, in which Rocket retains all right, title and interest,\nare excluded from Type I Deliverables.\n(iii) Type II Deliverables are Deliverables provided or created during the\nProfessional Services performance period, including without limitation all\npreexisting materials, in which Rocket or its affiliates have all right, title,\nand interest, including copyright. Rocket will provide one copy of Type II\nDeliverables to Customer.\n\n(b) License and Use.\n\n(i) Rocket grants Customer a License to use and reproduce a reasonable number of\ncopies, and distribute internally, Type II Deliverables' object code for its own\ninternal business operations only, according to the Order Form. Customer will\nnot reverse engineer, sell, rent, sublicense or permit a third party to use or\naccess Type II Deliverables. Customer's ownership of Type I Deliverables and\nLicense for Type II Deliverables are contingent upon full payment of all fees\nand expenses for Professional Services.\n(ii)   Customer grants Rocket (1) a nonexclusive, worldwide, royalty-free right\nto use and copy Customer systems, Confidential Information and data, and use any\nCustomer proprietary and third party products, services and materials under\nCustomer's license, as necessary to provide the Professional Services, and (2)\nan irrevocable, nonexclusive, royalty-free right to use, reproduce, create\nderivative works, sublicense and distribute, internally and to other parties,\nType I Deliverables, excluding Customer Confidential Information and Customer\ndata, which is Customer's exclusive property. Customer represents and warrants\nthat Customer information, data and third party products, services and materials\nprovided to Rocket will not violate any law or third party rights.\n(iii)  Each party will reproduce the copyright notice or other legend on any\ncopies made under the license and use rights granted.\n\n(c) Support. Rocket does not provide Support Services for Deliverables unless\nRocket, at its option, has incorporated the Deliverables in a generally\navailable Product, or Rocket agrees to provide Support Services for the\nDeliverable in the SOW, and Customer pays fees for the Support Services.\n\n(d)  Termination. Rocket may terminate a License by written notice (i)\nimmediately, if Customer infringes Rocket's or its licensors' Intellectual\nProperty or fails to comply with the License Terms; or (ii) if Customer\nmaterially breaches the Agreement, subject to any specified cure period. Upon\nLicense termination Customer must immediately destroy licensed Deliverables and,\nupon Rocket's request, and so certify in writing.\n\n4.  PERSONNEL\n\nOn Customer premises, Rocket personnel will comply with Customer's reasonable\nrules and policies provided to Rocket in writing for such matters as working\nhours, holidays and Customer security measures. Rocket will determine its\npersonnel to perform Professional Services in its sole discretion. The parties\nwill resolve any Professional Services issues in good faith.  If the resolution\ninvolves reassigning personnel, Rocket will do so as soon as practical and\ncommercially reasonable, according to local law.  Customer agrees that\nreassignment may delay Professional Services or allow Rocket to terminate\nProfessional Services without Rocket liability.\n\n5. PROFESSIONAL SERVICES WARRANTY\n\n(a) Warranty. Rocket warrants that Professional Services will be performed in a\ncommercially reasonable manner consistent with industry standards. Customer must\nprovide a written Professional Services Warranty claim to Rocket within 15 days\nafter the date Rocket performs Professional Services. Rocket, at its option,\nwill re-perform Professional Services that do not comply with the Professional\nServices Warranty at no additional charge, or if not practical and solely at\nRocket's option, credit the part of the Professional Services Fee, if paid, for\nthe Professional Services that do not comply with the Professional Services\nWarranty.\n\n(b) Disclaimer. This Professional Services Warranty does not cover problems\ncaused by (i) abuse, misuse, alteration, enhancements, neglect, accident,\nunauthorized repair or installation, or acts or omissions of, or delay by, any\nparty other than Rocket; or (ii) electrical systems, fire or water damage,\nCustomer's hardware, software, networks, or systems. DELIVERABLES ARE PROVIDED\nON AN \"AS-IS\" BASIS, WITHOUT WARRANTY OF ANY KIND. ROCKET, ITS AFFILIATES AND\nLICENSORS DISCLAIM ALL OTHER WARRANTIES, REPRESENTATIONS AND GUARANTEES, EXPRESS\nOR IMPLIED, ORAL OR WRITTEN, FOR PROFESSIONAL SERVICES AND DELIVERABLES, THEIR\nUSE, SUFFICIENCY, OR ACCURACY, INCLUDING WITHOUT LIMITATION, IMPLIED WARRANTIES\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, OR\nTHAT PROFESSIONAL SERVICES OR DELIVERABLES WILL BE UNINTERRUPTED OR ERROR FREE.\n\n(c) Limitation. THE WARRANTY DESCRIBED IN THIS SECTION C5 IS ROCKET'S SOLE\nLIABILITY AND CUSTOMER'S EXCLUSIVE REMEDY FOR A PROFESSIONAL SERVICES OR\nDELIVERABLES CLAIM.\n\n\n6. TERMINATION\n\nEither party may terminate a Professional Services engagement, in whole or in\npart, with 30 days prior written notice, effective on the date specified in the\nnotice, however, these Terms apply for all Services and Deliverables provided\nregardless of the termination date, including any Services provided for\ntransition or termination assistance.  Rocket is not responsible for the\nresulting condition of Services or Deliverables upon early termination. These\nTerms govern all Order Forms until Professional Services are terminated or\ncompleted.\n\nRev January 2022"
}