{
  "key": "root-cert-3.0",
  "short_name": "Root Certificate License Agreement v3.0",
  "name": "Root Certificate License Agreement v3.0",
  "category": "Proprietary Free",
  "owner": "Broadcom",
  "homepage_url": "https://github.com/newrelic/node-newrelic/blob/main/THIRD_PARTY_NOTICES_ADDENDUM.md",
  "spdx_license_key": "LicenseRef-scancode-root-cert-3.0",
  "text_urls": [
    "https://docs.broadcom.com/doc/root-certificate-license-agreement-en"
  ],
  "other_urls": [
    "https://github.com/newrelic/node-newrelic/blob/main/THIRD_PARTY_NOTICES.md?plain=1#L5509"
  ],
  "standard_notice": "This product includes certificates from Symantec which are used under the\nfollowing license (https://docs.broadcom.com/doc/root-certificate-license-\nagreement-en):\n",
  "ignorable_urls": [
    "http://www.symantec.com/about/profile/policies/trademarks.jsp",
    "https://www.geotrust.com/resources/rootcertificates/index.html",
    "https://www.thawte.com/roots/index.html",
    "https://www.verisign.com/support/roots.html"
  ],
  "ignorable_emails": [
    "dl-tssroot@symantec.com",
    "root@symantec.com"
  ],
  "text": "ROOT CERTIFICATE LICENSE AGREEMENT\n\nSYMANTEC CORPORATION AND/OR ITS AFFILIATES (“SYMANTEC”) IS WILLING TO PROVIDE THE\nROOT CERTIFICATES TO YOU AS THE INDIVIDUAL, THE COMPANY, OR THE LEGAL ENTITY THAT\nWILL BE UTILIZING THE ROOT CERTIFICATES (REFERENCED BELOW AS “YOU” OR “YOUR”)\nONLY ON THE CONDITION THAT YOU ACCEPT ALL OF THE TERMS OF THIS AGREEMENT\n(“AGREEMENT”). READ THE TERMS AND CONDITIONS OF THIS AGREEMENT CAREFULLY\nBEFORE USING THE ROOT CERTIFICATES. THIS IS A LEGAL AND ENFORCEABLE CONTRACT\nBETWEEN YOU AND SYMANTEC. BY USING THE ROOT CERTIFICATES, YOU AGREE TO THE\nTERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE TO THESE TERMS AND\nCONDITIONS, MAKE NO FURTHER USE OF THE ROOT CERTIFICATES. UNLESS OTHERWISE\nDEFINED HEREIN, CAPITALIZED TERMS WILL HAVE THE MEANING GIVEN IN THE “DEFINITIONS”\nSECTION OF THIS AGREEMENT AND SUCH CAPITALIZED TERMS MAY BE USED IN THE\nSINGULAR OR IN THE PLURAL, AS THE CONTEXT REQUIRES.\n\nROOT CERTIFICATE TERMS AND CONDITIONS\n1. DEFINITIONS.\n\"Certificate\" means an electronic file that, at least, states a name or identifies the issuing Certificate\nAuthority, identifies the subscriber, contains the subscriber's public key, identifies the Certificate's\noperational period, contains a Certificate serial number, and contains a digital signature of the issuing\nCertificate Authority.\n“Certificate Authority” or “CA” means a person or entity authorized to issue, suspend, or revoke\nCertificates.\n“Intermediate CA” means a CA Certificate signed by a Root Certificate Intermediate that issues\nCertificates either to end-entities or other Certificate Authorities, but not to both.\n\"Products\" means all versions of Your product or service with which the Root Certificates are incorporated\n(including successor products and services or any major or minor upgrades thereto).\n\"Root Certificate\" means a self-signed Certificate issued by a top-level Certificate Authority to itself, which\nincludes such Certificate Authority's public key. The Root Certificates and Root Certificate files to be\nprovided by Company to Customer pursuant to this Agreement are available for download at\nhttps://www.verisign.com/support/roots.html, https://www.thawte.com/roots/index.html or\nhttps://www.geotrust.com/resources/rootcertificates/index.html.\n\n2. LICENSE. During the term of this Agreement, Symantec grants You a royalty-free, non-exclusive, nontransferable license to (a) use the Root Certificate for the purposes of testing (without the right to modify);\n(b) make copies of Root Certificates only in order to embed and incorporate them, unmodified and in full,\nas roots in Your Products; (c) distribute the Root Certificates as embedded and incorporated in such\nProducts; and (d) use the relevant logos and trademarks of Symantec in Your marketing materials,\nadvertisements, product data sheets, product packaging and websites solely conjunction with the\ndistribution of the Root Certificates in accordance with Symantec’s published guidelines for such usage.\nYou shall not have the right to further distribute the Root Certificates other than as described herein\nwithout an additional license grant, in a separate writing, from Symantec.\n\n3. RESTRICTIONS. You may not: (a) modify or create any derivative works of Root Certificates; (b)\nassign, sublicense, sell, rent, or lease Symantec's root keys or Root Certificates; (c) use such Root\nCertificates except as expressly permitted under this Agreement; (d) remove or alter any trademark, logo,\ncopyright, or other proprietary notices, legends, symbols, or labels provided in the Root Certificates; or (e)\ncertify, or cause a third party to certify, the public key contained in the Root Certificates by issuing or\ncreating a Certificate containing such public key.\n\n4. CUSTOMER’S OBLIGATIONS.\n\n4.1. During the term of this Agreement, You shall use commercially reasonable efforts regularly check the\napplicable Symantec URL for updates to the Root Certificates and update Root Certificates embedded\ninto Your Products with the most currently available Root Certificates, unmodified and in full, or as a patch\nor update. If Symantec updates its Root Certificates,, You shall use commercially reasonable efforts to (i)\ndiscontinue all copying and use of the Root Certificates which have been replaced, and (ii) to use\nSymantec’s then-current Root Certificates. Any updates to the Root Certificates are incorporated into and\nsubject to the terms of this Agreement.\n\n4.2. You shall appoint at least one (1) individual as the administrative contact designated to address any\nRoot Certificate issues and shall provide the contact information for such individual to dl-tssroot@symantec.com.\n\n4.3 In the event You become aware of or suspect any event that diminishes the integrity of Symantec's\ndata or public key system (\"Compromise\"), You shall immediately notify Symantec at dl-tss-\nroot@symantec.com of such Compromise, and take reasonable steps to assist and cooperate with\nSymantec to remedy the Compromise.\n\n4.4 In the event that Symantec modifies these terms of use for the Root certificates for all end users,\nSymantec shall post the modified terms for the Agreement on the applicable URL and may post the\nmodified terms on the Symantec corporate website. You shall be responsible for regularly checking the\napplicable URL for modifications to this Agreement. Such modifications shall be effective and binding on\nCustomer within thirty (30) days of Symantec’s posting such modifications to its website. If you do not\naccept the modified Agreement, discontinue use of the Root Certificates and this Agreement will be\ndeemed as terminated.\n\n5. CONFIDENTIALITY.\n\n5.1. Confidential Information. \"Confidential Information\" means the root private keys corresponding to the\npublic key in a Root Certificate, and any confidential, trade secret, or other proprietary information\ndisclosed by a party to the other party under this Agreement, except for Information that: (i) is public\nknowledge at the time of disclosure, (ii) was known by the receiving party before disclosure by the\ndisclosing party, or becomes public knowledge or otherwise known to the receiving party after such\ndisclosure, other than by breach of a confidentiality obligation, or (iii) is independently developed by the\nreceiving party by persons without access to Confidential Information of the disclosing party.\n\n5.2. Protection of Confidential Information. The receiving party shall: (i) not disclose the Confidential\ninformation to any third party, (ii) not use the Confidential Information except for purposes of performing\nthis Agreement, and (iii) take steps consistent with its protection of its own confidential and proprietary\ninformation (but in no event exercise less than reasonable care) to prevent unauthorized disclosure of the\nConfidential Information. Each party acknowledges that breach of this Section 5 may cause irreparable\nharm to the disclosing party entitling the disclosing party to injunctive relief, among other remedies.\n\n5.3. Mutual Cooperation. Each party will notify and cooperate with the other party in enforcing the\ndisclosing party's rights if such party becomes aware of a threatened or actual violation of the\nconfidentiality requirements of this Section 5. Each party shall have confidentiality agreements with its\nemployees, agents or independent contractors sufficient in scope to fulfill its confidentiality obligations\nunder this Agreement.\n\n6. INTELLECTUAL PROPERTY. You acknowledge that Symantec, including its wholly owned\nsubsidiaries, retains all intellectual property rights and title (including any patent, copyright, trademark,\ntrade secret, and other rights) in and to the Root Certificates, the public and private keys corresponding to\nsuch Root Certificates (\"Symantec Intellectual Property\"). This Agreement does not give You any\nintellectual property rights in the Symantec intellectual property except for the license granted in Section\n\n2. To the extent You use Symantec's trademarks or logos as permitted herein, You agree to comply with\nall usage requirements set forth in the then current version of Symantec's Logo and Trademark Usage\nGuide (http://www.symantec.com/about/profile/policies/trademarks.jsp) and any other guides and\nprocedures of Symantec.\n\n7. NO WARRANTIES. THE ROOT CERTIFICATES, INCLUDING UPDATES, ARE PROVIDED \"AS IS\"\nWITHOUT ANY WARRANTY WHATSOEVER. SYMANTEC HEREBY DISCLAIMS ALL WARRANTIES,\nWHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING WITHOUT LIMITATION, ANY\nIMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\nNONINFRINGEMENT OF THIRD PARTY RIGHTS.\n\n8. LIMITATION OF LIABILITY. UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY WILL\nSYMANTEC OR ITS LICENSORS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY\nCONSEQUENTIAL, INDIRECT, SPECIAL, INCIDENTAL, OR EXEMPLARY DAMAGES, WHETHER\nFORESEEABLE OR UNFORESEEABLE, EVEN IF SUCH PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES. YOU WILL TAKE REASONABLE MEASURES TO INSURE THAT\nTHE TERMS AND CONDITIONS SET FORTH IN THE PRECEDING SENTENCE OF THIS SECTION 8\nARE INCORPORATED INTO ANY AGREEMENT BETWEEN YOU AND YOUR CUSTOMERS OR\nLICENSEES. SYMANTEC SHALL NOT BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY\nDAMAGES CAUSED BY YOUR OR A THIRD PARTY’S CONTINUED USE OF ANY OUTDATED\nROOTS FOR WHICH AN UPDATED VERSION IS MADE AVAILABLE BY SYMANTEC. FURTHER,\nUNDER NO CIRCUMSTANCES WILL SYMANTEC'S LIABILITY FOR ANY ACTION OR CLAIM EXCEED\nUSD$1,000, REGARDLESS OF WHETHER SUCH ACTION OR CLAIM IS BASED IN CONTRACT,\nTORT, STRICT LIABILITY, OR OTHERWISE.\n\n9. TERM AND TERMINATION.\n\n9.1. Term. This Agreement shall become effective as of the earlier of, Your first use of the Root\nCertificates, and shall remain in effect until the earlier of (i) Your discontinued use of the Root Certificates;\n(ii) termination by either party under the terms of Section 9.2, below; or (iii) Symantec’s notice to You that\nSymantec is no longer providing Root Certificates for use.\n\n9.2. Termination for Default/Insolvency. Either party shall be entitled to terminate this Agreement in the\nevent of a failure by the other party to perform any of its material obligations under this Agreement if such\nbreach is not cured within thirty (30) days after receipt of written notice thereof from the non-defaulting\nparty or within forty-eight (48) hours after receipt of such written notice if a breach by You may\ncompromise the security of the Symantec Trust Network or other system. This Agreement shall terminate\nupon the election of and notice from a party to the other if the other party is adjudged insolvent or\nbankrupt, or the institution of any proceedings by or against the other party seeking relief, reorganization,\nor arrangement under any laws relating to insolvency, or any assignment for the benefit of creditors, or\nthe appointment of a receiver, liquidator, or trustee of any of the other party's property or assets, or the\nliquidation, dissolution, or winding up of the other party's business.\n\n9.3. Effect of Expiration or Termination. Upon expiration or termination of this Agreement, except for a\nbreach by You, You may continue to distribute the current version of Your Products which incorporate the\nRoot Certificates. Any updates or upgrades thereto may not include the Root Certificates and You shall\nstop making copies of Root Certificates, shall stop including Root Certificates in Your Products, and shall\nstop using Symantec’s logos and trademarks. The provisions of Sections 3, 4.3, 5, 6, 7, 8, 9.3, and 10\nshall survive termination of this Agreement.\n\n10. GENERAL.\n\n10.1. Governing Laws. This Agreement and any disputes relating to the services provided hereunder shall\nbe governed and interpreted according to each of the following laws, respectively, without regard to its\nconflicts of law provisions: (a) the laws of the State of California, if You are located in North America or\nLatin America; or (b) the law of England, if You are located in Europe, Middle East or Africa; or (c) the\nlaws of Singapore, if You are located in Asia Pacific including Japan. The United Nations Convention on\nContracts for the International Sale of Goods shall not apply to this Agreement.\n\n10.2. Binding Upon Successors; Assignment. This Agreement shall be binding upon, and inure to the\nbenefit of, the successors, executors, heirs, representatives, administrators, and assigns of the parties\nhereto. Notwithstanding the foregoing, You may not assign Your rights or obligations under this\nAgreement without the prior written consent of Symantec. Any such purported assignment of this\nAgreement without obtaining written consent shall be void and of no effect.\n\n10.3. Severability; Enforcement; No Waiver. The unenforceability of any provision or provisions of this\nAgreement shall not impair the enforceability of any other part of this Agreement. If any provision of this\nAgreement shall be deemed invalid or unenforceable, in whole or in part, this Agreement shall be deemed\namended to delete or modify, as necessary, the invalid or unenforceable provision to render it valid,\nenforceable, and, insofar as possible, consistent with the original intent of the parties. The failure of a\nparty, at any time or from time to time, to require performance of any obligations of the other party\nhereunder shall not be deemed a waiver and shall not affect its right to enforce any provision of this\nAgreement at a subsequent time.\n\n10.4. Entire Agreement; Amendments; Waivers. This Agreement constitutes the entire understanding and\nagreement of the parties, whether written or oral, with respect to the subject matter hereof and supersede\nall prior and contemporaneous agreements or understandings between the parties. Any term or provision\nof this Agreement may be amended, and the observance of any term of this Agreement may be waived,\nonly by writing signed by the parties to be bound thereby.\n\n10.5. Compliance with Law, Export Requirements and Foreign Reshipment Liability. Each party shall\ncomply with all applicable federal, state and local laws and regulations in connection with its performance\nunder this Agreement. Services, including documentation, may include controlled technology or technical\ndata (collectively “Controlled Technology”) that is subject to the U.S. Export Administration Regulations\n(EAR), and diversion contrary to U.S. law is prohibited. You agree to comply with all relevant laws\nincluding the U.S. EAR and the laws of any country from which Controlled Technology is exported. All\nControlled Technology is prohibited for export or re-export to Cuba, North Korea, Iran, Sudan and Syria\nand to any country or its nationals subject to relevant embargo or sanction or to any entity or person for\nwhich an export license is required per any relevant restricted party list, without first obtaining a license.\nFurthermore, You hereby agree that You will not use or allow use of Controlled Technology in connection\nwith chemical, biological, or nuclear weapons, or missiles, drones or space launch vehicles capable of\ndelivering such weapons. Symantec shall have the right to suspend performance of any of its obligations\nunder this Agreement, without any prior notice being required and without any liability to Customer, if You\nfail to comply with this provision.\n\n10.6. Notices. You will make all notices, demands or requests to Symantec with respect to this Agreement\nin writing to the \"Contact\" address listed on the website from where you downloaded the Root Certificates,\nwith a copy to: General Counsel – Legal Department, Symantec Corporation, 350 Ellis Street, Mountain\nView, California 94043, USA. Notices shall be effective on the date received (unless the notice specifies a\nlater date) only if it is sent by a courier service that confirms delivery in writing or if sent by certified or\nregistered mail, postage prepaid, return receipt requested. Symantec may post notices and updates\nregarding the Agreement or the Root Certificates at the URL provided to You for the Root Certificates.\nYou shall be responsible for regularly checking the applicable URL for notices from Symantec regarding\nthe Agreement or the Root Certificates. No notices, demands, or requests to Symantec with respect to\nthis Agreement may be delivered by electronic mail. You shall immediately notify Symantec of any legal\nnotices served on You that might affect Symantec, and shall promptly forward the original or a copy of\nsuch notice to Symantec.\n\n10.7. Independent Parties. The relationship between You and Symantec is that of independent\ncontractors. Neither party nor its employees, consultants, contractors, or agents are agents, employees,\nor joint venturers of the other party, nor do they have any authority to bind the other party by contract or\notherwise to any obligation.\n\nRoot Certificate License Agreement v3.0 (January 2014)"
}