{
  "key": "salesforcesans-font",
  "short_name": "SalesforceSans Font License",
  "name": "SalesforceSans Font License",
  "category": "Proprietary Free",
  "owner": "Salesforce.com",
  "homepage_url": "https://github.com/salesforce-ux/design-system-ios/blob/master/SalesforceDesignSystem.bundle/License-for-SalesforceSans-font.txt",
  "spdx_license_key": "LicenseRef-scancode-salesforcesans-font",
  "ignorable_copyrights": [
    "Copyright 2015 Salesforce.com"
  ],
  "ignorable_holders": [
    "Salesforce.com"
  ],
  "text": "FONT LICENSE AGREEMENT\n\nTHIS FONT LICENSE AGREEMENT (“AGREEMENT”) IS A LEGAL AGREEMENT BETWEEN YOU AND\nSALESFORCE.COM, INC. (“WE”, “US”, “OUR”, AND “SALESFORCE”) THAT GOVERNS YOUR\nACQUISITION AND USE OF THE SALESFORCE SANS FONT (E.G., TYPEFACE, TYPOGRAPHIC\nCHARACTERS, ALPHANUMERICS, SYMBOLS, DESIGNS, AND ORNAMENTS) AND THE RELATED\nFONT FILES (E.G., TRUETYPE (TTF), WEB OPEN FONT FORMAT (WOFF,WOFF2), EMBEDDED\nOPENTYPE (EOT), AND SCALABLE VECTOR GRAPHICS (SVG) FILES) (COLLECTIVELY, THE\n“FONT”). BY DOWNLOADING OR USING THE FONT, YOU AGREE TO THE TERMS OF THIS\nAGREEMENT.  IF YOU ARE DOWNLOADING OR USING THE FONT ON BEHALF OF A COMPANY OR\nOTHER LEGAL ENTITY, YOU REPRESENT THAT YOU HAVE THE AUTHORITY TO BIND SUCH\nENTITY AND ITS AFFILIATES TO THIS AGREEMENT, IN WHICH CASE THE TERMS “YOU” OR\n“YOUR” WILL REFER TO SUCH ENTITY AND ITS AFFILIATES.  IF YOU DO NOT HAVE SUCH\nAUTHORITY, OR IF YOU DO NOT AGREE WITH THE TERMS OF THIS AGREEMENT, YOU MUST\nNOT DOWNLOAD OR USE THE FONT. This Agreement was last updated on August 21,\n2015.  It is effective between You and Us as of the date You accept this\nAgreement by downloading or using the Font.\n\n1. License Grant\nSubject to the terms of this Agreement and any other\napplicable Salesforce terms, conditions, and acceptable use policies (AUPs),\nWe hereby grant to You a revocable, non-transferable, non-exclusive, and non-\nsublicenseable limited license to, without modification, reproduce and use the\nFont solely to create applications with the Salesforce Lightning Design System\nthat run in Salesforce or on a Salesforce platform (e.g., Lightning, Heroku,\nVisualforce) (“Applications”).\n\n2. Restrictions\nTo the extent your Application contains copyright notices,\ntogether with all other copyright notices included with each Application, You\nwill include the following copyright notice: “The Salesforce Sans Font is used\nunder license from salesforce.com, inc.  Copyright 2015 Salesforce.com, Inc.”\nYou may not modify, adapt, translate, reverse engineer, decompile,\ndisassemble, or create derivative works based on the Font.  You must include\nthe Font in an Application in a manner that does not allow a user to access\nthe Font outside of the Application.  You will not use the Font on a\nstandalone basis and will only use the Font as part of the Salesforce\nLightning Design System.  You must not take any action which will have the\ndirect or indirect effect of causing the Font to become subject to the terms\nof an open source license or any similar terms.  You may refer to the Font as\n“Salesforce Sans”, but You may not use any other Salesforce trademark in\nconnection with the Font except as may be expressly agreed to by Salesforce in\nwriting or as set forth in other applicable Salesforce terms, conditions, and\nacceptable use policies (AUPs) and in any event You must comply at all times\nwith the Salesforce Trademark and Copyright Usage Guidelines located at http:/\n/www2.sfdcstatic.com/assets/pdf/misc/salesforce_Trademark_Usage_Guidelines.pdf\nand any other supplemental guidelines that may apply to you.  You must not\nlicense, sublicense, sell, resell, rent, lease, transfer, assign, distribute,\ntime share, or otherwise commercially exploit the Font nor make the Font\navailable to any third party, other than as expressly permitted by this\nAgreement.  To the extent any Font documentation, style guides, or other\napplicable Salesforce terms, conditions, and acceptable use policies (AUPs)\nimpose guidelines or restrictions for the use of the Font, You will abide by\nthose guidelines and restrictions.\n\n3. Ownership\nSubject to the limited rights expressly granted hereunder, We\nreserve all rights, title, and interest in and to the Font, including all\nrelated intellectual property rights.  No rights are granted to You hereunder\nother than as expressly set forth herein.  We shall have a royalty-free,\nworldwide, irrevocable, perpetual license to use and incorporate into the Font\nany suggestions, enhancement requests, recommendations, or other feedback\nprovided by You.\n\n4. Term and Termination\nThis Agreement will take effect when you download or\nuse the Font and will terminate upon the earlier of:  (a) Your failure to\ncomply with any term of this Agreement or any other applicable Salesforce\nterms, conditions, and acceptable use policies (AUPs); (b) return,\ndestruction, or deletion of all copies of the Font in your possession; or, (c)\n60 days after Salesforce provides You with written notice of termination.\nSalesforce’s rights and your obligations will survive the termination of this\nAgreement.  Upon termination of this Agreement by Salesforce, if requested by\nSalesforce, you will destroy or delete all copies of the Font in your\npossession and cease using the Font in all Applications.\n\n5. No Warranty\nTHE FONT IS PROVIDED “AS-IS,” EXCLUSIVE OF ANY WARRANTY\nWHATSOEVER.  WE DISCLAIM ALL IMPLIED WARRANTIES, INCLUDING WITHOUT LIMITATION\nANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\nTITLE, AND NON-INFRINGEMENT.  The Font may contain bugs or errors.  Any use of\nthe Font is at Your sole risk.  You acknowledge that We may discontinue making\nthe Font available to You at any time in Our sole discretion.\n\n6. No Damages\nIN NO EVENT SHALL WE HAVE ANY LIABILITY HEREUNDER TO YOU FOR\nANY DAMAGES WHATSOEVER, INCLUDING BUT NOT LIMITED TO DIRECT, INDIRECT,\nSPECIAL, INCIDENTAL, PUNITIVE, OR CONSEQUENTIAL DAMAGES, OR DAMAGES BASED ON\nLOST PROFITS, DATA OR USE, HOWEVER CAUSED AND, WHETHER IN CONTRACT, TORT OR\nUNDER ANY OTHER THEORY OF LIABILITY, WHETHER OR NOT YOU HAVE BEEN ADVISED OF\nTHE POSSIBILITY OF SUCH DAMAGES.\n\n7. General Provisions\nYou may not assign any of Your rights or obligations\nhereunder, whether by operation of law or otherwise, without Our prior written\nconsent.  This Agreement shall be governed exclusively by the internal laws of\nthe State of California, without regard to its conflicts of laws rules.  Each\nparty hereby consents to the exclusive jurisdiction of the state and federal\ncourts located in San Francisco County, California to adjudicate any dispute\narising out of or relating to this Agreement.  This Agreement constitutes the\nentire agreement between the parties, and supersedes all prior and\ncontemporaneous agreements, proposals or representations, written or oral,\nconcerning its subject matter.  No modification, amendment, or waiver of any\nprovision of this Agreement shall be effective unless in writing and either\nsigned or accepted electronically by the party against whom the modification,\namendment or waiver is to be asserted."
}