{
  "key": "salesforce-au-external-2025",
  "short_name": "Salesforce AU External-Facing Services Policy 2025",
  "name": "Salesforce Acceptable Use and External-Facing Services Policy 2025",
  "category": "Proprietary Free",
  "owner": "Salesforce.com",
  "homepage_url": "https://www.salesforce.com/content/dam/web/en_us/www/documents/legal/Agreements/policies/ExternalFacing_Services_Policy.pdf",
  "spdx_license_key": "LicenseRef-scancode-salesforce-au-external-2025",
  "other_urls": [
    "https://github.com/search?q=org%3Asalesforce+Ethics+disclaimer+for+Salesforce+AI+models%2C+data%2C+code&type=code"
  ],
  "ignorable_urls": [
    "http://www.salesforce.com/",
    "https://www.salesforce.com/company/legal/agreements/"
  ],
  "text": "Salesforce Acceptable Use and External-Facing Services Policy\n\n1. Scope\n\nA. This Acceptable Use and External Facing Services Policy (“Policy”) applies to customers’ use of all\nservices offered by Salesforce, Inc. or its affiliates (“Salesforce”). The terms of the Artificial Intelligence\nAcceptable Use Policy at https://www.salesforce.com/company/legal/agreements/ posted as of its\neffective date are hereby incorporated by reference. Capitalized terms used below but not defined in\nthis policy have the meaning set forth in the Main Services Agreement (“MSA”).\n\nB. With respect to Slack Services, if we believe a customer or its users are engaging in or encouraging\nillegal activity, or deliberately or repeatedly presents a credible risk of harm, or encourages harm, to\nother users, the Services or any third parties, we may suspend or terminate your Slack access. Slack is\nnot available for consumer purposes, as Slack is intended for use by businesses and organizations.\n\n2. Last Updated\n\nA. July 08, 2025\n\n3. Changes to Policy\n\nA. Salesforce may change this Policy by posting an updated version of the Policy at www.salesforce.com\nand such updates will be effective upon posting.\n\n4. Violations\n\nA. A customer’s violation of this Policy will be considered a material breach of the MSA and/or other\nagreement governing the customer’s use of the services.\n\n5. Prohibited Material\n\nA. Customers may not, and may not allow any third party, including its users, to use services to create,\nsend, upload, display, store, process, or transmit, or permit use of services to create, send, upload,\ndisplay, store, process, or transmit:\n\nI. Material that infringes or misappropriates a third party’s intellectual property or proprietary\nrights;\n\nII. Hate-related material, and/or material advocating discrimination against individuals or\ngroups;\n\nIII. Material advocating or advancing violent causes, including terrorism or violent extremism;\n\nIV. Obscene, excessively profane material or otherwise objectionable material;\n\nV. Material advocating or advancing criminal hacking, cracking, or phishing;\n\nVI. Material related to illegal drugs or paraphernalia;\n\nVII. Malicious material;\n\nVIII. Unlawful software;\n\nIX. Malicious code, such as viruses, worms, time bombs, Trojan horses, and other harmful or\nmalicious files, scripts, agents, or programs; or\nSalesforce Acceptable Use and External-Facing Services Policy 2\n\nX. Material that violates, encourages, or furthers conduct that would violate any applicable laws,\nincluding any criminal laws, or any third-party rights, including publicity or privacy rights.\n\n6. Prohibited Actions\n\nA. Customers may not use a service to, nor allow its users or any third party to use a service to:\n\nI. Generate or facilitate unsolicited commercial email (spam). Such prohibited activity includes,\nbut is not limited to:\n\na. Sending communications or email in violation of the CAN-SPAM Act or any other\napplicable anti- spam law or regulation;\n\nb. Imitating or impersonating Salesforce, another person or his, her, or its email address,\nor creating false accounts for the purpose of sending spam;\n\nc. Mining data or harvesting any web property (including any External-Facing Service) to\nfind email addresses or other user account information;\n\nd. Sending unauthorized mail via open, third-party servers;\n\ne. Sending email to users who have requested to be removed from a mailing list;\n\nf. Selling to, exchanging with, sharing with, or distributing to a third party personal\ninformation, including the email addresses of any person without such person’s\nknowing and continued consent to such disclosure; or\n\ng. Sending unsolicited emails to significant numbers of email addresses belonging to\nindividuals and/or entities with whom you have no preexisting relationship;\n\nII. Create, send, upload, display, store, process, or transmit unlawful, defamatory, harassing,\nabusive, fraudulent, infringing, obscene, excessively profane, hateful, violent, or otherwise\nobjectionable material nor use the services to send, display, or transmit sexually explicit\nmaterial;\n\nIII. Create, send, upload, display, store, process, or transmit highly deceptive manipulated or\nsynthetic digital media that is fabricated or false but presented as authentic or fact based and\nintended to deliberately sway audiences towards a specific interest or agenda, including, but\nnot limited to, deepfakes;\n\nIV. Promote, support, or facilitate unlawful, hateful, discriminatory, or violent causes, including\nterrorism or violent extremism;\n\nV. Intentionally distribute viruses, worms, defects, Trojan horses, corrupted files, hoaxes, or any\nother items of a destructive or deceptive nature;\n\nVI. Conduct or forward multi-level marketing, such as pyramid schemes and the like;\n\nVII. Generate or facilitate calls, SMS, MMS, other text messages push notifications, or other\nuninvited communications in violation of the Telephone Consumer Protection Act, the Do-\nNot-Call Implementation Act, or any other applicable law including anti- spam, telemarketing,\nrobocalling, caller ID spoofing, or telephone consumer protection laws or regulations;\n\nVIII. Use the services in any manner that violates any applicable industry standards, third-party\npolicies, or requirements that Salesforce may communicate to its users, including all of the\napplicable guidelines published by the CTIA, the Mobile Marketing Association, the Self-\nRegulatory Principles as directed by the Digital Advertising Alliance and the Network\nAdvertising Initiative, or any other generally accepted industry associations, carrier\nguidelines, or other industry standards;\nSalesforce Acceptable Use and External-Facing Services Policy 3\n\nIX. Create, send, upload, display, store, process, or transmit material or otherwise use the\nServices in a way that may be harmful to minors including, but not limited to, for any purposes\nrelated to child exploitation or abuse, such as real or artificial Child Sexual Abuse Material\n(CSAM);\n\nX. Illegally send, upload, display, store, process, or transmit another’s intellectual property or\nother proprietary information without such owner’s or licensor’s permission;\n\nXI. Impersonate another person, entity, or Salesforce (via the use of an email address or\notherwise) or otherwise misrepresent themselves or the source of any communication;\n\nXII. Facilitate or engage in coordinated inauthentic behavior for the purposes of manipulating\npublic debate;\n\nXIII. Violate the rights (such as rights of privacy or publicity) of others;\n\nXIV. Promote, facilitate, or encourage illegal activity;\n\nXV. Intentionally or unintentionally interfere with the availability of the service for other users,\nincluding, but not limited to, engaging in usage practices prohibited by the Documentation;\n\nXVI. Mislead people about voting processes or census processes;\n\nXVII. Engage in activity in connection with illegal peer-to-peer file sharing;\n\nXVIII. Engage in or promote gambling, or run a gambling operation;\n\nXIX. “Mine” bitcoins and other cryptocurrencies;\n\nXX. Sell, distribute, or export illegal or prescription drugs or other controlled substances or\nparaphernalia;\n\nXXI. Operate an “open proxy” or any other form of Internet proxy service that is capable of\nforwarding requests to any end user or third-party-supplied Internet host;\n\nXXII. Perform significant load or security testing without first obtaining Salesforce’s written\nconsent;\n\nXXIII. Remove any copyright, trademark, or other proprietary rights notices contained in or on the\nservice or reformat or frame any portion of the web pages that are part of the service’s\nadministration display;\n\nXXIV. Access a third-party web property for the purposes of web scraping, web crawling, web\nmonitoring, or other similar activity through a web client that does not take commercially\nreasonable efforts to identify itself via a unique User Agent string describing the purpose of\nthe web client and obey the robots exclusion standard (also known as the robots.txt\nstandard), including the crawl-delay directive;\n\nXXV. Use a service in any manner that would disparage Salesforce;\n\nXXVI. Directly manage, as the primary operator, private, for-profit prison facilities or detention\ncenters in the United States. For-profit prisons and detention centers refer to privately owned\nfacilities in which persons are incarcerated or otherwise involuntarily confined for purposes\nof execution of a punitive sentence imposed by a court or detention pending a trial, hearing,\nor other judicial or administrative proceeding;\n\nXXVII. Engage in activity where the use or failure of a service may result in the death or serious bodily\nharm of a person, or in significant damage to property.\n\nB. Worldwide, customers may not use a service to commercially advertise or sell any of the following\nfirearms and/or related accessories to private citizens. Firearms: automatic firearms; semi-automatic\nfirearms that have the capacity to accept a detachable magazine and any of the following: thumbhole\nSalesforce Acceptable Use and External-Facing Services Policy\nstock, folding or telescoping stock, grenade launcher or flare launcher, flash or sound suppressor,\nforward pistol grip, pistol grip (in the case of a rifle) or second pistol grip (in the case of a pistol), barrel\nshroud; semi-automatic firearms with a fixed magazine that can accept more than 10 rounds; ghost\nguns; 3D printed guns; firearms without serial numbers; .50 BMG rifles; firearms that use .50 BMG\nammunition. Firearm Parts: magazines capable of accepting more than 10 rounds; flash or sound\nsuppressors; multi-burst trigger devices; grenade or rocket launchers; 80% or unfinished lower\nreceivers; blueprints for ghost guns; blueprints for 3D printed guns; barrel shrouds; thumbhole stocks;\nthreaded barrels capable of accepting a flash suppressor or sound suppressor.\n\n7. U.S. Digital Millennium Copyright Act or Similar Statutory Obligations\n\nA. To the extent a customer uses the services for hosting, advertising, sending electronic messages, or\nfor the creation and hosting of, or for posting material on, websites, each customer must:\n\nI. Comply with any notices received under Title II of the Digital Millennium Copyright Act of 1998\n(Section 512 of the U.S. Copyright Act) or similar statute in other countries (the “DMCA”);\n\nII. Set up a process to expeditiously respond to notices of alleged infringement that comply with\nthe DMCA and to implement a DMCA-compliant repeat infringers policy;\n\nIII. Publicly display a description of its notice and takedown process under the DMCA on its\ninstance of the services; and\n\nIV. Comply with such processes, policy(ies), and description.\n\nB. It is Salesforce’s policy to respond expeditiously to valid notices of claimed copyright infringement\ncompliant with the DMCA. In appropriate circumstances, Salesforce will terminate the accounts of\ncustomers who Salesforce suspects to be repeatedly or blatantly infringing copyrights.\n\nC. If Salesforce receives a notice alleging that material on a customer’s instance of a service infringes\nanother party’s intellectual property, Salesforce may disable that customer’s instance of the service\nor remove the allegedly infringing material. If Salesforce receives more than one such notice for the\nsame customer, Salesforce reserves the right to immediately terminate such customer’s subscriptions\nto the services as deemed necessary by Salesforce to ensure continued protection under the safe\nharbor provisions under the DMCA or to prevent violations of other applicable laws or third parties’\nrights."
}