{
  "key": "san-francisco-font",
  "short_name": "San Francisco Font License",
  "name": "Apple San Francisco Font License",
  "category": "Proprietary Free",
  "owner": "Apple",
  "homepage_url": "https://sf.abarba.me/LICENSE.pdf",
  "spdx_license_key": "LicenseRef-scancode-san-francisco-font",
  "text": "APPLE INC.\nLICENSE AGREEMENT FOR THE APPLE SAN FRANCISCO FONT\nFor iOS, OS X and tvOS application uses only\n\nPLEASE READ THIS SOFTWARE LICENSE AGREEMENT (\"LICENSE\") CAREFULLY BEFORE USING\nTHE APPLE SAN FRANCISCO FONT (DEFINED BELOW). BY USING THE APPLE FONT, YOU ARE\nAGREEING TO BE BOUND BY THE TERMS OF THIS LICENSE. IF YOU ARE ACCESSING THE\nAPPLE FONT ELECTRONICALLY, SIGNIFY YOUR AGREEMENT TO BE BOUND BY THE TERMS OF\nTHIS LICENSE BY CLICKING THE \"AGREE \" BUTTON. IF YOU DO NOT AGREE TO THE TERMS OF\nTHIS LICENSE, DO NOT USE THE APPLE FONT AND CLICK \"DISAGREE\".\n\nIMPORTANT NOTE: THE APPLE SAN FRANCISCO FONT IS TO BE USED SOLELY FOR CREATING\nMOCK-UPS OF USER INTERFACES TO BE USED IN SOFTWARE PRODUCTS RUNNING ON\nAPPLE’S iOS, OS X OR tvOS OPERATING SYSTEMS, AS APPLICABLE.\n\n1. General.\n\nA. The Apple font, interfaces, content, data, and other materials accompanying this License, whether on\ndisk, print or electronic documentation, in read only memory, or any other media or in any other form,\n(collectively, the \"Apple Font\") are licensed, not sold, to you by Apple Inc. (\"Apple\") for use only under\nthe terms of this License. Apple and/or Apple’s licensors retain ownership of the Apple Font itself and\nreserve all rights not expressly granted to you. The terms of this License will govern any software\nupgrades provided by Apple that replace and/or supplement the original Apple Font, unless such\nupgrade is accompanied by a separate license in which case the terms of that license will govern.\n\nB. Title and intellectual property rights in and to any content displayed by or accessed through the Apple\nFont belongs to the respective content owner. Such content may be protected by copyright or other\nintellectual property laws and treaties, and may be subject to terms of use of the third party providing\nsuch content. This License does not grant you any rights to use such content nor does it guarantee that\nsuch content will continue to be available to you.\n\n2. Permitted License Uses and Restrictions.\n\nA. Limited License. Subject to the terms of this License, you may use the Apple Font solely for creating\nmock-ups of user interfaces to be used in software products running on Apple’s iOS, OS X or tvOS\noperating systems, as applicable. The foregoing right includes the right to show the Apple Font in screen\nshots, images, mock-ups or other depictions, digital and/or print, of such software products running\nsolely on iOS, OS X or tvOS.\n\nYou may use this Apple Font only for the purposes described in this License and only if you are a\nregistered Apple Developer, or as otherwise expressly permitted by Apple in writing.\n\nB. Other Use Restrictions. The grants set forth in this License do not permit you to, and you agree not to,\ninstall, use or run the Apple Font for the purpose of creating mock-ups of user interfaces to be used in\nsoftware products running on any non-Apple operating system or to enable others to do so. You may not\nembed the Apple Font in any software programs or other products. Except as expressly provided for\nherein, you may not use the Apple Font to, create, develop, display or otherwise distribute any\ndocumentation, artwork, website content or any other work product.\n\nExcept as otherwise expressly permitted by the terms of this License or as otherwise licensed by Apple:\n(i) only one user may use the Apple Font at a time, and (ii) you may not make the Apple Font available\nover a network where it could be run or used by multiple computers at the same time. You may not rent,\nlease, lend, trade, transfer, sell, sublicense or otherwise redistribute the Apple Font in any unauthorized\nway.\n\nC. No Reverse Engineering; Limitations. You may not, and you agree not to or to enable others to, copy \n(except as expressly permitted by this License), decompile, reverse engineer, disassemble, attempt to\nderive the source code of, decrypt, modify, create derivative works of the Apple Font or any part thereof\n(except as and only to the extent any foregoing restriction is prohibited by applicable law).\n\nD. Compliance with Laws. You agree to use the Apple Font in compliance with all applicable laws,\nincluding local laws of the country or region in which you reside or in which you download or use the\nApple Font.\n\n3. No Transfer. Except as otherwise set forth herein, you may not transfer this Apple Font without\nApple’s express prior written approval. All components of the Apple Font are provided as part of a\nbundle and may not be separated from the bundle and distributed as standalone applications.\n\n4. Termination. This License shall commence upon your installation or use of the Apple Font. Your rights\nunder this License will terminate automatically or cease to be effective without notice from Apple (a) if\nyou fail to comply with any term(s) of this License, (b) if you are no longer a registered Apple Developer,\nor (c) if Apple releases a version of the Apple Font which is incompatible with this version of the Apple\nFont. Upon the termination of this License, you shall cease all use of the Apple Font and destroy all\ncopies, full or partial, of the Apple Font. Section 2B, 2C, and 5 through 10 of this License shall survive\nany termination.\n\n5. Disclaimer of Warranties.\n\nA. YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW, USE OF THE APPLE FONT IS AT YOUR SOLE RISK AND THAT THE ENTIRE RISK\nAS TO SATISFACTORY QUALITY, PERFORMANCE, ACCURACY AND EFFORT IS WITH YOU.\n\nB. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, THE APPLE FONT IS PROVIDED\n\"AS IS\" AND \"AS AVAILABLE\", WITH ALL FAULTS AND WITHOUT WARRANTY OF ANY KIND, AND\nAPPLE AND APPLE'S LICENSORS (COLLECTIVELY REFERRED TO AS \"APPLE\" FOR THE PURPOSES\nOF SECTIONS 5 AND 6) HEREBY DISCLAIM ALL WARRANTIES AND CONDITIONS WITH RESPECT TO\nTHE APPLE FONT, EITHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES AND/OR CONDITIONS OF MERCHANTABILITY, SATISFACTORY QUALITY,\nFITNESS FOR A PARTICULAR PURPOSE, ACCURACY, QUIET ENJOYMENT, AND NONINFRINGEMENT\nOF THIRD PARTY RIGHTS.\n\nC. APPLE DOES NOT WARRANT AGAINST INTERFERENCE WITH YOUR ENJOYMENT OF THE APPLE\nFONT, THAT THE FUNCTIONS CONTAINED IN THE APPLE FONT WILL MEET YOUR REQUIREMENTS,\nTHAT THE OPERATION OF THE APPLE FONT WILL BE UNINTERRUPTED OR ERROR-FREE, THAT THE\nAPPLE FONT WILL BE COMPATIBLE OR WORK WITH ANY THIRD PARTY SOFTWARE, APPLICATIONS\nOR THIRD PARTY SERVICES, OR THAT DEFECTS IN THE APPLE FONT WILL BE CORRECTED.\nINSTALLATION OF THIS APPLE FONT MAY AFFECT THE AVAILABILITY AND USABILITY OF THIRD\nPARTY SOFTWARE, APPLICATIONS OR THIRD PARTY SERVICES, AS WELL AS APPLE PRODUCTS\nAND SERVICES.\n\nD. YOU FURTHER ACKNOWLEDGE THAT THE APPLE FONT IS NOT INTENDED OR SUITABLE FOR\nUSE IN SITUATIONS OR ENVIRONMENTS WHERE THE FAILURE OR TIME DELAYS OF, OR ERRORS\nOR INACCURACIES IN THE CONTENT, DATA OR INFORMATION PROVIDED BY, THE APPLE FONT\nCOULD LEAD TO DEATH, PERSONAL INJURY, OR SEVERE PHYSICAL OR ENVIRONMENTAL\nDAMAGE, INCLUDING WITHOUT LIMITATION THE OPERATION OF NUCLEAR FACILITIES, AIRCRAFT\nNAVIGATION OR COMMUNICATION SYSTEMS, AIR TRAFFIC CONTROL, LIFE SUPPORT OR\nWEAPONS SYSTEMS.\n\nE. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY APPLE OR AN APPLE AUTHORIZED\nREPRESENTATIVE SHALL CREATE A WARRANTY. SHOULD THE APPLE FONT PROVE DEFECTIVE,\nYOU ASSUME THE ENTIRE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n6. Limitation of Liability. TO THE EXTENT NOT PROHIBITED BY APPLICABLE LAW, IN NO EVENT\nSHALL APPLE BE LIABLE FOR PERSONAL INJURY, OR ANY INCIDENTAL, SPECIAL, INDIRECT OR\nCONSEQUENTIAL DAMAGES WHATSOEVER, INCLUDING, WITHOUT LIMITATION, DAMAGES FOR\nLOSS OF PROFITS, CORRUPTION OR LOSS OF DATA, FAILURE TO TRANSMIT OR RECEIVE ANY\nDATA OR INFORMATION, BUSINESS INTERRUPTION OR ANY OTHER COMMERCIAL DAMAGES OR\nLOSSES, ARISING OUT OF OR RELATED TO YOUR USE OR INABILITY TO USE THE APPLE FONT OR\nANY THIRD PARTY SOFTWARE, APPLICATIONS, OR SERVICES IN CONJUNCTION WITH THE APPLE\nFONT, HOWEVER CAUSED, REGARDLESS OF THE THEORY OF LIABILITY (CONTRACT, TORT OR\nOTHERWISE) AND EVEN IF APPLE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF LIABILITY FOR\nPERSONAL INJURY, OR OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS LIMITATION MAY\nNOT APPLY TO YOU. In no event shall Apple's total liability to you for all damages (other than as may be\nrequired by applicable law in cases involving personal injury) exceed the amount of fifty dollars ($50.00).\nThe foregoing limitations will apply even if the above stated remedy fails of its essential purpose.\n\n7. Export Control. You may not use or otherwise export or re-export the Apple Font except as\nauthorized by United States law and the laws of the jurisdiction(s) in which the Apple Font was obtained.\nIn particular, but without limitation, the Apple Font may not be exported or re-exported (a) into any U.S.\nembargoed countries or (b) to anyone on the U.S. Treasury Department's list of Specially Designated\nNationals or the U.S. Department of Commerce Denied Person's List or Entity List or any other restricted\nparty lists. By using the Apple Font, you represent and warrant that you are not located in any such\ncountry or on any such list. You also agree that you will not use the Apple Font for any purposes\nprohibited by United States law, including, without limitation, the development, design, manufacture or\nproduction of missiles, nuclear, chemical or biological weapons.\n\n8. Government End Users. The Apple Font and related documentation are \"Commercial Items\", as that\nterm is defined at 48 C.F.R. §2.101, consisting of \"Commercial Computer Software\" and \"Commercial\nComputer Software Documentation\", as such terms are used in 48 C.F.R. §12.212 or 48 C.F.R.\n§227.7202, as applicable. Consistent with 48 C.F.R. §12.212 or 48 C.F.R. §227.7202-1 through\n227.7202-4, as applicable, the Commercial Computer Software and Commercial Computer Software\nDocumentation are being licensed to U.S. Government end users (a) only as Commercial Items and (b)\nwith only those rights as are granted to all other end users pursuant to the terms and conditions herein.\nUnpublished-rights reserved under the copyright laws of the United States.\n\n9. Controlling Law and Severability. This License will be governed by and construed in accordance\nwith the laws of the State of California, excluding its conflict of law principles. This License shall not be\ngoverned by the United Nations Convention on Contracts for the International Sale of Goods, the\napplication of which is expressly excluded. If for any reason a court of competent jurisdiction finds any\nprovision, or portion thereof, to be unenforceable, the remainder of this License shall continue in full\nforce and effect.\n\n10. Complete Agreement; Governing Language. This License constitutes the entire agreement\nbetween you and Apple relating to the use of the Apple Font licensed hereunder and supersedes all prior\nor contemporaneous understandings regarding such subject matter. No amendment to or modification\nof this License will be binding unless in writing and signed by Apple. To the extent that there are any\ninconsistent terms in any applicable Apple software license agreements, these terms shall govern your\nuse of the Apple Font.\n\nEA1370\n2/24/2016"
}