{
  "key": "sax-pd",
  "short_name": "SAX-PD",
  "name": "SAX Public Domain Notice",
  "category": "Public Domain",
  "owner": "SAX Project",
  "homepage_url": "http://www.saxproject.org/copying.html",
  "spdx_license_key": "SAX-PD",
  "text_urls": [
    "http://www.saxproject.org/copying.html"
  ],
  "text": "Copyright Status for SAX\n\nSAX is free!\n\nIn fact, it's not possible to own a license to SAX, since it's been placed in\nthe public domain.\n\nNo Warranty\n\nBecause SAX is released to the public domain, there is no warranty for the\ndesign or for the software implementation, to the extent permitted by applicable\nlaw. Except when otherwise stated in writing the copyright holders and/or other\nparties provide SAX \"as is\" without warranty of any kind, either expressed or\nimplied, including, but not limited to, the implied warranties of\nmerchantability and fitness for a particular purpose. The entire risk as to the\nquality and performance of SAX is with you. Should SAX prove defective, you\nassume the cost of all necessary servicing, repair or correction.\n\nIn no event unless required by applicable law or agreed to in writing will any\ncopyright holder, or any other party who may modify and/or redistribute SAX, be\nliable to you for damages, including any general, special, incidental or\nconsequential damages arising out of the use or inability to use SAX (including\nbut not limited to loss of data or data being rendered inaccurate or losses\nsustained by you or third parties or a failure of the SAX to operate with any\nother programs), even if such holder or other party has been advised of the\npossibility of such damages.\n\nCopyright Disclaimers\n\nThis page includes statements to that effect by David Megginson, who would have\nbeen able to claim copyright for the original work.\n\nSAX 1.0\n\nVersion 1.0 of the Simple API for XML (SAX), created collectively by the\nmembership of the XML-DEV mailing list, is hereby released into the public\ndomain.\n\nNo one owns SAX: you may use it freely in both commercial and non-commercial\napplications, bundle it with your software distribution, include it on a CD-ROM,\nlist the source code in a book, mirror the documentation at your own web site,\nor use it in any other way you see fit.\n\nDavid Megginson, Megginson Technologies Ltd.\n1998-05-11\n\nSAX 2.0\n\nI hereby abandon any property rights to SAX 2.0 (the Simple API for XML), and\nrelease all of the SAX 2.0 source code, compiled code, and documentation\ncontained in this distribution into the Public Domain. SAX comes with NO\nWARRANTY or guarantee of fitness for any purpose.\n\nDavid Megginson, Megginson Technologies Ltd.\n2000-05-05"
}