{
  "key": "sbia-b",
  "short_name": "SBIA Part B",
  "name": "SBIA Software license - Downloading Agreement",
  "category": "Permissive",
  "owner": "SBIA",
  "homepage_url": "https://www.cbica.upenn.edu/sbia/software/license.html",
  "spdx_license_key": "LicenseRef-scancode-sbia-b",
  "minimum_coverage": 60,
  "text": "PART B. DOWNLOADING AGREEMENT - LICENSE FROM SBIA WITH RIGHT TO SUBLICENSE (\"SOFTWARE LICENSE\").\n------------------------------------------------------------------------------------------------\n\n1. As used in this Software License, \"you\" means the individual downloading and/or\n   using, reproducing, modifying, displaying and/or distributing the Software and\n   the institution or entity which employs or is otherwise affiliated with such\n   individual in connection therewith. The Section of Biomedical Image Analysis,\n   Department of Radiology at the Universiy of Pennsylvania (\"SBIA\") hereby grants\n   you, with right to sublicense, with respect to SBIA's rights in the software,\n   and data, if any, which is the subject of this Software License (collectively,\n   the \"Software\"), a royalty-free, non-exclusive license to use, reproduce, make\n   derivative works of, display and distribute the Software, provided that:\n   (a) you accept and adhere to all of the terms and conditions of this Software\n   License; (b) in connection with any copy of or sublicense of all or any portion\n   of the Software, all of the terms and conditions in this Software License shall\n   appear in and shall apply to such copy and such sublicense, including without\n   limitation all source and executable forms and on any user documentation,\n   prefaced with the following words: \"All or portions of this licensed product\n   (such portions are the \"Software\") have been obtained under license from the\n   Section of Biomedical Image Analysis, Department of Radiology at the University\n   of Pennsylvania and are subject to the following terms and conditions:\"\n   (c) you preserve and maintain all applicable attributions, copyright notices\n   and licenses included in or applicable to the Software; (d) modified versions\n   of the Software must be clearly identified and marked as such, and must not\n   be misrepresented as being the original Software; and (e) you consider making,\n   but are under no obligation to make, the source code of any of your modifications\n   to the Software freely available to others on an open source basis.\n\n2. The license granted in this Software License includes without limitation the\n   right to (i) incorporate the Software into proprietary programs (subject to\n   any restrictions applicable to such programs), (ii) add your own copyright\n   statement to your modifications of the Software, and (iii) provide additional\n   or different license terms and conditions in your sublicenses of modifications\n   of the Software; provided that in each case your use, reproduction or\n   distribution of such modifications otherwise complies with the conditions\n   stated in this Software License.\n\n3. This Software License does not grant any rights with respect to third party\n   software, except those rights that SBIA has been authorized by a third\n   party to grant to you, and accordingly you are solely responsible for\n   (i) obtaining any permissions from third parties that you need to use,\n   reproduce, make derivative works of, display and distribute the Software,\n   and (ii) informing your sublicensees, including without limitation your\n   end-users, of their obligations to secure any such required permissions.\n\n4. The Software has been designed for research purposes only and has not been\n   reviewed or approved by the Food and Drug Administration or by any other\n   agency. YOU ACKNOWLEDGE AND AGREE THAT CLINICAL APPLICATIONS ARE NEITHER\n   RECOMMENDED NOR ADVISED. Any commercialization of the Software is at the\n   sole risk of the party or parties engaged in such commercialization.\n   You further agree to use, reproduce, make derivative works of, display\n   and distribute the Software in compliance with all applicable governmental\n   laws, regulations and orders, including without limitation those relating\n   to export and import control.\n\n5. The Software is provided \"AS IS\" and neither SBIA nor any contributor to\n   the software (each a \"Contributor\") shall have any obligation to provide\n   maintenance, support, updates, enhancements or modifications thereto.\n   SBIA AND ALL CONTRIBUTORS SPECIFICALLY DISCLAIM ALL EXPRESS AND IMPLIED\n   WARRANTIES OF ANY KIND INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF\n   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT.\n   IN NO EVENT SHALL SBIA OR ANY CONTRIBUTOR BE LIABLE TO ANY PARTY FOR\n   DIRECT, INDIRECT, SPECIAL, INCIDENTAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES\n   HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY ARISING IN ANY WAY RELATED\n   TO THE SOFTWARE, EVEN IF SBIA OR ANY CONTRIBUTOR HAS BEEN ADVISED OF THE\n   POSSIBILITY OF SUCH DAMAGES. TO THE MAXIMUM EXTENT NOT PROHIBITED BY LAW OR\n   REGULATION, YOU FURTHER ASSUME ALL LIABILITY FOR YOUR USE, REPRODUCTION,\n   MAKING OF DERIVATIVE WORKS, DISPLAY, LICENSE OR DISTRIBUTION OF THE SOFTWARE\n   AND AGREE TO INDEMNIFY AND HOLD HARMLESS SBIA AND ALL CONTRIBUTORS FROM\n   AND AGAINST ANY AND ALL CLAIMS, SUITS, ACTIONS, DEMANDS AND JUDGMENTS ARISING\n   THEREFROM.\n\n6. None of the names, logos or trademarks of SBIA or any of SBIA's affiliates\n   or any of the Contributors, or any funding agency, may be used to endorse\n   or promote products produced in whole or in part by operation of the Software\n   or derived from or based on the Software without specific prior written\n   permission from the applicable party.\n\n7. Any use, reproduction or distribution of the Software which is not in accordance\n   with this Software License shall automatically revoke all rights granted to you\n   under this Software License and render Paragraphs 1 and 2 of this Software\n   License null and void.\n\n8. This Software License does not grant any rights in or to any intellectual\n   property owned by SBIA or any Contributor except those rights expressly\n   granted hereunder.\n\n\nPART C. MISCELLANEOUS\n---------------------\n\nThis Agreement shall be governed by and construed in accordance with the laws\nof The Commonwealth of Pennsylvania without regard to principles of conflicts\nof law. This Agreement shall supercede and replace any license terms that you\nmay have agreed to previously with respect to Software from SBIA."
}