{
  "key": "scilab-en-2005",
  "short_name": "SCILAB en 2005",
  "name": "SCILAB License 2005",
  "category": "Proprietary Free",
  "owner": "Scilab Consortium (Digiteo)",
  "homepage_url": "http://web.archive.org/web/20051212214843/http://www.scilab.org/legal/license.html",
  "spdx_license_key": "LicenseRef-scancode-scilab-en",
  "other_spdx_license_keys": [
    "LicenseRef-scancode-scilba-en"
  ],
  "text_urls": [
    "https://directory.fsf.org/wiki/License:Scilab-old"
  ],
  "ignorable_copyrights": [
    "Scilab (c) INRIA-ENPC."
  ],
  "ignorable_holders": [
    "Scilab INRIA-ENPC."
  ],
  "ignorable_authors": [
    "INRIA"
  ],
  "text": "Important notice : this is a translation of the original license\nwritten in French\n\nSCILAB License\n\n1- Preface\n\nThe aim of this license is to lay down the conditions enabling you to\nuse, modify and circulate the SOFTWARE. However, INRIA and ENPC remain\nthe authors of the SOFTWARE and so retain property rights and the use\nof all ancillary rights.\n\n2- Definitions\n\nThe SOFTWARE is defined as all successive versions of SCILAB software\nand their documentation that have been developed by INRIA and ENPC.\n\nSCILAB DERIVED SOFTWARE is defined as all or part of the SOFTWARE that\nyou have modified and/or translated and/or adapted.\n\nSCILAB COMPOSITE SOFTWARE is defined as all or a part of the SOFTWARE\nthat you have interfaced with a software, an application package or a\ntoolbox of which you are owner or entitled beneficiary.\n\n3- Object and conditions of the SOFTWARE license\n\n   1. INRIA and ENPC authorize you free of charge, to reproduce the\n      SOFTWARE source and/or object code on any present and future\n      support, without restriction, providing the following reference\n      appears in all the copies: Scilab (c)INRIA-ENPC.\n\n   2. INRIA and ENPC authorize you free of charge to correct any bugs,\n      carry out any modifications required for the porting of the\n      SOFTWARE and to carry out any usual functional modification or\n      correction, providing you insert a patch file or you indicate by\n      any other equivalent means the nature and date of the\n      modification or the correction, on the corresponding file(s) of\n      the SOFTWARE.\n\n   3. INRIA and ENPC authorize you free of charge to use the SOFTWARE\n      source and/or object code, without restriction, providing the\n      following reference appears in all the copies: Scilab\n      (c)INRIA-ENPC.\n\n   4. INRIA and ENPC authorize you free of charge to circulate and\n      distribute, free of charge or for a fee, the SOFTWARE source\n      and/or object code, including the SOFTWARE modified in\n      accordance with above-mentioned article 3 b), on any present and\n      future support, providing: * the following reference appears in\n      all the copies: Scilab (c)INRIA-ENPC.  * the SOFTWARE is\n      circulated or distributed under the present license.  * patch\n      files or files containing equivalent means indicating the nature\n      and the date of the modification or the correction to the\n      SOFTWARE file(s) concerned are freely circulated.\n\n4- Object and conditions of the DERIVED SOFTWARE license\n\n   1. INRIA and ENPC authorize you free of charge to reproduce and\n      modify and/or translate and/or adapt all or part of the source\n      and/or the object code of the SOFTWARE, providing a patch file\n      indicating the date and the nature of the modification and/or\n      the translation and/or the adaptation and the name of their\n      author in the SOFTWARE file(s) concerned is inserted. The\n      SOFTWARE thus modified is defined as DERIVED SOFTWARE. The INRIA\n      authorizes you free of charge to use the source and/or object\n      code of the SOFTWARE, without restriction, providing the\n      following reference appears in all the copies: Scilab\n      (c)INRIA-ENPC.\n\n   2. INRIA and ENPC authorize you free of charge to use the SOFTWARE\n      source and/or object code modified according to article 4-a)\n      above, without restriction, providing the following reference\n      appears in all the copies: \"Scilab inside (c)INRIA-ENPC\".\n\n   3. The INRIA and the ENPC authorize you free of charge to circulate\n      and distribute for no charge, for non-commercial purposes the\n      source and/or object code of DERIVED SOFTWARE on any present and\n      future support, providing: * the reference \" Scilab inside\n      (c)INRIA-ENPC \" is prominently mentioned; * the DERIVED SOFTWARE\n      is distributed under the present license; * the recipients of\n      the distribution can access the SOFTWARE code source; * the\n      DERIVED SOFTWARE is distributed under a name other than SCILAB.\n\n   4. Any commercial use or circulation of the DERIVED SOFTWARE shall\n      have been previously authorized by INRIA and ENPC.\n\n5- Object and conditions of the license concerning COMPOSITE SOFTWARE\n\n   1. INRIA and ENPC authorize you to reproduce and interface all or\n      part of the SOFTWARE with all or part of other software,\n      application packages or toolboxes of which you are owner or\n      entitled beneficiary in order to obtain COMPOSITE SOFTWARE.\n\n   2. INRIA and ENPC authorize you free, of charge, to use the\n      SOFTWARE source and/or object code included in the COMPOSITE\n      SOFTWARE, without restriction, providing the following statement\n      appears in all the copies: \"composite software using Scilab\n      (c)INRIA-ENPC functionality\".\n\n   3. INRIA and ENPC authorize you, free of charge, to circulate and\n      distribute for no charge, for purposes other than commercial,\n      the source and/or object code of COMPOSITE SOFTWARE on any\n      present and future support, providing: * the following reference\n      is prominently mentioned: \"composite software using Scilab\n      (c)INRIA-ENPC functionality \"; * the SOFTWARE included in\n      COMPOSITE SOFTWARE is distributed under the present license ; *\n      recipients of the distribution have access to the SOFTWARE\n      source code; * the COMPOSITE SOFTWARE is distributed under a\n      name other than SCILAB.\n\n   4. Any commercial use or distribution of COMPOSITE SOFTWARE shall\n      have been previously authorized by INRIA and ENPC.\n\n6- Limitation of the warranty\n\nExcept when mentioned otherwise in writing, the SOFTWARE is supplied\nas is, with no explicit or implicit warranty, including warranties of\ncommercialization or adaptation. You assume all risks concerning the\nquality or the effects of the SOFTWARE and its use. If the SOFTWARE is\ndefective, you will bear the costs of all required services,\ncorrections or repairs.\n\n7- Consent\n\nWhen you access and use the SOFTWARE, you are presumed to be aware of\nand to have accepted all the rights and obligations of the present\nlicense.\n\n8- Binding effect\n\nThis license has the binding value of a contract.\n\nYou are not responsible for respect of the license by a third party.\n\n9- Applicable law\n\nThe present license and its effects are subject to French law and the\ncompetent French courts."
}