{
  "key": "scilab-fr",
  "language": "fr",
  "short_name": "SCILAB FR",
  "name": "Licence SCILAB",
  "category": "Proprietary Free",
  "owner": "Scilab Consortium (Digiteo)",
  "homepage_url": "http://web.archive.org/web/20051212214843/http://www.scilab.org/legal/license.html",
  "spdx_license_key": "LicenseRef-scancode-scilab-fr",
  "text_urls": [
    "https://directory.fsf.org/wiki/License:Scilab-old"
  ],
  "ignorable_copyrights": [
    "Scilab (c) INRIA-ENPC",
    "Scilab (c) INRIA-ENPC.",
    "Scilab inside (c) INRIA-ENPC"
  ],
  "ignorable_holders": [
    "Scilab INRIA-ENPC",
    "Scilab INRIA-ENPC.",
    "Scilab inside INRIA-ENPC"
  ],
  "text": "Licence SCILAB\n\n1- Préambule\n\nLa présente licence a pour objet d'établir les conditions dans\nlesquelles vous pouvez utiliser, modifier et diffuser le\nLOGICIEL. Toutefois l'INRIA et l'ENPC demeurent les auteurs du\nLOGICIEL et conservent la jouissance et l'usage de tous les droits qui\ny sont attachés.\n\n2- Définitions\n\nLe LOGICIEL est constitué par toutes les versions successives du\nlogiciel SCILAB, et de leur documentation, développées par l'INRIA et\nl'ENPC.\n\nLes LOGICIELS DERIVES de SCILAB sont constitués de tout ou partie du\nLOGICIEL que vous avez modifié et/ou traduit et/ou adapté.\n\nLes LOGICIELS COMPOSITES de SCILAB sont constitués de tout ou partie\ndu LOGICIEL que vous avez mis en interface avec un logiciel, un\nprogiciel ou une boîte à outils dont vous êtres propriétaire ou ayant\ndroit.\n\n3- Objet et conditions de la licence portant sur le LOGICIEL\n\n   1. L'INRIA et l'ENPC vous autorisent, gratuittement, à reproduire\n      sur tout support présent et à venir le code source et/ou le code\n      objet du LOGICIEL, sans restriction, à condition de faire\n      figurer sur toutes les copies la mention du copyright suivante :\n      Scilab (c)INRIA-ENPC.\n\n   2. L'INRIA et l'ENPC vous autorisent gratuitement à corriger les\n      bogues éventuels, à effectuer les modifications nécessaires au\n      portage du LOGICIEL et à procéder à toute modification ou\n      correction fonctionnelle usuelle, à condition d'insérer un\n      fichier patch, ou d'indiquer par tout autre moyen équivalent la\n      nature et la date de la modification ou de la correction\n      apportée, sur le(s) fichier(s) concerné(s) du LOGICIEL.\n\n   3. L'INRIA et l'ENPC vous autorisent gratuitement, à utiliser le\n      code source et/ou le code objet du LOGICIEL, sans restriction, à\n      condition de faire figurer sur toutes les copies la mention du\n      copyright suivante : Scilab (c)INRIA-ENPC.\n\n   4. L'INRIA et l'ENPC vous autorisent gratuitement, à diffuser et\n      distribuer gratuitement ou à titre onéreux le code source et/ou\n      le code objet du LOGICIEL y compris du LOGICIEL modifié\n      conformément à l'article 3 b) ci-dessus, sur tout support\n      présent et à venir, à condition : * de faire figurer sur toutes\n      les copies la mention du copyright suivante : Scilab\n      (c)INRIA-ENPC.  * de diffuser ou de distribuer le LOGICIEL sous\n      la présente licence.  * de diffuser librement les fichiers patch\n      ou les fichiers contenant les moyens équivalents indiquant la\n      nature et la date de la modification ou de la correction\n      apportée sur le(s) fichier(s) concerné(s) du LOGICIEL.\n\n4- Objet et conditions de la licence portant sur les LOGICIELS DERIVES\n\n   1. L'INRIA et l'ENPC vous autorisent, gratuitement, à reproduire et\n      à modifier et/ou à traduire et/ou à adapter tout ou partie du\n      code source et/ou du code objet du LOGICIEL, à condition\n      d'insérer un fichier patch indiquant la date et la nature de la\n      modification et/ou de la traduction et/ou de l'adaptation et le\n      nom de leur auteur sur le(s) fichier(s) concerné(s) du\n      LOGICIEL. Le LOGICIEL ainsi modifié constitue des LOGICIELS\n      DERIVES. L'INRIA vous autorise gratuitement, à utiliser le code\n      source et/ou le code objet du LOGICIEL, sans restriction, à\n      condition de faire figurer sur toutes les copies la mention du\n      copyright suivante : Scilab (c)INRIA-ENPC.\n\n   2. L'INRIA et l'ENPC vous autorisent gratuitement, à utiliser le\n      code source et/ou le code objet du LOGICIEL modifié en vertu de\n      l'article 4-a) ci-dessus, sans restriction, à condition de faire\n      figurer sur toutes les copies la mention du copyright suivante :\n      \" Scilab inside (c)INRIA-ENPC \".\n\n   3. L'INRIA et l'ENPC vous autorisent, gratuitement, à diffuser et à\n      distribuer à titre gratuit à des fins autres que commerciales,\n      le code source et/ou le code objet des LOGICIELS DERIVES sur\n      tout support présent et à venir, à condition : * d'indiquer\n      clairement la mention \" Scilab inside (c)INRIA-ENPC \" ; * de\n      distribuer le LOGICIEL DERIVE sous la présente licence ; * de\n      permettre aux destinataires de la distribution d'avoir accès au\n      code source du LOGICIEL ; * de distribuer le LOGICIEL DERIVE\n      sous une autre dénomination que SCILAB.\n\n   4. Toute utilisation ou diffusion commerciale du LOGICIEL DERIVE\n      doit être préalablement autorisée par l'INRIA et l'ENPC.\n\n5- Objet et conditions de la licence portant sur les LOGICIELS COMPOSITES\n\n   1. L'INRIA et l'ENPC vous autorisent à reproduire et à procéder à\n      l'interface de tout ou partie du LOGICIEL, avec tout ou partie\n      d'autres logiciels, progiciels ou boîtes à outils dont vous êtes\n      propriétaires ou titulaires des droits, afin d'obtenir des\n      LOGICIELS COMPOSITES.\n\n   2. L'INRIA et l'ENPC vous autorisent gratuitement, à utiliser le\n      code source et/ou le code objet du LOGICIEL inclus dans le\n      LOGICIEL COMPOSITE, sans restriction, à condition de faire\n      figurer sur toutes les copies la mention du copyright suivante :\n      \" logiciel composite utilisant les fonctionnalités de Scilab\n      (c)INRIA-ENPC \".\n\n   3. L'INRIA et l'ENPC vous autorisent, gratuitement, à diffuser et à\n      distribuer à titre gratuit, à des fins autres que commerciales,\n      le code source et/ou le code objet des LOGICIELS COMPOSITES sur\n      tout support présent et à venir, à condition : * d'indiquer\n      clairement la mention \" logiciel composite utilisant les\n      fonctionnalités de Scilab (c)INRIA-ENPC \" ; * de distribuer le\n      LOGICIEL inclus dans les LOGICIELS COMPOSITES sous la présente\n      licence ; * de permettre aux destinataires de la distribution\n      d'avoir accès au code source du LOGICIEL ; * de distribuer le\n      LOGICIEL COMPOSITE sous une autre dénomination que SCILAB.\n\n   4. Toute utilisation ou diffusion commerciale du LOGICIEL COMPOSITE\n      doit être préalablement autorisée par l'INRIA et l'ENPC.\n\n6- Limitation de garantie\n\nSauf mention écrite contraire, le LOGICIEL est fourni en l'état, sans\naucune garantie explicite ou implicite, y compris les garanties de\ncommercialisation ou d'adaptation. Vous assumez tous les risques quant\nà la qualité ou aux effets du LOGICIEL et de son utilisation. Si le\nLOGICIEL est défectueux, vous assumez le coût de tous les services,\ncorrections ou réparations nécessaires.\n\n7- Consentement\n\nEn accédant et en travaillant sur le LOGICIEL, vous êtes présumé\nconnaître et avoir accepté tous les droits et toutes les obligations\nrésultant de la présente licence.\n\n8- Effet Obligatoire\n\nCette licence a la valeur obligatoire d'un contrat.\n\nVous n'êtes pas responsable du respect de la licence par un tiers.\n\n9- Loi applicable\n\nLa présente licence et ses effets sont soumis au droit français et aux\ntribunaux français compétents."
}