{
  "key": "sgi-glx-1.0",
  "short_name": "SGI GLX Public License 1.0",
  "name": "SGI GLX Public License v1.0",
  "category": "Permissive",
  "owner": "SGI - Silicon Graphics",
  "homepage_url": "http://www.sgi.com/products/software/opensource/glx/glxlicense.txt",
  "spdx_license_key": "LicenseRef-scancode-sgi-glx-1.0",
  "text_urls": [
    "http://velib.kyb.mpg.de/docu/GLX.html"
  ],
  "ignorable_copyrights": [
    "(c) 1991-9 Silicon Graphics, Inc."
  ],
  "ignorable_holders": [
    "Silicon Graphics, Inc."
  ],
  "ignorable_authors": [
    "Silicon Graphics, Inc."
  ],
  "ignorable_urls": [
    "http://www.sgi.com/software/opensource/glx/license.html"
  ],
  "text": "GLX PUBLIC LICENSE Version 1.0 2/11/99 License\n\nSubject to any third party claims, Silicon Graphics, Inc. (\"SGI\") hereby\ngrants permission to Recipient (defined below), under Recipient's copyrights\nin the Original Software (defined below), to use, copy, modify, merge, pub-\nlish, distribute, sublicense and/or sell copies of Subject Software (defined\nbelow), and to permit persons to whom the Subject Software is furnished in\naccordance with this License to do the same, subject to all of the following\nterms and conditions, which Recipient accepts by engaging in any such use,\ncopying, modifying, merging, publishing, distributing, sublicensing or sell-\ning:\n\n1. Definitions.\n\n     (a) \"Original Software\" means source code of computer software code\n     which is described in Exhibit A as Original Software.\n\n     (b) \"Modifications\" means any addition to or deletion from the sub-\n     stance or structure of either the Original Software or any previous\n     Modifications. When Subject Software is released as a series of\n     files, a Modification means (i) any addition to or deletion from\n     the contents of a file containing Original Software or previous\n     Modifications and (ii) any new file that contains any part of the\n     Original Code or previous Modifications.\n\n     (c) \"Subject Software\" means the Original Software or Modifications\n     or the combination of the Original Software and Modifications, or\n     portions of any of the foregoing.\n\n     (d) \"Recipient\" means an individual or a legal entity exercising\n     rights under, and complying with all of the terms of, this License.\n     For legal entities, \"Recipient\" includes any entity which controls,\n     is controlled by, or is under common control with Recipient. For\n     purposes of this definition, \"control\" of an entity means (a) the\n     power, direct or indirect, to direct or manage such entity, or (b)\n     ownership of fifty percent (50%) or more of the outstanding shares\n     or beneficial ownership of such entity.\n\n2. Redistribution of Source Code Subject to These Terms. Redistributions of\nSubject Software in source code form must retain the notice set forth in\nExhibit A, below, in every file. A copy of this License must be included in\nany documentation for such Subject Software where the recipients' rights\nrelating to Subject Software are described. Recipient may distribute the\nsource code version of Subject Software under a license of Recipient's\nchoice, which may contain terms different from this License, provided that\n(i) Recipient is in compliance with the terms of this License, and (ii) the\nlicense terms include this Section 2 and Sections 3, 4, 7, 8, 10, 12 and 13\nof this License, which terms may not be modified or superseded by any other\nterms of such license. If Recipient distributes the source code version under\na different license Recipient must make it absolutely clear that any terms\nwhich differ from this License are offered by Recipient alone, not by SGI.\nRecipient hereby agrees to indemnify SGI for any liability incurred by SGI as\na result of any such terms Recipient offers.\n\n3. Redistribution in Executable Form. The notice set forth in Exhibit A must\nbe conspicuously included in any notice in an executable version of Subject\nSoftware, related documentation or collateral in which Recipient describes\nthe user's rights relating to the Subject Software. Recipient may distribute\nthe executable version of Subject Software under a license of Recipient's\nchoice, which may contain terms different from this License, provided that\n(i) Recipient is in compliance with the terms of this License, and (ii) the\nlicense terms include this Section 3 and Sections 4, 7, 8, 10, 12 and 13 of\nthis License, which terms may not be modified or superseded by any other\nterms of such license. If Recipient distributes the executable version under\na different license Recipient must make it absolutely clear that any terms\nwhich differ from this License are offered by Recipient alone, not by SGI.\nRecipient hereby agrees to indemnify SGI for any liability incurred by SGI as\na result of any such terms Recipient offers.\n\n4. Termination. This License and the rights granted hereunder will terminate\nautomatically if Recipient fails to comply with terms herein and fails to\ncure such breach within 30 days of the breach. Any sublicense to the Subject\nSoftware which is properly granted shall survive any termination of this\nLicense absent termination by the terms of such sublicense. Provisions which,\nby their nature, must remain in effect beyond the termination of this License\nshall survive.\n\n5. No Trademark Rights. This License does not grant any rights to use any\ntrade name, trademark or service mark whatsoever. No trade name, trademark or\nservice mark of SGI may be used to endorse or promote products derived from\nthe Subject Software without prior written permission of SGI.\n\n6. No Other Rights. This License does not grant any rights with respect to\nthe OpenGL API or to any software or hardware implementation thereof or to\nany other software whatsoever, nor shall any other rights or licenses not\nexpressly granted hereunder arise by implication, estoppel or otherwise with\nrespect to the Subject Software. Title to and ownership of the Original Soft-\nware at all times remains with SGI. All rights in the Original Software not\nexpressly granted under this License are reserved.\n\n7. Compliance with Laws; Non-Infringement. Recipient shall comply with all\napplicable laws and regulations in connection with use and distribution of\nthe Subject Software, including but not limited to, all export and import\ncontrol laws and regulations of the U.S. government and other countries.\nRecipient may not distribute Subject Software that (i) in any way infringes\n(directly or contributorily) the rights (including patent, copyright, trade\nsecret, trademark or other intellectual property rights of any kind) of any\nother person or entity or (ii) breaches any representation or warranty,\nexpress, implied or statutory, which under any applicable law it might be\ndeemed to have been distributed.\n\n8. Claims of Infringement. If Recipient at any time has knowledge of any one\nor more third party claims that reproduction, modification, use, distribu-\ntion, import or sale of Subject Software (including particular functionality\nor code incorporated in Subject Software) infringes the third party's intel-\nlectual property rights, Recipient must place in a well-identified web page\nbearing the title \"LEGAL\" a description of each such claim and a description\nof the party making each such claim in sufficient detail that a user of the\nSubject Software will know whom to contact regarding the claim. Also, upon\ngaining such knowledge of any such claim, Recipient must conspicuously\ninclude the URL for such web page in the Exhibit A notice required under Sec-\ntions 2 and 3, above, and in the text of any related documentation, license\nagreement or collateral in which Recipient describes end user's rights relat-\ning to the Subject Software. If Recipient obtains such knowledge after it\nmakes Subject Software available to any other person or entity, Recipient\nshall take other steps (such as notifying appropriate mailing lists or news-\ngroups) reasonably calculated to inform those who received the Subject Soft-\nware that new knowledge has been obtained.\n\n9. DISCLAIMER OF WARRANTY. SUBJECT SOFTWARE IS PROVIDED ON AN \"AS IS\" BASIS,\nWITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT\nLIMITATION, WARRANTIES THAT THE SUBJECT SOFTWARE IS FREE OF DEFECTS, MER-\nCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON- INFRINGING. SGI ASSUMES NO\nRISK AS TO THE QUALITY AND PERFORMANCE OF THE SOFTWARE. SHOULD ANY SOFTWARE\nPROVE DEFECTIVE IN ANY RESPECT, SGI ASSUMES NO COST OR LIABILITY FOR ANY SER-\nVICING, REPAIR OR CORRECTION.  THIS DISCLAIMER OF WARRANTY CONSTITUTES AN\nESSENTIAL PART OF THIS LICENSE. NO USE OF ANY SUBJECT SOFTWARE IS AUTHORIZED\nHEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n10. LIMITATION OF LIABILITY. UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THE-\nORY, WHETHER TORT (INCLUDING, WITHOUT LIMITATION, NEGLIGENCE OR STRICT LIA-\nBILITY), CONTRACT, OR OTHERWISE, SHALL SGI OR ANY SGI LICENSOR BE LIABLE FOR\nANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY\nCHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK\nSTOPPAGE, LOSS OF DATA, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER\nCOMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF\nTHE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY\nTO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SGI's NEGLIGENCE TO\nTHE EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO\nNOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES,\nSO THAT EXCLUSION AND LIMITATION MAY NOT APPLY TO RECIPIENT.\n\n11. Indemnity. Recipient shall be solely responsible for damages arising,\ndirectly or indirectly, out of its utilization of rights under this License.\nRecipient will defend, indemnify and hold harmless Silicon Graphics, Inc.\nfrom and against any loss, liability, damages, costs or expenses (including\nthe payment of reasonable attorneys fees) arising out of Recipient's use,\nmodification, reproduction and distribution of the Subject Software or out of\nany representation or warranty made by Recipient.\n\n12. U.S. Government End Users. The Subject Software is a \"commercial item\"\nconsisting of \"commercial computer software\" as such terms are defined in\ntitle 48 of the Code of Federal Regulations and all U.S.  Government End\nUsers acquire only the rights set forth in this License and are subject to\nthe terms of this License.\n\n13. Miscellaneous. This License represents the complete agreement concerning\nsubject matter hereof. If any provision of this License is held to be unen-\nforceable, such provision shall be reformed so as to achieve as nearly as\npossible the same economic effect as the original provision and the remainder\nof this License will remain in effect. This License shall be governed by and\nconstrued in accordance with the laws of the United States and the State of\nCalifornia as applied to agreements entered into and to be performed entirely\nwithin California between California residents. Any litigation relating to\nthis License shall be subject to the exclusive jurisdiction of the Federal\nCourts of the Northern District of California (or, absent subject matter\njurisdiction in such courts, the courts of the State of California), with\nvenue lying exclusively in Santa Clara County, California, with the losing\nparty responsible for costs, including without limitation, court costs and\nreasonable attorneys fees and expenses. The application of the United Nations\nConvention on Contracts for the International Sale of Goods is expressly\nexcluded. Any law or regulation which provides that the language of a con-\ntract shall be construed against the drafter shall not apply to this License.\n\nExhibit A\n\nThe contents of this file are subject to Sections 2, 3, 4, 7, 8, 10, 12 and\n13 of the GLX Public License Version 1.0 (the \"License\"). You may not use\nthis file except in compliance with those sections of the License. You may\nobtain a copy of the License at Silicon Graphics, Inc., attn: Legal Services,\n2011 N. Shoreline Blvd., Mountain View, CA 94043 or at\nhttp://www.sgi.com/software/opensource/glx/license.html.\n\nSoftware distributed under the License is distributed on an \"AS IS\" basis.\nALL WARRANTIES ARE DISCLAIMED, INCLUDING, WITHOUT LIMITATION, ANY IMPLIED\nWARRANTIES OF MERCHANTABILITY, OF FITNESS FOR A PARTICULAR PURPOSE OR OF NON-\nINFRINGEMENT. See the License for the specific language governing rights and\nlimitations under the License.\n\nThe Original Software is GLX version 1.2 source code, released February,\n1999. The developer of the Original Software is Silicon Graphics, Inc.  Those\nportions of the Subject Software created by Silicon Graphics, Inc.  are Copy-\nright (c) 1991-9 Silicon Graphics, Inc. All Rights Reserved."
}