{
  "key": "sgi-cid-1.0",
  "short_name": "SGI CID Font Code Public License 1.0",
  "name": "SGI CID Font Code Public License v1.0",
  "category": "Permissive",
  "owner": "SGI - Silicon Graphics",
  "homepage_url": "http://www.xfree86.org/current/LICENSE10.html",
  "spdx_license_key": "LicenseRef-scancode-sgi-cid-1.0",
  "text_urls": [
    "http://www.xfree86.org/current/LICENSE10.html"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 1994-1999 Silicon Graphics, Inc."
  ],
  "ignorable_holders": [
    "Silicon Graphics, Inc."
  ],
  "ignorable_authors": [
    "Silicon Graphics, Inc."
  ],
  "ignorable_urls": [
    "http://www.sgi.com/software/opensource/cid/license.html"
  ],
  "text": "CID FONT CODE PUBLIC LICENSE Version 1.0 3/31/99\n\nSubject to any applicable third party claims, Silicon Graphics, Inc. (\"SGI\")\nhereby grants permission to Recipient (defined below), under SGI's copyrights\nin the Original Software (defined below), to use, copy, modify, merge, pub-\nlish, distribute, sublicense and/or sell copies of Subject Software (defined\nbelow) in both source code and executable form, and to permit persons to whom\nthe Subject Software is furnished in accordance with this License to do the\nsame, subject to all of the following terms and conditions, which Recipient\naccepts by engaging in any such use, copying, modifying, merging, publica-\ntion, distributing, sublicensing or selling:\n\n1. Definitions.\n\n     a. \"Original Software\" means source code of computer software code\n     that is described in Exhibit A as Original Software.\n\n     b. \"Modifications\" means any addition to or deletion from the sub-\n     stance or structure of either the Original Software or any previous\n     Modifications. When Subject Software is released as a series of\n     files, a Modification means (i) any addition to or deletion from\n     the contents of a file containing Original Software or previous\n     Modifications and (ii) any new file that contains any part of the\n     Original Code or previous Modifications.\n\n     c. \"Subject Software\" means the Original Software or Modifications\n     or the combination of the Original Software and Modifications, or\n     portions of any of the foregoing.\n\n     d. \"Recipient\" means an individual or a legal entity exercising\n     rights under the terms of this License. For legal entities, \"Recip-\n     ient\" includes any entity that controls, is controlled by, or is\n     under common control with Recipient. For purposes of this defini-\n     tion, \"control\" of an entity means (i) the power, direct or indi-\n     rect, to direct or manage such entity, or (ii) ownership of fifty\n     percent (50%) or more of the outstanding shares or beneficial own-\n     ership of such entity.\n\n     e. \"Required Notice\" means the notice set forth in Exhibit A to\n     this License.\n\n     f. \"Accompanying Technology\" means any software or other technology\n     that is not a Modification and that is distributed or made publicly\n     available by Recipient with the Subject Software.  Separate soft-\n     ware files that do not contain any Original Software or any previ-\n     ous Modification shall not be deemed a Modification, even if such\n     software files are aggregated as part of a product, or in any\n     medium of storage, with any file that does contain Original Soft-\n     ware or any previous Modification.\n\n2. License Terms. All distribution of the Subject Software must be made sub-\nject to the terms of this License. A copy of this License and the Required\nNotice must be included in any documentation for Subject Software where\nRecipient's rights relating to Subject Software and/or any Accompanying Tech-\nnology are described. Distributions of Subject Software in source code form\nmust also include the Required Notice in every file distributed. In addition,\na ReadMe file entitled \"Important Legal Notice\" must be distributed with each\ndistribution of one or more files that incorporate Subject Software. That\nfile must be included with distributions made in both source code and exe-\ncutable form. A copy of the License and the Required Notice must be included\nin that file.  Recipient may distribute Accompanying Technology under a\nlicense of Recipient's choice, which may contain terms different from this\nLicense, provided that (i) Recipient is in compliance with the terms of this\nLicense, (ii) such other license terms do not modify or supersede the terms\nof this License as applicable to the Subject Software, (iii) Recipient hereby\nindemnifies SGI for any liability incurred by SGI as a result of the distri-\nbution of Accompanying Technology or the use of other license terms.\n\n3. Termination. This License and the rights granted hereunder will terminate\nautomatically if Recipient fails to comply with terms herein and fails to\ncure such breach within 30 days of the breach. Any sublicense to the Subject\nSoftware that is properly granted shall survive any termination of this\nLicense absent termination by the terms of such sublicense. Provisions which,\nby their nature, must remain in effect beyond the termination of this License\nshall survive.\n\n4. Trademark Rights. This License does not grant any rights to use any trade\nname, trademark or service mark whatsoever. No trade name, trademark or ser-\nvice mark of SGI may be used to endorse or promote products derived from or\nincorporating any Subject Software without prior written permission of SGI.\n\n5. No Other Rights. No rights or licenses not expressly granted hereunder\nshall arise by implication, estoppel or otherwise. Title to and ownership of\nthe Original Software at all times remains with SGI. All rights in the Origi-\nnal Software not expressly granted under this License are reserved.\n\n6. Compliance with Laws; Non-Infringement. Recipient shall comply with all\napplicable laws and regulations in connection with use and distribution of\nthe Subject Software, including but not limited to, all export and import\ncontrol laws and regulations of the U.S. government and other countries.\nRecipient may not distribute Subject Software that (i) in any way infringes\n(directly or contributorily) the rights (including patent, copyright, trade\nsecret, trademark or other intellectual property rights of any kind) of any\nother person or entity, or (ii) breaches any representation or warranty,\nexpress, implied or statutory, which under any applicable law it might be\ndeemed to have been distributed.\n\n7. Claims of Infringement. If Recipient at any time has knowledge of any one\nor more third party claims that reproduction, modification, use, distribu-\ntion, import or sale of Subject Software (including particular functionality\nor code incorporated in Subject Software) infringes the third party's intel-\nlectual property rights, Recipient must place in a well-identified web page\nbearing the title \"LEGAL\" a description of each such claim and a description\nof the party making each such claim in sufficient detail that a user of the\nSubject Software will know whom to contact regarding the claim. Also, upon\ngaining such knowledge of any such claim, Recipient must conspicuously\ninclude the URL for such web page in the Required Notice, and in the text of\nany related documentation, license agreement or collateral in which Recipient\ndescribes end user's rights relating to the Subject Software. If Recipient\nobtains such knowledge after it makes Subject Software available to any other\nperson or entity, Recipient shall take other steps (such as notifying appro-\npriate mailing lists or newsgroups) reasonably calculated to provide such\nknowledge to those who received the Subject Software.\n\n8. DISCLAIMER OF WARRANTY. SUBJECT SOFTWARE IS PROVIDED ON AN \"AS IS\" BASIS,\nWITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT\nLIMITATION, WARRANTIES THAT THE SUBJECT SOFTWARE IS FREE OF DEFECTS, MER-\nCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. SGI ASSUMES NO\nRISK AS TO THE QUALITY AND PERFORMANCE OF THE SOFTWARE. SHOULD ANY SOFTWARE\nPROVE DEFECTIVE IN ANY RESPECT, SGI ASSUMES NO COST OR LIABILITY FOR ANY SER-\nVICING, REPAIR OR CORRECTION.  THIS DISCLAIMER OF WARRANTY CONSTITUTES AN\nESSENTIAL PART OF THIS LICENSE. NO USE OF ANY SUBJECT SOFTWARE IS AUTHORIZED\nHEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n9. LIMITATION OF LIABILITY. UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY,\nWHETHER TORT (INCLUDING, WITHOUT LIMITATION, NEGLIGENCE OR STRICT LIABILITY),\nCONTRACT, OR OTHERWISE, SHALL SGI OR ANY SGI LICENSOR BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SUBJECT SOFTWARE OR\nTHE USE OR OTHER DEALINGS IN THE SUBJECT SOFTWARE. SOME JURISDICTIONS DO NOT\nALLOW THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO THIS EXCLUSION AND\nLIMITATION MAY NOT APPLY TO RECIPIENT TO THE EXTENT SO DISALLOWED.\n\n10. Indemnity. Recipient shall be solely responsible for damages arising,\ndirectly or indirectly, out of its utilization of rights under this License.\nRecipient will defend, indemnify and hold SGI and its successors and assigns\nharmless from and against any loss, liability, damages, costs or expenses\n(including the payment of reasonable attorneys fees) arising out of (Recipi-\nent's use, modification, reproduction and distribution of the Subject Soft-\nware or out of any representation or warranty made by Recipient.\n\n11. U.S. Government End Users. The Subject Software is a \"commercial item\"\nconsisting of \"commercial computer software\" as such terms are defined in\ntitle 48 of the Code of Federal Regulations and all U.S. Government End Users\nacquire only the rights set forth in this License and are subject to the\nterms of this License.\n\n12. Miscellaneous. This License represents the complete agreement concerning\nsubject matter hereof. If any provision of this License is held to be unen-\nforceable by any judicial or administrative authority having proper jurisdic-\ntion with respect thereto, such provision shall be reformed so as to achieve\nas nearly as possible the same economic effect as the original provision and\nthe remainder of this License will remain in effect. This License shall be\ngoverned by and construed in accordance with the laws of the United States\nand the State of California as applied to agreements entered into and to be\nperformed entirely within California between California residents. Any liti-\ngation relating to this License shall be subject to the exclusive jurisdic-\ntion of the Federal Courts of the Northern District of California (or, absent\nsubject matter jurisdiction in such courts, the courts of the State of Cali-\nfornia), with venue lying exclusively in Santa Clara County, California, with\nthe losing party responsible for costs, including without limitation, court\ncosts and reasonable attorneys fees and expenses. The application of the\nUnited Nations Convention on Contracts for the International Sale of Goods is\nexpressly excluded. Any law or regulation that provides that the language of\na contract shall be construed against the drafter shall not apply to this\nLicense.\n\nExhibit A\n\nCopyright (c) 1994-1999 Silicon Graphics, Inc.\n\nThe contents of this file are subject to the CID Font Code Public License\nVersion 1.0 (the \"License\"). You may not use this file except in compliance\nwith the License. You may obtain a copy of the License at Silicon Graphics,\nInc., attn: Legal Services, 2011 N. Shoreline Blvd., Mountain View, CA 94043\nor at http://www.sgi.com/software/opensource/cid/license.html\n\nSoftware distributed under the License is distributed on an \"AS IS\" basis.\nALL WARRANTIES ARE DISCLAIMED, INCLUDING, WITHOUT LIMITATION, ANY IMPLIED\nWARRANTIES OF MERCHANTABILITY, OF FITNESS FOR A PARTICULAR PURPOSE OR OF NON-\nINFRINGEMENT. See the License for the specific language governing rights and\nlimitations under the License.\n\nThe Original Software (as defined in the License) is CID font code that was\ndeveloped by Silicon Graphics, Inc. Those portions of the Subject Software\n(as defined in the License) that were created by Silicon Graphics, Inc. are\nCopyright (c) 1994-1999 Silicon Graphics, Inc. All Rights Reserved."
}