{
  "key": "shavlik-eula",
  "short_name": "Shavlik Technologies EULA",
  "name": "Shavlik Technologies EULA",
  "category": "Commercial",
  "owner": "Shavlik Technologies",
  "homepage_url": "http://www.shavlik.com/",
  "spdx_license_key": "LicenseRef-scancode-shavlik-eula",
  "ignorable_emails": [
    "info@shavlik.com"
  ],
  "text": "Shavlik Technologies, LLC\nEND USER LICENSE AGREEMENT\nCAREFULLY READ THE FOLLOWING TERMS AND CONDITIONS BEFORE LOADING THE SOFTWARE. THIS \nAGREEMENT GOVERNS THE USE OF THE PRODUCT (AS DEFINED BELOW). BY CLICKING \"I ACCEPT\" \nBELOW, OR BY INSTALLING, COPYING, OR OTHERWISE USING THE PRODUCT, YOU ARE SIGNING THIS \nAGREEMENT, THEREBY BECOMING BOUND BY ITS TERMS. BY INDICATING YOUR AGREEMENT, YOU ALSO \nREPRESENT AND WARRANT THAT YOU ARE A DULY AUTHORIZED REPRESENTATIVE OF THE ENTITY THAT \nHAS PURCHASED THE SOFTWARE AND THAT YOU HAVE THE RIGHT AND AUTHORITY TO ENTER INTO \nTHIS AGREEMENT ON THE ENTITY’S BEHALF. IF YOU DO NOT AGREE WITH THIS AGREEMENT, THEN \nCLICK \"I DO NOT ACCEPT\" BELOW OR DO NOT INSTALL, COPY OR USE THE PRODUCT.\n\n1. License.\nSubject to the terms and conditions of this Agreement, Shavlik Technologies, LLC (\"Shavlik\") grants to \nthe individual or entity installing this product (\"Licensee\"), a non-exclusive, non-transferable license to \nuse the software, together with any updates and data components provided to Licensee under a current \nSoftware Support Services Agreement, and any accompanying documentation provided by Shavlik \n(collectively, the \"Product\"), solely for Licensee’s internal business purposes and only in as many copies \nand/or for the number of virtual or physical workstations, PCs, servers, and/or other devices scanned, \nremediated, or reported on using the Software (\"Seats\") as authorized by Shavlik as part of Licensee’s \npurchase. The Product may require a maintainable data component. Licensee shall have access to the \nmaintainable data component so long as Licensee purchases and maintains a current Software Support \nServices Agreement.\n\n2. Limitations on Use.\nLicensee shall not, nor cause or permit any other person to: (i) reverse engineer, translate, disassemble, \ndecompile, sell, rent, lease, manufacture, adapt, create derivative works from, or otherwise modify or \ndistribute the Product or any part thereof; (ii) copy, in whole or in part, the Product with the exception \nof one copy of the Product for backup or archival purposes; (iii) use the Product to provide consulting \nor other services to third parties; or (iv) delete any copyright, trademark, patent or other notices of \nproprietary rights of Shavlik as they appear anywhere in or on the Product.\n\n3. Proprietary Rights.\nAll intellectual property rights including trademarks, service marks, patents, copyrights, trade secrets, \nand other proprietary rights in or related to the Product is and will remain the property of Shavlik or its \nlicensors, whether or not specifically recognized or protected under local law. Product may include third \nparty products. Please read our accompanying documentation for further information.4. No Warranty.\nShavlik does not warrant that the functions contained in the Product will meet Licensee’s requirements \nor that operation of the program will be uninterrupted or error-free. The entire risk as to the results \nand performance of the Product is assumed by Licensee. THE PRODUCT IS FURNISHED \"AS IS\" \nWITHOUT ANY WARRANTY OF ANY KIND, AND SHAVLIK AND ITS LICENSORS HEREBY DISCLAIM \nALL WARRANTIES, EXPRESS, IMPLIED OR STATUTORY IN RESPECT OF THE PRODUCT INCLUDING, \nWITHOUT LIMITATION, ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A \nPARTICULAR PURPOSE, AND ANY WARRANTIES AS TO NON-INFRINGEMENT. SOME STATES AND \nCOUNTRIES DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SOME OF THE ABOVE \nEXCLUSION MAY NOT APPLY TO LICENSEE. THIS WARRANTY GIVES LICENSEE SPECIFIC LEGAL \nRIGHTS. LICENSEE MAY HAVE OTHER RIGHTS WHICH VARY BY STATE OR COUNTRY.\n\n5. LIMITATION OF LIABILITY.\nIN NO EVENT SHALL SHAVLIK OR ITS LICENSORS BE LIABLE FOR ANY LOST REVENUE, PROFIT, \nOR DATA, OR FOR SPECIAL, INDIRECT, CONSEQUENTIAL, INCIDENTAL, EXEMPLARY OR OTHER \nDAMAGES HOWEVER CAUSED AND REGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF \nTHE USE OF OR INABILITY TO USE THE PRODUCT EVEN IF SHAVLIK HAS BEEN ADVISED OF THE \nPOSSIBILITY OF SUCH LOSS OR DAMAGES. IN NO EVENT SHALL SHAVLIK’S TOTAL LIABILITY TO \nLICENSEE, WHETHER IN CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE, EXCEED \nTHE AMOUNT OF ANY LICENSE FEE PAID BY LICENSEE TO SHAVLIK FOR THE PRODUCT.\n\n6. Term and Termination.\nThis Agreement is effective upon installation of the Product and will remain in effect until terminated. \nShavlik may terminate this Agreement immediately if Licensee fails to comply with any provision of this \nAgreement. Upon termination, Licensee agrees to destroy the original and all copies of the Product in \nits possession or control, and erase all copies residing on any computer equipment. Sections 3, 4, 5, 6, 7, \nand 9 shall survive termination of this Agreement.\n\n7. Export Control and Government Use.\nLicensee agrees to comply with all applicable United States export control laws and regulations, as \namended from time to time, including without limitation, the laws and regulations administered by the \nUnited States Department of Commerce and the United States Department of State. Licensee shall \nnot export, import or transfer the Product contrary to U.S. or other applicable laws, whether directly or \nindirectly, and will not cause, approve or otherwise facilitate others such as agents or any third parties \nin doing so. Any Product acquired by or on behalf of a unit or agency of the United States Government \nis \"commercial computer software\" or \"commercial computer software documentation\" and, absent a \nwritten agreement to the contrary, the Government’s rights with respect to such software or \ndocumentation are limited by the terms of this Agreement, pursuant to FAR § 12.212(a) and its successor \nregulations and/or DFARS § 227.7202-1(a) and its successor regulations, as applicable.\n\n8. Open Source Software.\nThe Product includes or may include some software programs that are licensed (or sublicensed) to the \nuser under the GNU General Public License (GPL) or other similar software licenses (\"Free Software \nLicenses\") which, among other rights, permit the user to copy, modify and redistribute certain programs, \nor portions thereof, and have access to the source code. The GPL requires that for any software covered \nunder the GPL, which is distributed to someone in an executable binary format that the source code also \nbe made available to those users. For any such software, the source code shall be made available to you \nupon request.\n\n9. General.\nThis Agreement and any dispute arising from or relating to it shall be governed by and construed \nand enforced in accordance with Minnesota law, without reference to conflicts of laws principles, and \nexcluding the UN Convention on Contracts for the International Sale of Goods. Any legal action or \nproceeding shall be instituted in a state or federal court in Hennepin County, Minnesota, USA. Any \nwaiver of or modification to the terms of this Agreement will not be effective unless executed in writing \nand signed by Shavlik. If any provision of this Agreement is held to be unenforceable, in whole or in \npart, such holding shall not affect the validity of the other provisions of this Agreement. Licensee may \nnot assign this Agreement or any associated transactions without the written consent of Shavlik. This \nAgreement constitutes the complete agreement between the parties and supersedes all prior or \ncontemporaneous agreements or representations, written or oral, concerning the subject matter of this \nAgreement including any purchase order or ordering document.\n\nShould you have any questions concerning the Product or this License, contact Shavlik Technologies, \nLLC, 2665 Long Lake Road, Suite 400, Roseville, Minnesota 55113 Telephone: +1 (800) 690 6911 or +1 (651) \n426-6624; fax: (651) 426-3345; e-mail: info@shavlik.com\nSHAVLIK EULA #H4Q2 VERSION 2.3"
}