{
  "key": "shital-shah",
  "short_name": "Shital Shah License",
  "name": "Shital Shah License",
  "category": "Permissive",
  "owner": "Shital Shah",
  "homepage_url": "http://shitalshah.com/disclaimer/",
  "spdx_license_key": "LicenseRef-scancode-shital-shah",
  "text_urls": [
    "http://shitalshah.com/disclaimer/"
  ],
  "text": "You may freely copy, store, distribute and use any material published on this\nsite free of charge and without my explicit permission, provided anyone else\ndoesn't owns copyright for it or no notice has been put explicitly stating\notherwise. All programs available on this website, unless stated otherwise, can\nbe freely copied, stored or redistributed with or without your own custom\nalterations. You are not required to take my explicit permission or retain\noriginal copyright notice. If you are redistributing any other material except\nprograms available on this website, you may not alter or distort the content\nand you must acknowledge the original copyright notice in your redistribution.\n\nTerms of Use\nYou use any information, facts, opinions, views, material or programs available\non this website at completely your risks. There are no explicit or implicit \nwarrenties of any kind for any information, facts, opinions, views, material or \nprograms that are expressed or available on or through this website. You \ncompletely assume any and all risks and associated liabilities that might result \nby usage of any information, facts, opinions, views, material or programs \navailable on this website.\n\nDisclaimer\nThe views expressed on this website are solely mine and does not represent that \nof my employer or my clients.This is my official personaebsite. Most content and \nprograms available on this website are original and authored by myself, unless \notherwise noted. If you feel credit due to someone is not given or if any \ncopyright laws are violated or object to certain content on this website, please\nfeel free to write to me and let me know."
}