{
  "key": "simpl-2.0",
  "short_name": "SimPL 2.0",
  "name": "Simple Public License Version 2.0",
  "category": "Copyleft",
  "owner": "OSI - Open Source Initiative",
  "homepage_url": "http://www.opensource.org/licenses/simpl-2.0.html",
  "notes": "Per SPDX.org, this license is OSI certified",
  "spdx_license_key": "SimPL-2.0",
  "text_urls": [
    "Simple Public License"
  ],
  "osi_url": "http://www.opensource.org/licenses/simpl-2.0.html",
  "other_urls": [
    "http://www.opensource.org/licenses/SimPL-2.0",
    "https://opensource.org/licenses/SimPL-2.0"
  ],
  "text": "Preamble\nThis Simple Public License 2.0 (SimPL 2.0 for short) is a plain language implementation of GPL 2.0.  The words are different, but the goal is the same - to guarantee for all users the freedom to share and change software.  If anyone wonders about the meaning of the SimPL, they should interpret it as consistent with GPL 2.0.\n\nSimple Public License (SimPL) 2.0\nThe SimPL applies to the software's source and object code and comes with any rights that I have in it (other than trademarks). You agree to the SimPL by copying, distributing, or making a derivative work of the software.\n\nYou get the royalty free right to:\nUse the software for any purpose;\nMake derivative works of it (this is called a \"Derived Work\");\nCopy and distribute it and any Derived Work.\n\nIf you distribute the software or a Derived Work, you must give back to the community by:\nProminently noting the date of any changes you make;\nLeaving other people's copyright notices, warranty disclaimers, and license terms  in place;\nProviding the source code, build scripts, installation scripts, and interface definitions in a form that is easy to get and best to modify;\nLicensing it to everyone under SimPL, or substantially similar terms (such as GPL 2.0), without adding further restrictions to the rights provided;\nConspicuously announcing that it is available under that license.\n\nThere are some things that you must shoulder:\nYou get NO WARRANTIES. None of any kind;\nIf the software damages you in any way, you may only recover direct damages up to the amount you paid for it (that is zero if you did not pay anything). You may not recover any other damages, including those called \"consequential damages.\" (The state or country where you live may not allow you to limit your liability in this way, so this may not apply to you);\n\nThe SimPL continues perpetually, except that your license rights end automatically if:\nYou do not abide by the \"give back to the community\" terms (your licensees get to keep their rights if they abide);\nAnyone prevents you from distributing the software under the terms of the SimPL.\n\nLicense for the License\nYou may do anything that you want with the SimPL text; it's a license form to use in any way that you find helpful.  To avoid confusion, however, if you change the terms in any way then you may not call your license the Simple Public License or the SimPL (but feel free to acknowledge that your license is \"based on the Simple Public License\")."
}