{
  "key": "simpl-1.1",
  "short_name": "SimPL 1.1",
  "name": "Simple Public License Version 1.1",
  "category": "Permissive",
  "owner": "Analysis and Solutions Company",
  "homepage_url": "http://www.analysisandsolutions.com/software/license.htm",
  "spdx_license_key": "LicenseRef-scancode-simpl-1.1",
  "minimum_coverage": 80,
  "ignorable_copyrights": [
    "Copyright (c) The Analysis and Solutions Company http://www.analysisandsolutions.com"
  ],
  "ignorable_holders": [
    "The Analysis and Solutions Company"
  ],
  "ignorable_urls": [
    "http://www.analysisandsolutions.com/"
  ],
  "text": "SIMPLE PUBLIC LICENSE                        VERSION 1.1   2003-01-21\n\nCopyright (c) The Analysis and Solutions Company\nhttp://www.analysisandsolutions.com/\n\n1.  Permission to use, copy, modify, and distribute this software and\nits documentation, with or without modification, for any purpose and\nwithout fee or royalty is hereby granted, provided that you include\nthe following on ALL copies of the software and documentation or\nportions thereof, including modifications, that you make:\n\n    a.  The full text of this license in a location viewable to users\n    of the redistributed or derivative work.\n\n    b.  Notice of any changes or modifications to the files,\n    including the date changes were made.\n\n2.  The name, servicemarks and trademarks of the copyright holders\nmay NOT be used in advertising or publicity pertaining to the\nsoftware without specific, written prior permission.\n\n3.  Title to copyright in this software and any associated\ndocumentation will at all times remain with copyright holders.\n\n4.  THIS SOFTWARE AND DOCUMENTATION IS PROVIDED \"AS IS,\" AND\nCOPYRIGHT HOLDERS MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY\nOR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE\nOR DOCUMENTATION WILL NOT INFRINGE ANY THIRD PARTY PATENTS,\nCOPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\n5.  COPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DAMAGES, INCLUDING\nBUT NOT LIMITED TO, DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL,\nARISING OUT OF ANY USE OF THE SOFTWARE OR DOCUMENTATION."
}