{
  "key": "slint-commercial-2.0",
  "short_name": "Slint Commercial License 2.0",
  "name": "Slint Software License Agreement Version 2.0",
  "category": "Commercial",
  "owner": "Slint",
  "homepage_url": "https://raw.githubusercontent.com/slint-ui/slint/master/LICENSES/LicenseRef-Slint-commercial.md",
  "spdx_license_key": "LicenseRef-scancode-slint-commercial-2.0",
  "other_urls": [
    "https://slint.dev/blog/sixtyfps-becomes-slint"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2023 SixtyFPS GmbH https://slint.dev/imprint.html"
  ],
  "ignorable_holders": [
    "SixtyFPS GmbH"
  ],
  "ignorable_urls": [
    "https://slint.dev/imprint.html"
  ],
  "text": "# Slint Software License Agreement\n\nVersion 2.0\n\nCopyright © 2023 SixtyFPS GmbH <https://slint.dev/imprint.html>\n\nSixtyFPS GmbH with offices at Oranienburger Str. 44, 16540 Hohen Neuendorf,\nGermany (**SixtyFPS**, **us**, **we** or **our**) grants a license to the\nsoftware (**Licensed Software**), as specified herein, subject to the Terms and\nConditions of this Slint Software License Agreement (**Agreement**).\n\nBy using the Licensed Software, **you** agree to be bound by this Agreement.\n**If you do not agree, do not use the Licensed Software.** If you are accessing\nand using the Licensed Software on behalf of a company (such as your employer)\nor other legal entity, you represent and warrant that you have the authority to\nbind that company or other legal entity to this Agreement. In that case, **you**\nand **your** will refer to that company or other legal entity.\n\nEach Party to this Agreement may be referred to herein individually as a\n**Party** or collectively as the **Parties**.\n\n## Licensed Software\n\nThe Licensed Software includes\n\n1. Slint compiler tool to translate Slint Design Markup Language files to Rust\n    (last stable Rust version at the time of licensed Slint version) and C++\n    (second last C++ version at the time of licensed Slint version),\n\n2. Slint run-time library that can render interactive user-interfaces and\n    provides Rust and C++ APIs (as per above versioning) to control the\n    interfaces,\n\n3. API Documentation for Slint and reference documentation for Slint Design\n    Markup Language, and\n\n4. Source code of Slint.\n\n## Terms and Conditions\n\n1. The Licensed Software is protected by copyright laws and international\n    copyright treaties, as well as other intellectual property laws and\n    treaties. The Licensed Software is licensed, not sold.\n\n2. The Licensed Software may provide links to third Party libraries or code\n    (collectively **Third-Party Libraries**) to implement various functions.\n    Third-Party Libraries do not comprise part of the Licensed Software. In some\n    cases, access to Third-Party Libraries may be included along with the\n    Licensed Software delivery as a convenience for development and testing\n    only. You acknowledge:\n\n    1. that some Third-Party Libraries may require additional licensing of\n        copyright and/or patents from the owners of such, and\n\n    2. that distribution of any of the Licensed Software referencing any portion\n        of a Third-Party Library may require appropriate licensing from such\n        third parties. All such Third-Party Libraries, along with applicable\n        copyright notices and licenses, will be listed and made available to\n        you.\n\n3. As part of the license grant, a Slint Software License Certificate\n    (**License Certificate**) will be issued containing details of\n\n    1. the license grant,\n\n    2. the permitted scope of your use of the Licensed Software, and\n\n    3. your contact details.\n\n4. In case of any changes or deviations to the information noted in the License\n    Certificate, you are obliged to notify us in writing, not later than 7 days\n    after any such change or deviation has occurred.\n\n5. The Term of this Agreement shall begin on the date mentioned in the License\n    Certificate (**Effective Date**) and shall continue unless terminated\n    earlier as herein provided (**Term**).\n\n6. New releases of the Licensed Software (**Updates**) will be made available\n    to you for the period (**Maintenance Period**) specified in the License\n    Certificate. Such Updates may be bound by additional license terms. You\n    consent to any such additional license terms, without which you may not\n    install, copy, or otherwise use such Updates.\n\n7. The Licensed Software is to be used exclusively with your software\n    products (**Products**) specified in the License Certificate.\n\n8. We grant you a perpetual, non-exclusive, non-transferable right to use the\n    Licensed Software, including making modifications, for the sole purposes of\n    designing, developing, and testing your Products during the Term. The number\n    of **Users** using the Licensed Software to design, develop, and test your\n    Products is limited to the amount of **User Seats** specified in the License\n    Certificate. For clarity, each unique User is counted as one User Seat.\n\n9. We grant you a perpetual, non-exclusive, non-transferable right to reproduce\n    and distribute the object code form of the Licensed Software, including any\n    modifications made to the Licensed Software, during the Term. Such\n    distributions are permitted only with your Products and limited to the number\n    of **Distributions** specified in the License Certificate.\n\n10. The license grants are conditional on the full and timely payment of all\n    applicable **Fees**; if said Fees are not paid in full and by their due\n    date, the license shall not be granted and your Products shall be deemed as\n    made in breach of the Agreement ex tunc.\n\n11. The Fees and any other charges under this Agreement shall be paid by\n    you no later than thirty (30) days from the date of the applicable\n    invoice from us. A late payment charge of five percent per month over and\n    above the interest rate stipulated by applicable law shall be charged on any\n    unpaid balances that remain past due and which have not been disputed by you\n    in good faith.\n\n12. The Fees and any other charges payable under this Agreement are gross\n    amounts but exclusive of any value added tax, use tax, sales tax,\n    withholding tax and other taxes, duties or tariffs levied directly for the\n    sale, delivery, or use of the Licensed Software pursuant to any applicable\n    law.\n\n13. The Parties also agree to all the following conditions:\n\n    (a) You may not remove or alter any copyright, trademark, or other\n        proprietary rights notice contained in any portion of the Licensed\n        Software,\n\n    (b) Your Products may not compete with the Licensed Software,\n\n    (c) You will indemnify and hold us, our affiliated companies, and our\n        suppliers, harmless from and against any claims or liabilities\n        arising out of the use, reproduction, or distribution of your\n        Products, except as set out in clause 13.(d) immediately below,\n\n    (d) We shall indemnify and hold you harmless from and against any\n        claims from third parties alleging that the use of the Licensed Software\n        as set out in this Agreement infringes or will infringe such third\n        parties' intellectual property rights or other rights,\n\n    (e) A Party shall promptly notify the other Party if it receives a claim that\n        the other Party shall or may be obliged to indemnify. The Parties shall\n        promptly give each other information and other assistance needed for\n        handling the claim. The Indemnifying Party may, at its cost and in its\n        sole discretion, take control of the defense of such claim, including\n        the conduct of any litigation or arbitration and the negotiation of any\n        settlement, in which case the indemnifying Party shall not compromise or\n        settle or otherwise dispose of the claim, in whole or in part, where\n        such compromise or settlement or disposal would require any admission or\n        stipulation which would reasonably be expected to have an adverse effect\n        on the commercial reputation of the indemnified Party, without the prior\n        written consent of the indemnified Party. Where the indemnifying Party\n        has not taken control of the defense of the claim, the indemnified Party\n        shall not compromise or settle or fail adequately to defend or otherwise\n        dispose of a claim, in whole or in part, without the written consent of\n        the indemnifying Party, such consent not to be unreasonably withheld or\n        delayed.\n\n14. The Licensed Software is licensed to you \"as is\". To the maximum extent\n    permitted by applicable law, we on behalf of us and our suppliers,\n    disclaim all warranties and conditions, either express or implied,\n    including, but not limited to, any implied warranties of merchantability or\n    fitness for a particular purpose, title, and non-infringement with regard to\n    the Licensed Software. The warranty disclaimer in the foregoing\n    notwithstanding, you may have specific legal rights which may vary from\n    state/jurisdiction to state/jurisdiction; as far as legally permissible, you\n    waive any such legal rights vis-à-vis us.\n\n15. We shall not under any circumstances be liable to you based on failure of\n    the Licensed Software if the failure resulted from your changing of the\n    Licensed Software, from your accident, abuse or misapplication, nor shall\n    we except in case of gross negligence or willful misconduct be\n    liable for special damages, punitive or exemplary damages, damages for loss\n    of profits or interruption of business or for loss or corruption of data,\n    nor shall any award of damages exceed the total amount you paid to us in\n    connection with this Agreement.\n\n16. Each Party shall hold Confidential Information of the other Party, its\n    customers, and licensors in confidence, and without written permission from\n    will not disclose to any person or use for its own benefit, any such\n    information. **Confidential Information** includes without limitation the\n    terms of this Agreement, computer software programs developed or licensed by\n    the Parties, including all documentation and methods or concepts utilized\n    therein, all adaptations and modifications thereto and derivative works\n    thereof, and related materials and information. Confidential Information\n    also includes any other information identified by either Party, its\n    licensors, or customers as proprietary or confidential, or which would\n    reasonably be understood under the circumstances to be confidential. All\n    Confidential Information shall remain the sole property of each respective\n    Party. Information will not be considered as Confidential Information if\n\n    1. available to the public other than by a breach of this Agreement;\n\n    2. rightfully received from a third Party not in breach of any obligation of\n        confidentiality;\n\n    3. independently developed by a Party without access to Confidential\n        Information of the other Party;\n\n    4. known to the other Party at the time of disclosure;\n\n    5. produced in compliance with applicable law or a court order, provided the\n        other Party is given notice and opportunity to intervene; or\n\n    6. it does not constitute a trade secret and more than five (5) years have\n        elapsed from the date of disclosure. In addition to any other rights or\n        remedies available, each Party shall be entitled to enforcement of such\n        obligations by court injunction.\n\n17. During the Term, an independent, certified auditor on our behalf, may, upon\n    its reasonable request, with 30 (thirty) days written notice, and at its\n    sole expense, examine your books and records solely with respect to your use\n    of the Licensed Software. Any such audit shall be conducted during regular\n    business hours at your facilities and shall not unreasonably interfere with\n    your business activities. Our auditor shall not remove, copy, or\n    redistribute any electronic material during an audit. If an audit reveals that\n    you are using the Licensed Software in a way that is in material violation\n    of the terms of this Agreement, then you shall pay us reasonable costs of\n    conducting the audit. Our auditor shall only be allowed to report violations\n    of the terms of this Agreement, with a copy to you. You shall be provided\n    the right to provide comments to the report before it is finalized.\n\n18. If you materially breach this Agreement, we will provide a 60 (sixty) days\n    written notice to you during which any such breach(es) may be cured, failing\n    which we will terminate the agreement.\n\n19. You may terminate this Agreement at any time for any reason upon 30 (thirty)\n    days notice to us and upon payment of all applicable fees and contractual\n    penalties, if any, in connection with the use of the Licensed Software.\n\n20. Both Parties shall comply with all applicable laws and regulations relating\n    to the Licensed Software in the countries in which the Parties use or modify\n    the Licensed Software.\n\n21. All notices and communications between the Parties shall be in writing and\n    shall be deemed given when received. For avoidance of doubt, email is\n    considered a written form of communication.\n\n22. This Agreement shall be construed, interpreted, and governed by the laws of\n    the Federal Republic of Germany.\n\n23. No term or condition contained in your purchase order will apply unless\n    expressly accepted by us in writing.\n\n24. You may assign this Agreement, in whole or in part (whether by operation of\n    law or otherwise), with prior consent from us, which shall not be\n    unreasonably withheld or delayed. We may assign this Agreement or any of its\n    rights hereunder or delegate any of its obligations hereunder with prior\n    notice to you. Any attempt to assign this Agreement other than in accordance\n    with this provision shall be null and void.\n\n25. This Agreement constitutes the complete agreement between the Parties and\n    supersedes all prior or contemporaneous discussions, representations, and\n    proposals, written or oral, with respect to the subject matters discussed\n    herein. No modification of this Agreement will be effective unless contained\n    in a written document executed by an authorized representative of each\n    Party. If any provision of the Agreement is found void or unenforceable, the\n    remainder will remain valid and enforceable according to its terms. If any\n    remedy provided is determined to have failed for its essential purpose, all\n    limitations of liability and exclusions of damages set forth in this\n    Agreement shall remain in effect."
}