{
  "key": "sourcegraph-enterprise-2018",
  "short_name": "Sourcegraph Enterprise License 2018",
  "name": "Sourcegraph Enterprise License 2018",
  "category": "Commercial",
  "owner": "Sourcegraph",
  "homepage_url": "https://github.com/sourcegraph/sourcegraph/blob/main/LICENSE.enterprise",
  "spdx_license_key": "LicenseRef-scancode-sourcegraph-enterprise-2018",
  "other_urls": [
    "https://about.sourcegraph.com/terms"
  ],
  "ignorable_urls": [
    "https://about.sourcegraph.com/terms"
  ],
  "text": "The Sourcegraph Enterprise license (the “Enterprise License”)\n\nWith regard to the Sourcegraph Software:\n\nThis software and associated documentation files (the \"Software\") may only be\nused in production, if you (and any entity that you represent) have agreed to,\nand are in compliance with, the Sourcegraph Terms of Service, available\nat https://about.sourcegraph.com/terms (the “Enterprise Terms”), or other\nagreement governing the use of the Software, as agreed by you and Sourcegraph,\nand otherwise have a valid Sourcegraph Enterprise subscription for the\ncorrect number of user seats. Subject to the foregoing sentence, you are free to\nmodify this Software and publish patches to the Software. You agree that Sourcegraph\nand/or its licensors (as applicable) retain all right, title and interest in and\nto all such modifications and/or patches, and all such modifications and/or\npatches may only be used, copied, modified, displayed, distributed, or otherwise\nexploited with a valid Sourcegraph Enterprise subscription for the correct\nnumber of user seats. Notwithstanding the foregoing, you may copy and modify\nthe Software for development and testing purposes, without requiring a\nsubscription. You agree that Sourcegraph and/or its licensors (as applicable) retain\nall right, title and interest in and to all such modifications. You are not\ngranted any other rights beyond what is expressly stated herein. Subject to the\nforegoing, it is forbidden to copy, merge, publish, distribute, sublicense,\nand/or sell the Software.\n\nThe full text of this Enterprise License shall be included in all copies or\nsubstantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\nFor all third party components incorporated into the Sourcegraph Software, those\ncomponents are licensed under the original license provided by the owner of the\napplicable component."
}