{
  "key": "speechworks-1.1",
  "short_name": "SpeechWorks Public License 1.1",
  "name": "SpeechWorks Public License v1.1",
  "category": "Permissive",
  "owner": "Nuance Communications",
  "homepage_url": "http://www.speech.cs.cmu.edu/openvxi/OpenVXI_1_4/License.txt",
  "spdx_license_key": "LicenseRef-scancode-speechworks-1.1",
  "text_urls": [
    "http://www.speech.cs.cmu.edu/openvxi/OpenVXI_1_4/License.txt"
  ],
  "other_urls": [
    "http://en.wikipedia.org/wiki/Nuance_Communications",
    "http://www.nuance.com/"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2000-2001, SpeechWorks International, Inc."
  ],
  "ignorable_holders": [
    "SpeechWorks International, Inc."
  ],
  "text": "The SpeechWorks Public License - Software, Version 1.1\n\nCopyright (c) 2000-2001, SpeechWorks International, Inc. \n\nRedistribution and use in source and binary forms, with or without \nmodification, are permitted provided that the following conditions are met: \n\t* Redistributions of source code must retain the above copyright \n\tnotice, this list of conditions and the following disclaimer. \n\t* Redistributions in binary form must reproduce the above copyright \n\tnotice, this list of conditions and the following disclaimer in the \n\tdocumentation and/or other materials provided with the distribution. \n\t* Neither the name of Speech Works International, Inc. (\"SWI\") nor \n\tthe names of its contributors may be used to endorse or promote \n\tproducts derived from this software without specific prior written \n\tpermission. For written permission contact Director, Product \n\tManagement, SpeechWorks International, Inc., 695 Atlantic Ave., \n\tBoston, MA 02110.\n\t* Products derived from the software may not be called \"SpeechWorks\", \n\tnor may \"SpeechWorks\" appear in their name, without prior written \n\tpermission of SWI.\n\t\nAddional information regarding the use of this software may be noted in the\nREADME.html file contained in this package.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND \nCONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES OR \nCONDITIONS, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED \nWARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, \nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE \nDISCLAIMED. IN NO EVENT SHALL SWI OR ITS CONTRIBUTORS BE LIABLE \nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR \nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, \nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, \nOR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON \nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, \nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY \nOUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE \nPOSSIBILITY OF SUCH DAMAGE."
}