{
  "key": "st-mcd-2.0",
  "short_name": "STMicro Liberty License v2",
  "name": "STMicro Liberty License v2",
  "category": "Proprietary Free",
  "owner": "STMicroelectronics",
  "homepage_url": "https://www.st.com/software_license_agreement_liberty_v2",
  "notes": "We have mess in here\nhttps://www.st.com/software_license_agreement_liberty_v2 does redirect to different licenses over the years.\n\nNov 2011 ... Dec 2012\n https://web.archive.org/web/20121208120907/http://www.st.com/internet/com/LEGAL_RESOURCES/LEGAL_AGREEMENT/LICENSE_AGREEMENT/software_license_agreement_liberty_v2.pdf\n It carries this note at the bootom \"Software License Agreement (Liberty V2) Nov 16 th , 2011\"\n\n2013 ... Oct 2013\n It now redirects to  a new one, same content\n http://www.st.com/st-web-ui/static/active/en/resource/legal/legal_agreement/license_agreement/software_license_agreement_image_v2.pdf\n https://web.archive.org/web/20131018182423/http://www.st.com/st-web-ui/static/active/en/resource/legal/legal_agreement/license_agreement/software_license_agreement_image_v2.pdf\n\nSep 2014 ... Sep 2015\n Now at a new file name. But same content.\n http://www.st.com/st-web-ui/static/active/en/resource/legal/legal_agreement/license_agreement/software_license_agreement_liberty_v2.pdf?sc=software_license_agreement_liberty_v2\n https://web.archive.org/web/20140923015837/http://www.st.com/st-web-ui/static/active/en/resource/legal/legal_agreement/license_agreement/software_license_agreement_liberty_v2.pdf?sc=software_license_agreement_liberty_v2\n https://web.archive.org/web/20150908060438/http://www.st.com/st-web-ui/static/active/en/resource/legal/legal_agreement/license_agreement/software_license_agreement_liberty_v2.pdf?sc=software_license_agreement_liberty_v2\n\n2015 ...  Feb 2018\n This is no longer a PDF but a plain text file and a completly different agreement:\n http://www.st.com/content/ccc/resource/legal/legal_agreement/license_agreement/de/fc/f7/32/a0/8b/4f/db/ultimate-liberty-v2.txt/files/ultimate-liberty-v2.txt/jcr:content/translations/en.ultimate-liberty-v2.txt\n https://web.archive.org/web/20180207212429/http://www.st.com/content/ccc/resource/legal/legal_agreement/license_agreement/de/fc/f7/32/a0/8b/4f/db/ultimate-liberty-v2.txt/files/ultimate-liberty-v2.txt/jcr:content/translations/en.ultimate-liberty-v2.txt\n\nFeb 2018 ... May 2019\n https://www.st.com/content/ccc/resource/legal/legal_agreement/license_agreement/group0/59/57/63/12/cf/a6/47/65/SLA0044/files/SLA0044.txt/jcr:content/translations/en.SLA0044.txt\n This is the one I used for now as a text. It as has this header \"SLA0044 Rev5/February 2018\"\n",
  "spdx_license_key": "LicenseRef-scancode-st-mcd-2.0",
  "text_urls": [
    "https://www.st.com/content/ccc/resource/legal/legal_agreement/license_agreement/group0/59/57/63/12/cf/a6/47/65/SLA0044/files/SLA0044.txt/jcr:content/translations/en.SLA0044.txt",
    "https://www.st.com/software_license_agreement_liberty_v2"
  ],
  "other_urls": [
    "https://www.st.com/content/ccc/resource/legal/legal_agreement/license_agreement/group0/87/0c/3d/ad/0a/ba/44/26/DM00216740/files/DM00216740.pdf/jcr:content/translations/en.DM00216740.pdf"
  ],
  "ignorable_urls": [
    "http://www.opensource.org/"
  ],
  "text": "SLA0044 Rev5/February 2018\n\nBY INSTALLING COPYING, DOWNLOADING, ACCESSING OR OTHERWISE USING THIS SOFTWARE\nOR ANY PART THEREOF (AND THE RELATED DOCUMENTATION) FROM STMICROELECTRONICS\nINTERNATIONAL N.V, SWISS BRANCH AND/OR ITS AFFILIATED COMPANIES\n(STMICROELECTRONICS), THE RECIPIENT, ON BEHALF OF HIMSELF OR HERSELF, OR ON\nBEHALF OF ANY ENTITY BY WHICH SUCH RECIPIENT IS EMPLOYED AND/OR ENGAGED AGREES\nTO BE BOUND BY THIS SOFTWARE LICENSE AGREEMENT.\n\nUnder STMicroelectronics’ intellectual property rights, the redistribution,\nreproduction and use in source and binary forms of the software or any part\nthereof, with or without modification, are permitted provided that the following\nconditions are met:\n\n1.  Redistribution of source code (modified or not) must retain any copyright\nnotice, this list of conditions and the disclaimer set forth below as items 10\nand 11.\n\n2.  Redistributions in binary form, except as embedded into microcontroller or\nmicroprocessor device manufactured by or for STMicroelectronics or a software\nupdate for such device, must reproduce any copyright notice provided with the\nbinary code, this list of conditions, and the disclaimer set forth below as\nitems 10 and 11, in documentation and/or other materials provided with the\ndistribution.\n\n3.  Neither the name of STMicroelectronics nor the names of other contributors\nto this software may be used to endorse or promote products derived from this\nsoftware or part thereof without specific written permission.\n\n4.  This software or any part thereof, including modifications and/or derivative\nworks of this software, must be used and execute solely and exclusively on or in\ncombination with a microcontroller or microprocessor device manufactured by or\nfor STMicroelectronics.\n\n5.  No use, reproduction or redistribution of this software partially or totally\nmay be done in any manner that would subject this software to any Open Source\nTerms. “Open Source Terms” shall mean any open source license which requires as\npart of distribution of software that the source code of such software is\ndistributed therewith or otherwise made available, or open source license that\nsubstantially complies with the Open Source definition specified at\nwww.opensource.org and any other comparable open source license such as for\nexample GNU General Public License (GPL), Eclipse Public License (EPL), Apache\nSoftware License, BSD license or MIT license.\n\n6.  STMicroelectronics has no obligation to provide any maintenance, support or\nupdates for the software.\n\n7.  The software is and will remain the exclusive property of STMicroelectronics\nand its licensors. The recipient will not take any action that jeopardizes\nSTMicroelectronics and its licensors' proprietary rights or acquire any rights\nin the software, except the limited rights specified hereunder.\n\n8.  The recipient shall comply with all applicable laws and regulations\naffecting the use of the software or any part thereof including any applicable\nexport control law or regulation.\n\n9.  Redistribution and use of this software or any part thereof other than as\npermitted under this license is void and will automatically terminate your\nrights under this license.\n\n10. THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-\nINFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY RIGHTS, WHICH ARE DISCLAIMED\nTO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT SHALL STMICROELECTRONICS OR\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,\nOR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\nIN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY\nOF SUCH DAMAGE.\n\n11. EXCEPT AS EXPRESSLY PERMITTED HEREUNDER, NO LICENSE OR OTHER RIGHTS, WHETHER\nEXPRESS OR IMPLIED, ARE GRANTED UNDER ANY PATENT OR OTHER INTELLECTUAL PROPERTY\nRIGHTS OF STMICROELECTRONICS OR ANY THIRD PARTY."
}