{
  "key": "stanford-mrouted",
  "short_name": "Stanford mrouted License",
  "name": "Stanford mrouted License",
  "category": "Copyleft Limited",
  "owner": "Stanford University",
  "homepage_url": "http://www.mail-archive.com/debian-legal@lists.debian.org/msg04177.html",
  "spdx_license_key": "LicenseRef-scancode-stanford-mrouted",
  "faq_url": "http://www.mail-archive.com/debian-legal@lists.debian.org/msg04177.html",
  "ignorable_copyrights": [
    "COPYRIGHT 1989 by The Board of Trustees of Leland Stanford Junior University"
  ],
  "ignorable_holders": [
    "The Board of Trustees of Leland Stanford Junior University"
  ],
  "text": "The mrouted program is covered by the following license.  Use of the\nmrouted program represents acceptance of these terms and conditions.\n\n1. STANFORD grants to LICENSEE a nonexclusive and nontransferable license\nto use, copy and modify the computer software ``mrouted'' (hereinafter\ncalled the ``Program''), upon the terms and conditions hereinafter set\nout and until Licensee discontinues use of the Licensed Program.\n\n2. LICENSEE acknowledges that the Program is a research tool still in\nthe development state, that it is being supplied ``as is,'' without any\naccompanying services from STANFORD, and that this license is entered\ninto in order to encourage scientific collaboration aimed at further\ndevelopment and application of the Program.\n\n3. LICENSEE may copy the Program and may sublicense others to use object\ncode copies of the Program or any derivative version of the Program.\nAll copies must contain all copyright and other proprietary notices found\nin the Program as provided by STANFORD.  Title to copyright to the\nProgram remains with STANFORD.\n\n4. LICENSEE may create derivative versions of the Program.  LICENSEE\nhereby grants STANFORD a royalty-free license to use, copy, modify,\ndistribute and sublicense any such derivative works.  At the time\nLICENSEE provides a copy of a derivative version of the Program to a\nthird party, LICENSEE shall provide STANFORD with one copy of the source\ncode of the derivative version at no charge to STANFORD.\n\n5. STANFORD MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED.\nBy way of example, but not limitation, STANFORD MAKES NO REPRESENTATION\nOR WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR\nTHAT THE USE OF THE LICENSED PROGRAM WILL NOT INFRINGE ANY PATENTS,\nCOPYRIGHTS, TRADEMARKS OR OTHER RIGHTS. STANFORD shall not be held liable\nfor any liability nor for any direct, indirect or consequential damages\nwith respect to any claim by LICENSEE or any third party on account of or\narising from this Agreement or use of the Program.\n\n6. This agreement shall be construed, interpreted and applied in\naccordance with the State of California and any legal action arising\nout of this Agreement or use of the Program shall be filed in a court\nin the State of California.\n\n7. Nothing in this Agreement shall be construed as conferring rights to\nuse in advertising, publicity or otherwise any trademark or the name\nof ``Stanford''.\n\nThe mrouted program is COPYRIGHT 1989 by The Board of Trustees of\nLeland Stanford Junior University."
}