{
  "key": "statewizard",
  "short_name": "StateWizard License",
  "name": "StateWizard License Agreement",
  "category": "Copyleft Limited",
  "owner": "Unspecified",
  "homepage_url": "http://web.archive.org/web/20090319003049/http://www.intelliwizard.com/license.htm",
  "notes": "This license is a tad complex making references to LGPL, commercial and\nsomething that looks like a BSD license. Later version of the same home\npage has references to the GPL instead of the LGPL. The original site is no\nlonger onlilne.\n",
  "spdx_license_key": "LicenseRef-scancode-statewizard",
  "ignorable_authors": [
    "the IntelliWizard Project",
    "the Intelliwizard Project"
  ],
  "ignorable_urls": [
    "http://www.intelliwizard.com/"
  ],
  "ignorable_emails": [
    "info@intelliwizard.com"
  ],
  "text": "Redistribution and use of the StateWizard Engine in source and binary forms,\nwith or without modification, are permitted provided that the following\nconditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list\nof conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice, this\nlist of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n\nRedistributions of source code modifications must send back to the Intelliwizard\nProject and republish them.\n\nAll advertising materials mentioning features or use of this software must\ndisplay the following acknowledgment: \"This product includes software developed\nby the IntelliWizard Project for use in the StateWizard Engine.\n(http://www.intelliwizard.com/)\" The names \"StateWizard Engine\" and\n\"IntelliWizard Project\" must not be used to endorse or promote products derived\nfrom this software without prior written permission. For written permission,\nplease contact info@intelliwizard.com. Products derived from this software may\nnot be called \"StateWizard\" nor may \"StateWizard\" appear in their names without\nprior written permission of the StateWizard Project.\n\nRedistributions of any form whatsoever must retain the following acknowledgment:\n\"This product includes software developed by the Intelliwizard Project for use\nin the StateWizard Engine (http://www.intelliwizard.com/)\"\n\nTHIS SOFTWARE IS PROVIDED BY THE IntelliWizard PROJECT ``AS IS'' AND ANY\nEXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE IntelliWizard PROJECT OR ITS CONTRIBUTORS BE\nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\nTHE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}