{
  "key": "stlport-2000",
  "short_name": "STLport License 2000",
  "name": "STLport License 2000",
  "category": "Permissive",
  "owner": "STLport Consulting",
  "spdx_license_key": "LicenseRef-scancode-stlport-2000",
  "minimum_coverage": 90,
  "ignorable_copyrights": [
    "Copyright 1994 Hewlett-Packard Company",
    "Copyright 1996,97 Silicon Graphics Computer Systems, Inc.",
    "Copyright 1997 Moscow Center for SPARC Technology",
    "Copyright 1999,2000 Boris Fomitchev"
  ],
  "ignorable_holders": [
    "Boris Fomitchev",
    "Hewlett-Packard Company",
    "Moscow Center for SPARC Technology",
    "Silicon Graphics Computer Systems, Inc."
  ],
  "text": "STLport License Agreement\n\nBoris Fomitchev grants Licensee a non-exclusive, non-transferable, royalty- free\nlicense to use STLport and its documentation without fee.\n\nBy downloading, using, or copying STLport or any portion thereof, Licensee\nagrees to abide by the intellectual property laws and all other applicable laws\nof the United States of America, and to all of the terms and conditions of this\nAgreement.\n\nLicensee shall maintain the following copyright and permission notices on\nSTLport sources and its documentation unchanged :\n\nCopyright 1999,2000 Boris Fomitchev\n\nThis material is provided \"as is\", with absolutely no warranty expressed or\nimplied. Any use is at your own risk. Permission to use or copy this software\nfor any purpose is hereby granted without fee, provided the above notices are\nretained on all copies. Permission to modify the code and to distribute modified\ncode is granted, provided the above notices are retained, and a notice that the\ncode was modified is included with the above copyright notice.\n\nThe Licensee may distribute binaries compiled with STLport (whether original or modified) without any royalties or restrictions.\n\nThe Licensee may distribute original or modified STLport sources, provided that:\n\n• The conditions indicated in the above permission notice are met; \n\n• The following copyright notices are retained when present, and conditions\nprovided in accompanying permission notices are met :\n\nCopyright 1994 Hewlett-Packard Company \nCopyright 1996,97 Silicon Graphics Computer Systems, Inc. \nCopyright 1997 Moscow Center for SPARC Technology.\n\nPermission to use, copy, modify, distribute and sell this software and its\ndocumentation for any purpose is hereby granted without fee, provided that the\nabove copyright notice appear in all copies and that both that copyright notice\nand this permission notice appear in supporting documentation. Hewlett-Packard\nCompany makes no representations about the suitability of this software for any\npurpose. It is provided \"as is\" without express or implied warranty.\n\nPermission to use, copy, modify, distribute and sell this software and its\ndocumentation for any purpose is hereby granted without fee, provided that the\nabove copyright notice appear in all copies and that both that copyright notice\nand this permission notice appear in supporting documentation. Silicon Graphics\nmakes no representations about the suitability of this software for any purpose.\nIt is provided \"as is\" without express or implied warranty.\n\nPermission to use, copy, modify, distribute and sell this software and its\ndocumentation for any purpose is hereby granted without fee, provided that the\nabove copyright notice appear in all copies and that both that copyright notice\nand this permission notice appear in supporting documentation. Moscow Center for\nSPARC Technology makes no representations about the suitability of this software\nfor any purpose. It is provided \"as is\" without express or implied warranty."
}