{
  "key": "sun-bcl-11-07",
  "short_name": "Sun BCL 11 plus 7",
  "name": "Sun BCL 11 plus 7",
  "category": "Proprietary Free",
  "owner": "Oracle (Sun)",
  "spdx_license_key": "LicenseRef-scancode-sun-bcl-11-07",
  "ignorable_urls": [
    "http://www.sun.com/policies/trademarks"
  ],
  "text": "Sun Microsystems, Inc.\nBinary Code License Agreement\n\nREAD THE TERMS OF THIS AGREEMENT AND ANY PROVIDED\nSUPPLEMENTAL LICENSE TERMS (COLLECTIVELY\n\"AGREEMENT\") CAREFULLY BEFORE OPENING THE SOFTWARE\nMEDIA PACKAGE. BY OPENING THE SOFTWARE MEDIA\nPACKAGE, YOU AGREE TO THE TERMS OF THIS\nAGREEMENT. IF YOU ARE ACCESSING THE SOFTWARE\nELECTRONICALLY, INDICATE YOUR ACCEPTANCE OF THESE\nTERMS BY SELECTING THE \"ACCEPT\" BUTTON AT THE END\nOF THIS AGREEMENT. IF YOU DO NOT AGREE TO ALL\nTHESE TERMS, PROMPTLY RETURN THE UNUSED SOFTWARE\nTO YOUR PLACE OF PURCHASE FOR A REFUND OR, IF THE\nSOFTWARE IS ACCESSED ELECTRONICALLY, SELECT THE\n\"DECLINE\" BUTTON AT THE END OF THIS AGREEMENT.\n\n1. LICENSE TO USE. Sun grants you a\nnon-exclusive and non-transferable license for the\ninternal use only of the accompanying software and\ndocumentation and any error corrections provided\nby Sun (collectively \"Software\"), by the number of\nusers and the class of computer hardware for which\nthe corresponding fee has been paid.\n\n2. RESTRICTIONS. Software is confidential and\ncopyrighted. Title to Software and all associated\nintellectual property rights is retained by Sun\nand/or its licensors. Except as specifically\nauthorized in any Supplemental License Terms, you\nmay not make copies of Software, other than a\nsingle copy of Software for archival purposes.\nUnless enforcement is prohibited by applicable\nlaw, you may not modify, decompile, or reverse\nengineer Software. Licensee acknowledges that\nLicensed Software is not designed or intended for\nuse in the design, construction, operation or\nmaintenance of any nuclear facility. Sun\nMicrosystems, Inc. disclaims any express or\nimplied warranty of fitness for such uses. No\nright, title or interest in or to any trademark,\nservice mark, logo or trade name of Sun or its\nlicensors is granted under this Agreement.\n\n3. LIMITED WARRANTY. Sun warrants to you that for\na period of ninety (90) days from the date of\npurchase, as evidenced by a copy of the receipt,\nthe media on which Software is furnished (if any)\nwill be free of defects in materials and\nworkmanship under normal use. Except for the\nforegoing, Software is provided \"AS IS\". Your\nexclusive remedy and Sun's entire liability under\nthis limited warranty will be at Sun's option to\nreplace Software media or refund the fee paid for\nSoftware.\n\n4. DISCLAIMER OF WARRANTY. UNLESS SPECIFIED IN\nTHIS AGREEMENT, ALL EXPRESS OR IMPLIED CONDITIONS,\nREPRESENTATIONS AND WARRANTIES, INCLUDING ANY\nIMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE OR NON-INFRINGEMENT ARE\nDISCLAIMED, EXCEPT TO THE EXTENT THAT THESE\nDISCLAIMERS ARE HELD TO BE LEGALLY INVALID.\n\n5. LIMITATION OF LIABILITY. TO THE EXTENT NOT\nPROHIBITED BY LAW, IN NO EVENT WILL SUN OR ITS\nLICENSORS BE LIABLE FOR ANY LOST REVENUE, PROFIT\nOR DATA, OR FOR SPECIAL, INDIRECT, CONSEQUENTIAL,\nINCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED\nREGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT\nOF OR RELATED TO THE USE OF OR INABILITY TO USE\nSOFTWARE, EVEN IF SUN HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES. In no event will\nSun's liability to you, whether in contract, tort\n(including negligence), or otherwise, exceed the\namount paid by you for Software under this\nAgreement. The foregoing limitations will apply\neven if the above stated warranty fails of its\nessential purpose.\n\n6. Termination. This Agreement is effective\nuntil terminated. You may terminate this\nAgreement at any time by destroying all copies of\nSoftware. This Agreement will terminate\nimmediately without notice from Sun if you fail to\ncomply with any provision of this Agreement. Upon\nTermination, you must destroy all copies of\nSoftware.\n\n7. Export Regulations. All Software and technical\ndata delivered under this Agreement are subject to\nUS export control laws and may be subject to\nexport or import regulations in other countries.\nYou agree to comply strictly with all such laws\nand regulations and acknowledge that you have the\nresponsibility to obtain such licenses to export,\nre-export, or import as may be required after\ndelivery to you.\n\n8. U.S. Government Restricted Rights. If Software\nis being acquired by or on behalf of the U.S.\nGovernment or by a U.S. Government prime\ncontractor or subcontractor (at any tier), then\nthe Government's rights in Software and\naccompanying documentation will be only as set\nforth in this Agreement; this is in accordance\nwith 48 CFR 227.7201 through 227.7202-4 (for\nDepartment of Defense (DOD) acquisitions) and with\n48 CFR 2.101 and 12.212 (for non-DOD\nacquisitions).\n\n9. Governing Law. Any action related to this\nAgreement will be governed by California law and\ncontrolling U.S. federal law. No choice of law\nrules of any jurisdiction will apply.\n\n10. Severability. If any provision of this\nAgreement is held to be unenforceable, this\nAgreement will remain in effect with the provision\nomitted, unless omission would frustrate the\nintent of the parties, in which case this\nAgreement will immediately terminate.\n\n11. Integration. This Agreement is the entire\nagreement between you and Sun relating to its\nsubject matter. It supersedes all prior or\ncontemporaneous oral or written communications,\nproposals, representations and warranties and\nprevails over any conflicting or additional terms\nof any quote, order, acknowledgment, or other\ncommunication between the parties relating to its\nsubject matter during the term of this Agreement.\nNo modification of this Agreement will be binding,\nunless in writing and signed by an authorized\nrepresentative of each party.\n\n{ProductName}\n\nSUPPLEMENTAL LICENSE TERMS\n\nThese supplemental license terms (\"Supplemental\nTerms\") add to or modify the terms of the Binary\nCode License Agreement (collectively, the\n\"Agreement\"). Capitalized terms not defined in\nthese Supplemental Terms shall have the same\nmeanings ascribed to them in the Binary Code\nLicense Agreement. These Supplemental Terms shall\nsupersede any inconsistent or conflicting terms in\nthe Binary Code License Agreement, or in any\nlicense contained within the Software.\n\n1. Software Internal Use and Development License\nGrant. Subject to the terms and conditions of this\nAgreement, including, but not limited to Section 4\n(Java Technology Restrictions) of these\nSupplemental Terms, Sun grants you a\nnon-exclusive, non-transferable, limited license\nwithout fees to reproduce internally and use\ninternally the binary form of the Software\ncomplete and unmodified for the sole purpose of\ndesigning, developing, testing, and running your\nJava applets and applications intended to run on\nJava-enabled general purpose desktop computers and\nservers (\"Programs\").\n\n2. License to Distribute Software. Subject to the\nterms and conditions of this Agreement, including,\nbut not limited to Section 4 (Java Technology\nRestrictions) of these Supplemental Terms, Sun\ngrants you a non-exclusive, non-transferable,\nlimited license without fees to reproduce and\ndistribute the Software, provided that: (i) you\ndistribute the Software complete and unmodified\nand only bundled as part of, and for the sole\npurpose of running, your Programs, (ii) the\nPrograms add significant and primary functionality\nto the Software, (iii) you do not distribute\nadditional software intended to replace any\ncomponent(s) of the Software, (iv) you do not\nremove or alter any proprietary legends or notices\ncontained in the Software, (v) you only distribute\nthe Software subject to a license agreement that\nprotects Sun's interests consistent with the terms\ncontained in this Agreement, and (vi) you agree to\ndefend and indemnify Sun and its licensors from\nand against any damages, costs, liabilities,\nsettlement amounts and/or expenses (including\nattorneys' fees) incurred in connection with any\nclaim, lawsuit or action by any third party that\narises or results from the use or distribution of\nany and all Programs and/or Software.\n\n3. License to Distribute Redistributables. Subject\nto the terms and conditions of this Agreement,\nincluding but not limited to Section 4 (Java\nTechnology Restrictions) of these Supplemental\nTerms, Sun grants you a non-exclusive,\nnon-transferable, limited license without fees to\nreproduce and distribute those files specifically\nidentified as redistributable in the Software\n\"README\" file (\"Redistributables\") provided that:\n(i) you distribute the Redistributables complete\nand unmodified (unless otherwise specified in the\napplicable README file), and only bundled as part\nof Programs, (ii) you do not distribute additional\nsoftware intended to supersede any component(s) of\nthe Redistributables, (iii) you do not remove or\nalter any proprietary legends or notices contained\nin or on the Redistributables, (iv) you only\ndistribute the Redistributables pursuant to a\nlicense agreement that protects Sun's interests\nconsistent with the terms contained in the\nAgreement, and (v) you agree to defend and\nindemnify Sun and its licensors from and against\nany damages, costs, liabilities, settlement\namounts and/or expenses (including attorneys'\nfees) incurred in connection with any claim,\nlawsuit or action by any third party that arises\nor results from the use or distribution of any and\nall Programs and/or Software.\n\n4. Java Technology Restrictions. You may not\nmodify the Java Platform Interface (\"JPI\",\nidentified as classes contained within the \"java\"\npackage or any subpackages of the \"java\" package),\nby creating additional classes within the JPI or\notherwise causing the addition to or modification\nof the classes in the JPI. In the event that you\ncreate an additional class and associated API(s)\nwhich (i) extends the functionality of the Java\nplatform, and (ii) is exposed to third party\nsoftware developers for the purpose of developing\nadditional software which invokes such additional\nAPI, you must promptly publish broadly an accurate\nspecification for such API for free use by all\ndevelopers. You may not create, or authorize your\nlicensees to create, additional classes,\ninterfaces, or subpackages that are in any way\nidentified as \"java\", \"javax\", \"sun\" or similar\nconvention as specified by Sun in any naming\nconvention designation.\n\n5. Trademarks and Logos. You acknowledge and agree\nas between you and Sun that Sun owns the SUN,\nSOLARIS, JAVA, JINI, FORTE, and iPLANET trademarks\nand all SUN, SOLARIS, JAVA, JINI, FORTE, and\niPLANET-related trademarks, service marks, logos\nand other brand designations (\"Sun Marks\"), and\nyou agree to comply with the Sun Trademark and\nLogo Usage Requirements currently located at\nhttp://www.sun.com/policies/trademarks. Any use\nyou make of the Sun Marks inures to Sun's benefit.\n\n6. Source Code. Software may contain source code\nthat is provided solely for reference purposes\npursuant to the terms of this Agreement. Source\ncode may not be redistributed unless expressly\nprovided for in this Agreement.\n\n7. Termination for Infringement. Either party may\nterminate this Agreement immediately should any\nSoftware become, or in either party's opinion be\nlikely to become, the subject of a claim of\ninfringement of any intellectual property right.\n\nFor inquiries please contact: Sun Microsystems,\nInc., 4150 Network Circle, Santa Clara, California\n95054, U.S.A.\n(LFI#128935/Form ID#011801)"
}