{
  "key": "sun-cc-pp-1.0",
  "short_name": "Sun CC-PP Processing License 1.0",
  "name": "Sun CC-PP Processing License 1.0",
  "category": "Proprietary Free",
  "owner": "Oracle (Sun)",
  "homepage_url": "https://download.oracle.com/otndocs/jcp/CC_PP_PROCESSING-1.0-FR-SPEC-G-F/CC_PP_PROCESSING-1.0-FR-SPEC-G-F-license.html",
  "spdx_license_key": "LicenseRef-scancode-sun-cc-pp-1.0",
  "other_urls": [
    "https://download.oracle.com/otndocs/jcp/CC_PP_PROCESSING-1.0-FR-SPEC-G-F/"
  ],
  "ignorable_copyrights": [
    "Copyright 2003 Sun Microsystems, Inc. 4150 Network Circle, Santa Clara, California 95054, U.S.A"
  ],
  "ignorable_holders": [
    "Sun Microsystems, Inc. 4150 Network Circle, Santa Clara, California 95054, U.S.A"
  ],
  "text": "Composite Capability/Preference Profiles (CC/PP) Processing\nSpecification (\"Specification\") Version: 1.0 Status: FCS\nRelease: October 28, 2003\n\nCopyright 2003 Sun Microsystems, Inc. 4150 Network Circle,\nSanta Clara, California 95054, U.S.A All rights reserved.\n\nNOTICE; LIMITED LICENSE GRANTS Sun Microsystems, Inc.\n(\"Sun\") hereby grants you a fully-paid, non-exclusive,\nnon-transferable, worldwide, limited license (without the\nright to sublicense), under the Sun's applicable\nintellectual property rights to view, download, use and\nreproduce the Specification only for the purpose of\ninternal evaluation, which shall be understood to include\ndeveloping applications intended to run on an\nimplementation of the Specification provided that such\napplications do not themselves implement any portion(s) of\nthe Specification. Sun also grants you a perpetual,\nnon-exclusive, worldwide, fully paid-up, royalty free,\nlimited license (without the right to sublicense) under any\napplicable copyrights or patent rights it may have in the\nSpecification to create and/or distribute an Independent\nImplementation of the Specification that: (i) fully\nimplements the Spec(s) including all its required\ninterfaces and functionality; (ii) does not modify, subset,\nsuperset or otherwise extend the Licensor Name Space, or\ninclude any public or protected packages, classes, Java\ninterfaces, fields or methods within the Licensor Name\nSpace other than those required/authorized by the\nSpecification or Specifications being implemented; and\n(iii) passes the TCK (including satisfying the requirements\nof the applicable TCK Users Guide) for such Specification.\nThe foregoing license is expressly conditioned on your not\nacting outside its scope. No license is granted hereunder\nfor any other purpose.\n\nYou need not include limitations (i)-(iii) from the\nprevious paragraph or any other particular \"pass through\"\nrequirements in any license You grant concerning the use of\nyour Independent Implementation or products derived from\nit. However, except with respect to implementations of the\nSpecification (and products derived from them) that satisfy\nlimitations (i)-(iii) f rom the previous paragraph, You may\nneither: (a) grant or otherwise pass through to your\nlicensees any licenses under Sun's applicable intellectual\nproperty rights; nor (b) authorize your licensees to make\nany claims concerning their implementation's compliance\nwith the Spec in question.\n\nFor the purposes of this Agreement: \"Independent\nImplementation\" shall mean an implementation of the\nSpecification that neither derives from any of Sun's source\ncode or binary code materials nor, except with an\nappropriate and separate license from Sun, includes any of\nSun's source code or binary code materials; and \"Licensor\nName Space\" shall mean the public class or interface\ndeclarations whose names begin with \"java\", \"javax\",\n\"com.sun\" or their equivalents in any subsequent naming\nconvention adopted by Sun through the Java Community\nProcess, or any recognized successors or replacements\nthereof.\n\nThis Agreement will terminate immediately without notice\nfrom Sun if you fail to comply with any material provision\nof or act outside the scope of the licenses granted above.\n\nTRADEMARKS No right, title, or interest in or to any\ntrademarks, service marks, or trade names of Sun or Sun's\nlicensors is granted hereunder. Sun, Sun Microsystems, the\nSun logo, Java, J2EE, and the Java Coffee Cup logo are\ntrademarks or registered trademarks of Sun Microsystems,\nInc. in the U.S. and other countries.\n\nDISCLAIMER OF WARRANTIES THE SPECIFICATION IS PROVIDED \"AS\nIS\". SUN MAKES NO REPRESENTATIONS OR WARRANTIES, EITHER\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO,\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\nPURPOSE, OR NON-INFRINGEMENT, THAT THE CONTENTS OF THE\nSPECIFICATION ARE SUITABLE FOR ANY PURPOSE OR THAT ANY\nPRACTICE OR IMPLEMENTATION OF SUCH CONTENTS WILL NOT\nINFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADE SECRETS\nOR OTHER RIGHTS. This document does not represent any\ncommitment to release or implement any portion of the\nSpecification in any product.\n\nTHE SPECIFICATION COULD INCLUDE TECHNICAL INACCURACIES OR\nTYPOGRAPHICAL ERRORS. CHANGES ARE PERIODICALLY ADDED TO THE\nINFORMATION THEREIN; THESE CHANGES WILL BE INCORPORATED\nINTO N EW VERSIONS OF THE SPECIFICATION, IF ANY. SUN MAY\nMAKE IMPROVEMENTS AND/OR CHANGES TO THE PRODUCT(S) AND/OR\nTHE PROGRAM(S) DESCRIBED IN THE SPECIFICATION AT ANY TIME.\nAny use of such changes in the Specification will be\ngoverned by the then-current license for the applicable\nversion of the Specification.\n\nLIMITATION OF LIABILITY TO THE EXTENT NOT PROHIBITED BY\nLAW, IN NO EVENT WILL SUN OR ITS LICENSORS BE LIABLE FOR\nANY DAMAGES, INCLUDING WITHOUT LIMITATION, LOST REVENUE,\nPRO FITS OR DATA, OR FOR SPECIAL, INDIRECT, CONSEQUENTIAL,\nINCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND\nREGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF OR\nRELATED TO ANY FURNISHING, PRACTICING, MODIFYING OR ANY USE\nOF THE SPECIFICATION , EVEN IF SUN AND/OR ITS LICENSORS HAVE\nBEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. You will\nindemnify, hold harmless, and defend Sun and its licensors\nfrom any claims arising or resulting from: (i) your use of\nthe Specification; (ii) the use or distribution of your\nJava application, applet and/or clean room implementation;\nand/or (iii) any claims that later versions or releases of\nany Specification furnished to you are incompatible with\nthe Specification provided to you under this license.\n\nRESTRICTED RIGHTS LEGEND U.S. Government: If this\nSpecification is being acquired by or on behalf of the U.S.\nGovernment or by a U.S. Government prime contractor or\nsubcontractor (at any tier), then the Government's rights \nin the Specification and accompanying documentation shall\nbe only as set forth in this license; this is in accordance\nwith 48 C.F.R. 227.7201 through 227.7202-4 (for Department\nof Defense (DoD) acquisitions) and with 48 C.F.R. 2.101 and\n12. 212 (for non-DoD acquisitions).\n\nREPORT You may wish to report any ambiguities,\ninconsistencies or inaccuracies you may find in connection\nwith your use of the Specification (\"Feedback\"). To the\nextent that you provide Sun with any Feedback , you hereby:\n(i) agree that such Feedback is provided on a\nnon-proprietary and non-confidential basis, and (ii) grant\nSun a perpetual, non-exclusive, worldwide, fully paid-up,\nirrevocable license, with the right to sublicense through\nmulti ple levels of sublicensees, to incorporate, disclose,\nand use without limitation the Feedback for any purpose\nrelated to the Specification and future versions,\nimplementations, and test suites thereof.\n\n(LFI#134993/Form ID#011801)"
}