{
  "key": "sun-jta-spec-1.0.1",
  "short_name": "Sun JTA Specification License 1.0.1",
  "name": "Sun JTA Specification License v1.0.1",
  "category": "Proprietary Free",
  "owner": "Oracle (Sun)",
  "homepage_url": "http://download.oracle.com/otndocs/jcp/7286-jta-1.0.1-spec-oth-JSpec/?submit=Download",
  "spdx_license_key": "LicenseRef-scancode-sun-jta-spec-1.0.1",
  "ignorable_copyrights": [
    "Copyright 1997-1999 Sun Microsystems, Inc. 901 San Antonio Road, Palo Alto, California 94303 U.S.A."
  ],
  "ignorable_holders": [
    "Sun Microsystems, Inc. 901 San Antonio Road, Palo Alto, California 94303 U.S.A."
  ],
  "ignorable_urls": [
    "http://download.oracle.com/otndocs/jcp/7286-jta-1.0.1-spec-oth-JSpec/?submit=Download"
  ],
  "text": "Sun JTA Specification License v1.0.1\nhttp://download.oracle.com/otndocs/jcp/7286-jta-1.0.1-spec-oth-JSpec/?submit=Download\n\nCopyright 1997-1999 Sun Microsystems, Inc.\n901 San Antonio Road, Palo Alto, California 94303 U.S.A.\nAll rights reserved. Copyright in this document is owned by Sun Microsystems Inc.\n\nSun Microsystems, Inc. (SUN) hereby grants to you at no charge a nonexclusive,\nnontransferable, perpetual, worldwide, limited license (without the right to\nsublicense) under SUN's intellectual property rights that are essential to\npractice this specification for the limited purpose of creating and distributing\nimplementations of this specification, provided however, that such\nimplementations do not derive from any SUN source code or binary materials and\ndo not include any SUN binary materials without an appropriate and separate\nlicense from SUN. Other than this limited license, you acquire no right, title\nor interest in or to this specification or any other SUN intellectual property.\nNo right, title, or interest in or to any trademarks, service marks, or trade\nnames of SUN or SUN’s licensors is granted hereunder.\n\nRESTRICTED RIGHTS LEGEND\nUse, duplication, or disclosure by the U.S. Government is subject to restrictions of FAR 52.227-\n14(g)(2)(6/87) and FAR 52.227-19(6/87), or DFAR 252.227-7015(b)(6/95) and DFAR 227.7202-1(a).\n\nThis specification contains the proprietary information of SUN and may only be used in accordance with\nthe license terms set forth above.\n\nSUN MAKES NO REPRESENTATIONS OR WARRANTIES ABOUT THE SUITABILITY OF THE\nSPECIFICATION, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\nIMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\nOR NON-INFRINGEMENT. SUN SHALL NOT BE LIABLE FOR ANY DAMAGES SUFFERED BY\nYOU AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THIS SPECIFICATION OR ITS\nDERIVATIVES.\n\nTRADEMARKS\nSun, the Sun logo, Sun Microsystems, Java, Enterprise JavaBeans, JDBC, and JDK are trademarks or\nregistered trademarks of Sun Microsystems, Inc. in the United States and other countries.\n\nTHIS PUBLICATION IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER\nEXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NONINFRINGEMENT.\nTHIS PUBLICATION COULD INCLUDE TECHNICAL INACCURACIES OR TYPOGRAPHICAL\nERRORS. CHANGES ARE PERIODICALLY ADDED TO THE INFORMATION HEREIN; THESE\nCHANGES WILL BE INCORPORATED IN NEW EDITIONS OF THE PUBLICATION. SUN\nMICROSYSTEMS, INC. MAY MAKE IMPROVEMENTS AND/OR CHANGES IN THE\nPRODUCT(S) AND/OR THE PROGRAM(S) DESCRIBED IN THIS PUBLICATION AT ANY TIME."
}