{
  "key": "sun-jta-spec-1.0.1b",
  "short_name": "Sun JTA Specification License 1.0.1B",
  "name": "Sun JTA Specification License v1.0.1B",
  "category": "Proprietary Free",
  "owner": "Oracle (Sun)",
  "homepage_url": "http://download.oracle.com/otndocs/jcp/7083-jta-1.0.1B-mr-spec-oth-JSpec/7083-jta-1.0.1B-mr-spec-oth-JSpec-license.html",
  "spdx_license_key": "LicenseRef-scancode-sun-jta-spec-1.0.1b",
  "minimum_coverage": 30,
  "ignorable_copyrights": [
    "Copyright 2002 Sun Micro systems, Inc."
  ],
  "ignorable_holders": [
    "Sun Micro systems, Inc."
  ],
  "text": "Java(TM) Transaction API (JTA) Specification\n(\"Specification\")\nVersion: 1.0.1B\nStatus: Maintenance Release\nRelease: November 5, 2002\n\nCopyright 2002 Sun Micro systems, Inc.\n\n4150 Network Circle, Santa Clara, California\n95054, U.S.A\nAll rights reserved.\n\nNOTICE; LIMITED LICENSE GRANTS\n\nSun Microsystems, Inc. (\"Sun\") hereby grants you a\nfully-paid, non-exclusive, non-t ransferable,\nworldwide, limited license (without the right to\nsublicense), under the Sun's applicable\nintellectual property rights to view, download,\nuse and reproduce the Specification only for the\npurpose of internal evalua tion, which shall be\nunderstood to include developing applications\nintended to run on an implementation of the\nSpecification provided that such applications do\nnot themselves implement any portion(s) of the\nSpecification.\n\nSun also grants you a perpetual, non-exclusive,\nworldwide, fully paid-up, royalty free, limited\nlicense (without the right to sublicense) under\nany applicable copyrights or patent rights it may\nhave in the Specification to c reate and/or\ndistribute an Independent Implementation of the\nSpecification that: (i) fully implements the\nSpec(s) including all its required interfaces and\nfunctionality; (ii) does not modify, subset,\nsuperset or otherwise ex tend the Licensor Name\nSpace, or include any public or protected\npackages, classes, Java interfaces, fields or\nmethods within the Licensor Name Space other than\nthose required/authorized by the Specification or\nSpecifications being implemented; and (iii) passes\nthe TCK (including satisfying the requirements of\nthe applicable TCK Users Guide) for such\nSpecification. The foregoing license is expressly\nconditioned on your not acting outside its scope.\nNo license is granted hereunder for any other\npurpose.\n\nYou need not include limitations (i)-(iii) from\nthe previous paragraph or any other particular\n\"pass through\" requirements in any license You\ngrant concerning the use of your Independent\nImplementation or products derived from it.\nHowever, except with respect to implementations of\nthe Specification (and products derived from them)\nthat satisfy limitations (i)-(iii) from the\nprevious pa ragraph, You may neither: (a) grant or\notherwise pass through to your licensees any\nlicenses under Sun's applicable intellectual\nproperty rights; nor (b) authorize your licensees\nto make any claims concerning their\nimplementa tion's compliance with the Spec in\nquestion.\n\nFor the purposes of this Agreement: \"Independent\nImplementation\" shall mean an implementation of\nthe Specification that neither derives from any of\nSun's source code or binary code materials nor,\nexcept with an appropriate and separate license\nfrom Sun, includes any of Sun's source code or\nbinary code materials; and \"Licensor Name Space\"\nshall mean the public class or interface\ndeclarations whose n ames begin with \"java\",\n\"javax\", \"com.sun\" or their equivalents in any\nsubsequent naming convention adopted by Sun\nthrough the Java Community Process, or any\nrecognized successors or replacements thereof.\n\nThis Agreement w ill terminate immediately without\nnotice from Sun if you fail to comply with any\nmaterial provision of or act outside the scope of\nthe licenses granted above.\n\nTRADEMARKS\n\nNo right, title, or interest in or to any\ntrademarks, service marks, or trade names of Sun\nor Sun's licensors is granted hereunder. Sun, Sun\nMicrosystems, the Sun logo, Java, and the Java\nCoffee Cup logo are trademarks or registered\ntrademarks of Sun Microsystems, Inc. in the U.S.\nand other countries.\n\nDISCLAIMER OF WARRANTIES\n\nTHE SPECIFICATION IS PROVIDED \"AS IS\". SUN MAKES\nNO REPRESENTATIONS OR WARRANTIES, EITHER EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO,\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE, OR NON-INFRINGEMENT, THAT THE\nCONTENTS OF THE SPECIFICATION ARE SUITABLE FOR ANY\nPURPOSE OR THAT ANY PRACTICE OR IMPLEMENTATION OF\nSUCH CONTENTS WILL NOT INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADE SECRETS OR OTHER\nRIGHTS. This document does not represent any\ncommitment to release or implement any portion of\nthe Specification in any product.\n\nTHE SPECIFICATION COULD INCLUDE TECHNICAL\nINACCURACIES OR TYPOGRAPHICAL ERRORS. CHANGES ARE\nPERIODICALLY ADDED TO THE INFORMATION THEREIN;\nTHESE CHANGES WILL BE INCORPORATED INTO NEW\nVERSIONS OF THE SPECIFICATION, IF ANY. SUN MAY\nMAKE IMPROVEMENTS AND/OR CHANGES TO THE P RODUCT(S)\nAND/OR THE PROGRAM(S) DESCRIBED IN THE\nSPECIFICATION AT ANY TIME. Any use of such\nchanges in the Specification will be governed by\nthe then-current license for the applicable\nversion of the Specification.\n\nLIMITATION OF LIABILITY\n\nTO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT\nWILL SUN OR ITS LICENSORS BE LIABLE FOR ANY\nDAMAGES, INCLUDING WITHOUT LIMITATION, LOST\nREVENUE, PROFITS OR DATA, OR FOR SPECIAL,\nINDIRECT, CONSEQU ENTIAL, INCIDENTAL OR PUNITIVE\nDAMAGES, HOWEVER CAUSED AND REGARDLESS OF THE\nTHEORY OF LIABILITY, ARISING OUT OF OR RELATED TO\nANY FURNISHING, PRACTICING, MODIFYING OR ANY USE\nOF THE SPECIFICATION, EVEN IF SUN AND/OR ITS\nLICE NSORS HAVE BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\nYou will indemnify, hold harmless, and defend Sun\nand its licensors from any claims arising or\nresulting from: (i) your use of the Specification;\n(ii) the use or distribution of your Java\napplication, applet and/or clean room\nimplementation; and/or (iii) any claims that later\nversions or releases of any Specification\nfurnished to you are incompatible with the\nSpecification provided t o you under this license.\n\nRESTRICTED RIGHTS LEGEND\n\nU.S. Government: If this Specification is being\nacquired by or on behalf of the U.S. Government or\nby a U.S. Government prime contractor or\nsubcontractor (at any tier ), then the Government's\nrights in the Software and accompanying\ndocumentation shall be only as set forth in this\nlicense; this is in accordance with 48 C.F.R.\n227.7201 through 227.7202-4 (for Department of\nDefense (DoD) acqu isitions) and with 48 C.F.R.\n2.101 and 12.212 (for non-DoD acquisitions).\n\nREPORT\n\nYou may wish to report any ambiguities,\ninconsistencies or inaccuracies you may find in\nconnection with your use of the Specification\n(\"Feedback\"). To the extent that you provide Sun\nwith any Feedback, you hereby: (i) agree that such\nFeedback is provided on a non-proprietary and\nnon-confidential basis, and (ii) grant Sun a\nperpetual, non-exclusive, worldwide, fully\npaid-up, irrevocable license, with the right to\nsublicense through multiple levels of\nsublicensees, to incorporate, disclose, and use\nwithout limitation the Feedback for any purpose\nrelated to the Specification and fut ure versions,\nimplementations, and test suites thereof.\n\n(LFI#121049/Form ID#011801)"
}