{
  "key": "sun-jsr-spec-04-2006",
  "short_name": "Sun JSR Specification 04-2006",
  "name": "Sun JSR Specification License April 2006",
  "category": "Proprietary Free",
  "owner": "Oracle (Sun)",
  "notes": "a highly similar earlier version was published in January 2006.",
  "spdx_license_key": "LicenseRef-scancode-sun-jsr-spec-04-2006",
  "ignorable_copyrights": [
    "Copyright 2006 SUN MICROSYSTEMS, INC. 4150 Network Circle, Santa Clara, California 95054, U.S.A"
  ],
  "ignorable_holders": [
    "SUN MICROSYSTEMS, INC. 4150 Network Circle, Santa Clara, California 95054, U.S.A"
  ],
  "text": "Copyright 2006 SUN MICROSYSTEMS, INC.\n4150 Network Circle, Santa Clara, California 95054, U.S.A\nAll rights reserved.\n\nLIMITED LICENSE GRANTS\n\n1. License for Evaluation Purposes. Sun hereby grants you a fully-paid,\nnon-exclusive, non-transferable, worldwide, limited license (without the\nright to sublicense), under Sun's applicable intellectual property\nrights to view, download, use and reproduce the Specification only for\nthe purpose of internal evaluation. This includes (i) developing\napplications intended to run on an implementation of the Specification,\nprovided that such applications do not themselves implement any\nportion(s) of the Specification, and (ii) discussing the Specification\nwith any third party; and (iii) excerpting brief portions of the\nSpecification in oral or written communications which discuss the\nSpecification provided that such excerpts do not in the aggregate\nconstitute a significant portion of the Specification.\n\n2. License for the Distribution of Compliant Implementations. Sun also\ngrants you a perpetual, non-exclusive, non-transferable, worldwide,\nfully paid-up, royalty free, limited license (without the right to\nsublicense) under any applicable copyrights or, subject to the\nprovisions of subsection 4 below, patent rights it may have covering the\nSpecification to create and/or distribute an Independent Implementation\nof the Specification that: (a) fully implements the Specification\nincluding all its required interfaces and functionality; (b) does not\nmodify, subset, superset or otherwise extend the Licensor Name Space, or\ninclude any public or protected packages, classes, Java interfaces,\nfields or methods within the Licensor Name Space other than those\nrequired/authorized by the Specification or Specifications being\nimplemented; and (c) passes the Technology Compatibility Kit (including\nsatisfying the requirements of the applicable TCK Users Guide) for such\nSpecification (\"Compliant Implementation\"). In addition, the foregoing\nlicense is expressly conditioned on your not acting outside its scope.\nNo license is granted hereunder for any other purpose (including, for\nexample, modifying the Specification, other than to the extent of your\nfair use rights, or distributing the Specification to third parties).\nAlso, no right, title, or interest in or to any trademarks, service\nmarks, or trade names of Sun or Sun's licensors is granted hereunder.\n\nJava, and Java-related logos, marks and names are trademarks or\nregistered trademarks of Sun Microsystems, Inc. in the U.S. and other\ncountries.\n\n3. Pass-through Conditions. You need not include limitations (a)-(c)\nfrom the previous paragraph or any other particular \"pass through\"\nrequirements in any license You grant concerning the use of your\nIndependent Implementation or products derived from it. However, except\nwith respect to Independent Implementations (and products derived from\nthem) that satisfy limitations (a)-(c) from the previous paragraph, You\nmay neither: (a) grant or otherwise pass through to your licensees any\nlicenses under Sun's applicable intellectual property rights; nor (b)\nauthorize your licensees to make any claims concerning their\nimplementation's compliance with the Specification in question.\n\n4. Reciprocity Concerning Patent Licenses.\n\na. With respect to any patent claims covered by the license granted\nunder subparagraph 2 above that would be infringed by all technically\nfeasible implementations of the Specification, such license is\nconditioned upon your offering on fair, reasonable and non-\ndiscriminatory terms, to any party seeking it from You, a perpetual,\nnon-exclusive, non-transferable, worldwide license under Your patent\nrights which are or would be infringed by all technically feasible\nimplementations of the Specification to develop, distribute and use a\nCompliant Implementation.\n\nb With respect to any patent claims owned by Sun and covered by the\nlicense granted under subparagraph 2, whether or not their infringement\ncan be avoided in a technically feasible manner when implementing the\nSpecification, such license shall terminate with respect to such claims\nif You initiate a claim against Sun that it has, in the course of\nperforming its responsibilities as the Specification Lead, induced any\nother entity to infringe Your patent rights.\n\nc Also with respect to any patent claims owned by Sun and covered by the\nlicense granted under subparagraph 2 above, where the infringement of\nsuch claims can be avoided in a technically feasible manner when\nimplementing the Specification such license, with respect to such\nclaims, shall terminate if You initiate a claim against Sun that its\nmaking, having made, using, offering to sell, selling or importing a\nCompliant Implementation infringes Your patent rights.\n\n5. Definitions. For the purposes of this Agreement: \"Independent\nImplementation\" shall mean an implementation of the Specification that\nneither derives from any of Sun's source code or binary code materials\nnor, except with an appropriate and separate license from Sun, includes\nany of Sun's source code or binary code materials; \"Licensor Name Space\"\nshall mean the public class or interface declarations whose names begin\nwith \"java\", \"javax\", \"com.sun\" or their equivalents in any subsequent\nnaming convention adopted by Sun through the Java Community Process, or\nany recognized successors or replacements thereof; and\n\"Technology Compatibility Kit\" or \"TCK\" shall mean the test suite and\naccompanying TCK User's Guide provided by Sun which corresponds to the\nSpecification and that was available either (i) from Sun 120 days before\nthe first release of Your Independent Implementation that allows its use\nfor commercial purposes, or (ii) more recently than 120 days from such\nrelease but against which You elect to test Your implementation of the\nSpecification.\n\nThis Agreement will terminate immediately without notice from Sun if you\nbreach the Agreement or act outside the scope of the licenses granted\nabove.\n\nDISCLAIMER OF WARRANTIES\n\nTHE SPECIFICATION IS PROVIDED \"AS IS\". SUN MAKES NO REPRESENTATIONS OR\nWARRANTIES, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO,\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-\nINFRINGEMENT (INCLUDING AS A CONSEQUENCE OF ANY PRACTICE OR\nIMPLEMENTATION OF THE SPECIFICATION), OR THAT THE CONTENTS OF THE\nSPECIFICATION ARE SUITABLE FOR ANY PURPOSE. This document does not\nrepresent any commitment to release or implement any portion of the\nSpecification in any product. In addition, the Specification could\ninclude technical inaccuracies or typographical errors.\n\nLIMITATION OF LIABILITY\n\nTO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT WILL SUN OR ITS\nLICENSORS BE LIABLE FOR ANY DAMAGES, INCLUDING WITHOUT LIMITATION, LOST\nREVENUE, PROFITS OR DATA, OR FOR SPECIAL, INDIRECT, CONSEQUENTIAL,\nINCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND REGARDLESS OF THE\nTHEORY OF LIABILITY, ARISING OUT OF OR RELATED IN ANY WAY TO YOUR\nHAVING, IMPLEMENTING OR OTHERWISE USING THE SPECIFICATION, EVEN IF SUN\nAND/OR ITS LICENSORS HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.\n\nYou will indemnify, hold harmless, and defend Sun and its licensors from\nany claims arising or resulting from: (i) your use of the Specification;\n(ii) the use or distribution of your Java application, applet and/or\nimplementation; and/or (iii) any claims that later versions or releases\nof any Specification furnished to you are incompatible with the\nSpecification provided to you under this license.\n\nRESTRICTED RIGHTS LEGEND\n\nU.S. Government: If this Specification is being acquired by or on behalf\nof the U.S. Government or by a U.S. Government prime contractor or\nsubcontractor (at any tier), then the Government's rights in the\nSoftware and accompanying documentation shall be only as set forth in\nthis license; this is in accordance with 48 C.F.R. 227.7201 through\n227.7202-4 (for Department of Defense (DoD) acquisitions) and with 48\nC.F.R. 2.101 and 12.212 (for non-DoD acquisitions).\n\nREPORT\n\nIf you provide Sun with any comments or suggestions concerning the\nSpecification (\"Feedback\"), you hereby: (i) agree that such Feedback is\nprovided on a non-proprietary and non-confidential basis, and (ii) grant\nSun a perpetual, non-exclusive, worldwide, fully paid-up, irrevocable\nlicense, with the right to sublicense through multiple levels of\nsublicensees, to incorporate, disclose, and use without limitation the\nFeedback for any purpose.\n\nGENERAL TERMS\n\nAny action related to this Agreement will be governed by California law\nand controlling U.S. federal law. The U.N. Convention for the\nInternational Sale of Goods and the choice of law rules of any\njurisdiction will not apply.\n\nThe Specification is subject to U.S. export control laws and may be\nsubject to export or import regulations in other countries. Licensee\nagrees to comply strictly with all such laws and regulations and\nacknowledges that it has the responsibility to obtain such licenses to\nexport, re-export or import as may be required after delivery to\nLicensee.\n\nThis Agreement is the parties' entire agreement relating to its subject\nmatter. It supersedes all prior or contemporaneous oral or written\ncommunications, proposals, conditions, representations and warranties\nand prevails over any conflicting or additional terms of any quote,\norder, acknowledgment, or other communication between the parties\nrelating to its subject matter during the term of this Agreement. No\nmodification to this Agreement will be binding, unless in writing and\nsigned by an authorized representative of each party.\n\nRev. April, 2006 Sun/Final/Full"
}