{
  "key": "sun-sissl-1.0",
  "short_name": "Sun Industry Standards Source License 1.0",
  "name": "Sun Industry Standards Source License 1.0",
  "category": "Free Restricted",
  "owner": "Oracle (Sun)",
  "spdx_license_key": "LicenseRef-scancode-sun-sissl-1.0",
  "ignorable_copyrights": [
    "Copyright 1998 by Sun Microsystems, Inc"
  ],
  "ignorable_holders": [
    "Sun Microsystems, Inc"
  ],
  "text": "Sun Industry Standards Source License 1.0\n\nDEFINITIONS\n\n1.1.  \"Commercial Use\" means distribution or otherwise\nmaking the Original Code available to a third party.\n\n1.2.  \"Contributor Version\" means the combination of the\nOriginal Code, and the Modifications made by that particular\nContributor.\n\n1.3.  \"Electronic Distribution Mechanism\" means a mechanism\ngenerally accepted in the software development community for\nthe electronic transfer of data.\n\n1.4.  \"Executable\" means Original Code in any form other\nthan Source Code.\n\n1.5.  \"Initial Developer\" means the individual or entity\nidentified as the Initial Developer in the Source Code\nnotice required by 2 (Exhibit A)\n\n1.6.  \"Larger Work\" means a work which combines Original\nCode or portions thereof with code not governed by the terms\nof this License.\n\n1.7.  \"License\" means this document.\n\n1.8.  \"Licensable\" means having the right to grant, to the\nmaximum extent possible, whether at the time of the initial\ngrant or subsequently acquired, any and all of the rights\nconveyed herein.\n\n1.9.  \"Modifications\" means any addition to or deletion from\nthe substance or structure of either the Original Code or\nany previous Modifications.  A Modification is:\n\nA.  Any addition to or deletion from the contents of a file\ncontaining Original Code or previous Modifications.\n\nB.  Any new file that contains any part of the Original Code\nor previous Modifications.  .\n\n1.10.  \"Original Code\" means Source Code of computer\nsoftware code which is described in the Source Code notice\nrequired by Exhibit A as Original Code.\n\n1.11.  \"Patent Claims\" means any patent claims, now owned or\nhereafter acquired, including without limitation, method,\nprocess, and apparatus claims, in any patent Licensable by\ngrantor.\n\n1.12.  \"Source Code\" means the preferred form of the\nOriginal Code for making modifications to it, including all\nmodules it contains, plus any associated interface\ndefinition files, or scripts used to control compilation and\ninstallation of an Executable.\n\n1.13.  \"Standards\" means the standard identified in Exhibit\nB or a subsequent version of such standard.\n\n1.14.  \"You\" or \"Your\" means an individual or a legal entity\nexercising rights under, and complying with all of the terms\nof, this License or a future version of this License issued\nunder Section 6.1.  For legal entities, \"You\" includes any\nentity which controls, is controlled by, or is under common\ncontrol with You.  For purposes of this definition,\n\"control\" means (a) the power, direct or indirect, to cause\nthe direction or management of such entity, whether by\ncontract or otherwise, or (b) ownership of more than fifty\npercent (50%) of the outstanding shares or beneficial\nownership of such entity.\n\n2.0 SOURCE CODE LICENSE\n\n2.1 The Initial Developer Grant:  The Initial Developer\nhereby grants You a world-wide, royalty-free, non-exclusive\nlicense, subject to third party intellectual property\nclaims:\n\na) under intellectual property rights (other than patent or\ntrademark) Licensable by Initial Developer to use,\nreproduce, modify, display, perform, sub license and\ndistribute the Original Code (or portions thereof )with or\nwithout Modifications, and/or as part of a Larger Work; and\n\nb) under Patents Claims infringed by the making, using or\nselling of Original Code, to make, have made, use, practice,\nsell, and offer for sale, and/or otherwise dispose of the\nOriginal Code (or portions thereof).\n\nc) the licenses granted in this Section 2.1(a ) and (b) are\neffective on the date Initial Developer first distributes\nOriginal Code under the terms of this License.\n\nd) Notwithstanding Section 2.1(b )above, no patent license\nis granted:  1) for code that You delete from the Original\nCode; 2) separate from the Original Code; or 3) for\ninfringements caused by:  i) the modification of the\nOriginal Code or\n\nii) the combination of the Original Code with other software\nor devices, including but not limited to Modifications.\n\n3.0 DISTRIBUTION OBLIGATIONS\n\n3.1 Application of License.  The Source Code version of\nOriginal Code may be distributed only under the terms of\nthis License or a future version of this License released\nunder Section 6.1, and You must include a copy of this\nLicense with every copy of the Source Code You distribute.\nYou may not offer or impose any terms on any Source Code\nversion that alters or restricts the applicable version of\nthis License or the recipient's rights hereunder.  Your\nlicense for shipment of the Contributor Version is\nconditioned upon your full compliance with this Section.\nThe Modifications which you create must comply with all\nrequirements set out by the Standards body in effect 120\ndays before You ship the Contributor Version.  In the event\nthat the Modifications do not meet such requirements, You\nagree to publish (i) any deviation from the Standards\nprotocol resulting from implementation of your Modifications\nand (ii) a reference implementation of Your Modifications,\nand to make any such deviation and reference implementation\navailable to all third parties under the same terms as the\nlicense on a royalty free basis within thirty (30) days of\nYour first customer shipment of Your Modifications.\n\n3.2 Required Notices.  You must duplicate the notice in\nExhibit A in each file of the Source Code.  If it is not\npossible to put such notice in a particular Source Code file\ndue to its structure, then You must include such notice in a\nlocation (such as a relevant directory ) where a user would\nbe likely to look for such a notice.  If You created one or\nmore Modifications ) You may add your name as a Contributor\nto the notice described in Exhibit A.  You must also\nduplicate this License in any documentation for the Source\nCode where You describe recipients' rights or ownership\nrights relating to Initial Code.  You may choose to offer,\nand to charge a fee for, warranty, support, indemnity or\nliability obligations to one or more recipients of Your\nversion of the Code.  However, You may do so only\n\non Your own behalf, and not on behalf of the Initial\nDeveloper.  You must make it absolutely clear than any such\nwarranty, support, indemnity or liability obligation is\noffered by You alone, and You hereby agree to indemnify the\nInitial Developer for any liability incurred by the Initial\nDeveloper as a result of warranty, support, indemnity or\nliability terms You offer.\n\n3.3 Distribution of Executable Versions.  You may distribute\nOriginal Code in Executable and Source form only if the\nrequirements of Section 3.1 and 3.2 have been met for that\nOriginal Code, and if You include a notice stating that the\nSource Code version of the Original Code is available under\nthe terms of this License.  The notice must be conspicuously\nincluded in any notice in an Executable or Source versions,\nrelated documentation or collateral in which You describe\nrecipients' rights relating to the Original Code.  You may\ndistribute the Executable and Source versions of Your\nversion of the Code or ownership rights under a license of\nYour choice, which may contain terms different from this\nLicense, provided that You are in compliance with the terms\nof this License.  If You distribute the Executable and\nSource versions under a different license You must make it\nabsolutely clear that any terms which differ from this\nLicense are offered by You alone, not by the Initial\nDeveloper .  You hereby agree to indemnify the Initial\nDeveloper for any liability incurred by the Initial\nDeveloper as a result of any such terms You offer .\n\n3.4 Larger Works.  You may create a Larger Work by combining\nOriginal Code with other code not governed by the terms of\nthis License and distribute the Larger Work as a single\nproduct.  In such a case, You must make sure the\nrequirements of this License are fulfilled for the Original\nCode.\n\n4.0 INABILITY TO COMPLY DUE TO STATUTE OR REGULATION\n\nIf it is impossible for You to comply with any of the terms\nof this License with respect to some or all of the Original\nCode due to statute, judicial order, or regulation then You\nmust:\n\na) comply with the terms of this License to the maximum\nextent possible; and\n\nb) describe the limitations and the code they affect.  Such\ndescription must be included in the LEGAL file described in\nSection 3.2 and must be included with all distributions of\nthe Source Code.  Except to the extent prohibited by statute\nor regulation, such description must be sufficiently\ndetailed for a recipient of ordinary skill to be able to\nunderstand it.\n\n5.0 APPLICATION OF THIS LICENSE This License applies to code\nto which the Initial Developer has attached the notice in\nExhibit A and to related Modifications as set out in Section\n3.1.\n\n6.0 VERSIONS OF THE LICENSE\n\n6.1 New Versions.  Sun Microsystems, Inc.  Sun may publish\nrevised and/or new versions of the License from time to\ntime.  Each version will be given a distinguishing version\nnumber .\n\n6.2 Effect of New Versions.  Once Original Code has been\npublished under a particular version of the License, You may\nalways continue to use it under the terms of that version.\nYou may also choose to use such Original Code under the\nterms of any subsequent version of the License published by\nSun.  No one other than Sun has the right to modify the\nterms applicable to Original Code.\n\n7.  DISCLAIMER OF W ARRANTY.  ORIGINAL CODE IS PROVIDED\nUNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF\nANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT\nLIMITATION, WARRANTIES THAT THE ORIGINAL CODE IS FREE OF\nDEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR\nNON-INFRINGING.  THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE ORIGINAL CODE IS WITH YOU.  SHOULD ANY\nORIGINAL CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE\nINITIAL DEVELOPER )ASSUME THE COST OF ANY NECESSARY\nSERVICING, REPAIR OR CORRECTION.  THIS DISCLAIMER OF\nWARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE.  NO\nUSE OF ANY ORIGINAL CODE IS AUTHORIZED HEREUNDER EXCEPT\nUNDER THIS DISCLAIMER.\n\n8.0 TERMINATION\n\n8.1 This License and the rights granted hereunder will\nterminate automatically if You fail to comply with terms\nherein and fail to cure such breach within 30 days of\nbecoming aware of the breach.  All sublicenses to the\nOriginal Code which are properly granted shall survive any\ntermination of this License.  Provisions which, by their\nnature, must remain in effect beyond the termination of this\nLicense shall survive.\n\n8.2 .In the event of termination under Section 8.1 above,\nall end user license agreements (excluding distributors and\nresellers) which have been validly granted by You or any\ndistributor hereunder prior to termination shall survive\ntermination.\n\n9.0 LIMIT OF LIABILITY UNDER NO CIRCUMSTANCES AND UNDER NO\nLEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE) ,CONTRACT,\nOR OTHER WISE, SHALL YOU, THE INITIAL DEVELOPER, ANY OTHER\nCONTRIBUTOR, OR ANY DISTRIBUTOR OF ORIGINAL CODE, OR ANY\nSUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR\nANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES\nOF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR\nLOSS OF GOOD WILL, WORK STOPPAGE, COMPUTER FAILURE OR\nMALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR\nLOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE\nPOSSIBILITY OF SUCH DAMAGES.  THIS LIMITATION OF LIABILITY\nSHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY\nRESULTING FROM SUCH PARTYS NEGLIGENCE TO THE EXTENT\nAPPLICABLE LAW PROHIBITS SUCH LIMITATION.  SOME\nJURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF\nINCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND\nLIMITATION MAY NOT APPLY TO YOU.\n\n10.0 U .S.  GOVERNMENT END USERS U.S.  Government:  If this\nSoftware is being acquired by or on behalf of the U.S.\nGovernment or by a U.S.  Government prime contractor or\nsubcontractor (at any tier), then the Government's rights in\nthe Software and accompanying documentation shall be only as\nset forth in this license; this is in accordance with 48 C.F\n.R.  227.7201 through 227.7202-4 (for Department of Defense\n(DoD) acquisitions )and with 48 C.F.R.2.101 and 12.212( for\nnon-DoD acquisitions).\n\n11.0 MISCELLANEOUS This License represents the complete\nagreement concerning subject matter hereof.  If any\nprovision of this License is held to be unenforceable, such\nprovision shall be reformed only to the extent necessary to\nmake it enforceable.  This License shall be governed by\nCalifornia law provisions (except to the extent applicable\nlaw, if any, provides otherwise), excluding its\nconflict-of-law provisions.  With respect to disputes in\nwhich at least one party is a citizen of, or an entity\nchartered or registered to do business in the United States\nof America, any litigation relating to this License shall be\nsubject to the jurisdiction of the Federal Courts of the\nNorthern District of California, with venue lying in Santa\nClara County, California, with the losing party responsible\nfor costs, including without limitation, court costs and\nreasonable attorneys fees and expenses.  The application of\nthe United Nations Convention on Contracts for the\nInternational Sale of Goods is expressly excluded.  Any law\nor regulation which provides that the language of a contract\nshall be construed against the drafter shall not apply to\nthis License.\n\nEXHIBIT A - Sun Standards\n\n\"The contents of this file are subject to the Sun Standards\nLicense Version 1.0 the (the \"License\";) You may not use\nthis file except in compliance with the License.  You may\nobtain a copy of the License at\n .\n\n    Software distributed under the License is distributed on\nan \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either\nexpress or implied.  See the License for the specific\nlanguage governing rights and limitations under the License.\n\nThe Original Code is Copyright 1998 by Sun Microsystems, Inc\n\nThe Initial Developer of the Original Code is:  Sun\nMicrosystems, Inc.\n\nPortions created by   are\nCopyright  .\n\nAll Rights Reserved.\n\nContributors:   .\n\nEXHIBIT B - Sun Standards\n\nThe Standard is defined as the following IETF RFCs:\n\nRFC1831:  RPC:  Remote Procedure Call Protocol Specification\nVersion 2 RFC1832:  XDR:  External Data REpresentation\nStandard RFC1833:  Binding Protocols for ONC RPC Version 2\nRFC2078:  Generic Security Service Application Program\nInterface, Version 2 RFC2203:  RPCSEC_GSS Protocol\nSpecification RFC2695:  Authentication Mechanisms for ONC RPC"
}