{
  "key": "sun-bcl-opendmk",
  "short_name": "Sun BCL OpenDMK",
  "name": "Sun BCL OpenDMK",
  "category": "Proprietary Free",
  "owner": "Oracle (Sun)",
  "homepage_url": "https://opendmk.java.net/legal_notices/LICENSE_BINARY.txt",
  "spdx_license_key": "LicenseRef-scancode-sun-bcl-opendmk",
  "text": "Binary License for Project OpenDMK\n\nSun Microsystems, Inc. Binary Code License Agreement\n\nSUN MICROSYSTEMS, INC. (\"SUN\") IS WILLING TO LICENSE THE SOFTWARE TO YOU\nONLY UPON THE CONDITION THAT YOU ACCEPT ALL OF THE TERMS CONTAINED IN THIS\nBINARY CODE LICENSE AGREEMENT (\"AGREEMENT\"). PLEASE READ THE AGREEMENT\nCAREFULLY. BY DOWNLOADING OR INSTALLING THIS SOFTWARE, YOU ACCEPT THE FULL\nTERMS OF THIS AGREEMENT.\n\n1. Definitions.\n\n\"Software\" means all software provided to You in binary code form by Sun\nunder this License as indicated on the \"opendmk.dev.java.net\" website.\nSoftware includes any updates or error corrections or documentation relating\nto Software provided to You by Sun under this License as indicated on\nthe \"opendmk.dev.java.net\" website.\n\n2. Permitted Uses.\n\nSubject to the terms and conditions of this Agreement and restrictions\nand exceptions set forth in the Software's documentation, Sun grants you\na non-exclusive,non-transferable, limited license without fees to\n\n(a) reproduce and use internally the Software for the purposes of\n    developing or running a Project OpenDMK code distribution.\n\n(b) reproduce and distribute the Software (and also portions of Software\n    identified as Redistributable in the documentation accompanying\n    Software), provided that you (i) distribute the Software or\n    Redistributables bundled as part of, and for the sole purpose of\n    running, Project OpenDMK code; (ii) do not remove or alter any proprietary\n    legends or notices contained in or on the Software or Redistributables,\n    (iii) only distribute the Software or Redistributables subject to a\n    license agreement that protects Sun's interests consistent with the\n    terms contained in this Agreement, and (iv) you agree to defend and\n    indemnify Sun and its licensors from and against any damages, costs,\n    liabilities, settlement amounts and/or expenses (including attorneys'\n    fees) incurred in connection with any claim, lawsuit or action by any\n    third party that arises or results from the use or distribution of any\n    and all Programs, Software, or Redistributables.\n\n3. Restrictions.\n\n(a) The copies of Software provided to you under this Agreement is licensed,\n    not sold, to you by Sun. Sun reserves all rights not expressly granted.\n\n(b) You may not modify Software. However if the documentation accompanying\n    Software lists specific portions of Software, such as header files, class\n    libraries, reference source code, and/or redistributable files, that may\n    be handled differently, you may do so only as provided in the\n    documentation.\n\n(c) You may not rent, lease, lend or encumber Software.\n\n(d) You do not remove or alter any proprietary legends or notices contained\n    in the Software,\n\n(e) Unless enforcement is prohibited by applicable law, you may not decompile,\n    or reverse engineer Software.\n\n(f) The terms and conditions of this Agreement will apply to any Software\n    updates, provided to you at Sun's discretion, that replace and/or\n    supplement the original Software, unless such update contains a separate\n    license.\n\n(g) Software is copyrighted.\n\n(h) Software is not designed, licensed or intended for use in the design,\n    construction, operation or maintenance of any nuclear facility and Sun\n    and its licensors disclaim any express or implied warranty of fitness\n    for such uses.\n\n(i) No right, title or interest in or to any trademark, service mark, logo\n    or trade name of Sun or its licensors is granted under this Agreement.\n\n(j) If your Permitted Use in this Agreement permits the distribution Software\n    or portions of the Software, you may only distribute the Software subject\n    to a license agreement that protects Sun's interests consistent with the\n    terms contained in this Agreement.\n\n4. Open Source.\n\nSun supports and benefits from the global community of open source developers,\nand thanks the community for its important contributions and open\nstandards-based technology, which Sun has adopted into many of its products.\n\nPlease note that portions of Software may be provided with notices and open\nsource licenses from such communities and third parties that govern the use\nof those portions, and any licenses granted hereunder do not alter any rights\nand obligations you may have under such open source licenses, however, the\ndisclaimer of warranty and limitation of liability provisions in this\nAgreement will apply to all Software in this distribution.\n\n5. Term and Termination.\n\nThe Agreement is effective on the Date you receive the Software and remains\neffective until terminated. Your rights under this Agreement will terminate\nimmediately without notice from Sun if you materially breach it or take any\naction in derogation of Sun's and/or its licensors' rights to Software. Sun\nmay terminate this Agreement should any Software become, or in Sun's\nreasonable opinion likely to become, the subject of a claim of intellectual\nproperty infringement or trade secret misappropriation. Upon termination,\nyou will cease use of, and destroy, Software and confirm compliance in\nwriting to Sun. Sections 1, 3, 4, 5, and 7-13 will survive termination of\nthe Agreement.\n\n6. Limited Warranty.\n\nSun warrants to you that for a period of 90 days from the date of receipt,\nthe media on which Software is furnished (if any) will be free of defects\nin materials and workmanship under normal use. Except for the foregoing,\nSoftware is provided \"AS IS\". Your exclusive remedy and Sun's entire\nliability under this limited warranty will be at Sun's option to replace\nSoftware media or refund the fee paid for Software. Some states do not allow\nlimitations on certain implied warranties, so the above may not apply to you.\nThis limited warranty gives you specific legal rights. You may have others,\nwhich vary from state to state.\n\n7. Disclaimer of Warranty.\n\nUNLESS SPECIFIED IN THIS AGREEMENT, ALL EXPRESS OR IMPLIED CONDITIONS,\nREPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT ARE\nDISCLAIMED, EXCEPT TO THE EXTENT THAT THESE DISCLAIMERS ARE HELD TO BE\nLEGALLY INVALID.\n\n8. Limitation of Liability.\n\nTO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT WILL SUN OR ITS LICENSORS\nBE LIABLE FOR ANY LOST REVENUE, PROFIT OR DATA, OR FOR SPECIAL, INDIRECT,\nCONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED REGARDLESS OF\nTHE THEORY OF LIABILITY, ARISING OUT OF OR RELATED TO THE USE OF OR INABILITY\nTO USE SOFTWARE, EVEN IF SUN HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES. In no event will Sun's liability to you, whether in contract,\ntort (including negligence), or otherwise, exceed the amount paid by you\nSoftware under this Agreement. The foregoing limitations will apply even if\nthe above stated warranty fails of its essential purpose. Some states do not\nallow the exclusion of incidental or consequential damages, so some of the\nterms above may not be applicable to you.\n\n9. Export Regulations.\n\nAll Software, documents, technical data, and any other materials delivered\nunder this Agreement are subject to U.S. export control laws and may be\nsubject to export or import regulations in other countries. You agree to\ncomply strictly with these laws and regulations and acknowledge that you\nhave the responsibility to obtain any licenses to export, re-export, or\nimport as may be required after delivery to you.\n\n10. U.S. Government Restricted Rights.\n\nIf Software is being acquired by or on behalf of the U.S. Government or by a\nU.S. Government prime contractor or subcontractor (at any tier), then the\nGovernment's rights in Software and accompanying documentation will be only\nas set forth in this Agreement; this is in accordance with 48 CFR 227.7201\nthrough 227.7202-4 (for Department of Defense (DOD) acquisitions) and with\n48 CFR 2.101 and 12.212 (for non-DOD acquisitions).\n\n11. Governing Law.\n\nAny action related to this Agreement will be governed by California law and\ncontrolling U.S. federal law. No choice of law rules of any jurisdiction\nwill apply.\n\n12. Severability.\n\nIf any provision of this Agreement is held to be unenforceable, this\nAgreement will remain in effect with the provision omitted, unless omission\nwould frustrate the intent of the parties, in which case this Agreement will\nimmediately terminate.\n\n13. Integration.\n\nThis Agreement is the entire agreement between you and Sun relating to its\nsubject matter. It supersedes all prior or contemporaneous oral or written\ncommunications, proposals, representations and warranties and prevails over\nany conflicting or additional terms of any quote, order, acknowledgment, or\nother communication between the parties relating to its subject matter during\nthe term of this Agreement. No modification of this Agreement will be binding,\nunless in writing and signed by an authorized representative of each party.\n\nPage Last Modified: 14 August 2007"
}