{
  "key": "tanuki-development",
  "short_name": "Tanuki Development License 1.3",
  "name": "Tanuki Development Software License Agreement 1.3",
  "category": "Commercial",
  "owner": "Tanuki Software",
  "homepage_url": "https://wrapper.tanukisoftware.com/doc/english/licenseDevelopment.html#text",
  "spdx_license_key": "LicenseRef-scancode-tanuki-development",
  "faq_url": "https://wrapper.tanukisoftware.com/doc/english/licenseDevelopment.html#overview",
  "ignorable_copyrights": [
    "Copyright (c) 2001 Silver Egg Technology"
  ],
  "ignorable_holders": [
    "Silver Egg Technology"
  ],
  "ignorable_urls": [
    "http://wrapper.tanukisoftware.org/"
  ],
  "text": "Tanuki Software, Ltd.\nDevelopment Software License Agreement\nVersion 1.3\n\nIMPORTANT-READ CAREFULLY: This License Agreement is a legal agreement\nbetween you (\"Licensee\") and Tanuki Software, Ltd. (\"TSI\"), under\nwhich TSI grants licenses with respect to computer software,\nassociated media, printed materials, and may include online or\nelectronic documentation.  PLEASE READ THIS AGREEMENT CAREFULLY BEFORE\nYOU INSTALL, COPY, DOWNLOAD OR USE THE SOFTWARE ACCOMPANYING THIS\nPACKAGE.  BY INSTALLING, COPYING, DOWNLOADING OR USING THE SOFTWARE,\nYOU, ON BEHALF OF YOURSELF AND/OR THE BUSINESS YOU REPRESENT, AGREE TO\nBE BOUND BY ALL TERMS AND CONDITIONS OF THIS AGREEMENT INCLUDING ALL\nTERMS AND CONDITIONS INCORPORATED HEREIN BY REFERENCE.  The Licensee\nmay optionally request that this agreement be signed by both parties:\n\nLicense Agreement Number: TSILA-____________\n          \nPursuant to this DEVELOPMENT SOFTWARE LICENSE AGREEMENT (the\n\"Agreement\") dated this __th day of ______, 20__ (the \"Effective\nDate\"), _____________________ (\"Licensee\") and Tanuki Software, Ltd.\n(\"TSI\") agree to the following terms and conditions:\n\n\nSection 1 - Grant of License\n\nEffective upon the payment of the license fees presented in Exhibit 1,\nTSI grants to Licensee a non-exclusive, non-transferable,\nnon-sublicensable right and license to use, reproduce, display, sell,\nlease, distribute and transfer copies, directly or indirectly, of the\nSoftware Program and documentation, in executable code form only, as\nparts of Licensee Products within the Product Group(s) defined in\nExhibit 1, for the purposes of marketing such Products to Licensee\ncustomers and for internal development of Products, during the period\nLicensee's subscription of the TSIMS (as defined in Section 5)\neffectively continues.   Licensee may continue to market and\ndistribute Product Versions containing the Software Program so long as\nsuch Product Versions have been completely developed by the end of the\nperiod Licensee's subscription of the TSIMS is active; provided\nhowever that under no circumstances may Licensee develop or continue\nto develop any new Product, or new Product Version, using or\ncontaining the Software Program after Licensee discontinues\nsubscription of TSIMS.   Licensee may not, under any circumstances,\ndistribute or resell the Software Program as a stand-alone product,\nnor use the Software Program to create any Product to directly compete\nwith the Software Program.\n\nWhere the Licensee qualifies as a Small Business, as defined in\nSection 2.5, the Product Group restriction is removed and all Licensee\nProducts will be covered by this agreement.\n\n\nSection 2 - Definitions \n\n2.1. \"Community Edition\" shall mean versions of the Software Program\ndistributed in source form under the Tanuki Software, Ltd. Community\nSoftware License Agreement (CSLA), and all new releases, corrections,\nenhancements and updates to the Software Program, which TSI makes\ngenerally available under the CSLA.  \n\n2.2. \"Documentation\" shall mean the contents of the website describing\nthe functionality and use of the Software Program, located at\nhttp://wrapper.tanukisoftware.org\n\n2.3. \"Product\" shall mean the computer programs, that are provided by\nLicensee to Licensee customers or potential customers, and that\ncontain both the Software Program as a component of the Product, and a\ncomponent or components (other than the Software Program) that provide\nthe material functionality of the Product.  If the Product is released\nin source form, the Software Program or any of its components may only\nbe included in executable form.\n\n2.4 \"Product Version\" shall mean a specific distribution or release of\na Product.  Any modifications to the distribution or release which\ninclude changes to program functionality or updated included modules\nor libraries constitute a new Product Version.\n\n2.4 \"Product Group\" shall mean one or more Products or Product\ncomponents which are designed as components of a common project,\nproduct, or product suite.\n\n2.5 \"Small Business\" shall mean a company or organization with less\nthan 100 employees and annual sales of less than 5 million USD, 4\nmillion EUR, or 400 million JPY, depending on the currency used to\npurchase the Software Program, unless otherwise qualified in\nExhibit 1.\n\n2.6. \"Software Program\" shall mean the computer software and license\nfile provided by TSI under this Agreement, including all new releases,\ncorrections, enhancements and updates to such computer software, which\nTSI makes generally available and which Licensee receive pursuant to\nLicensee subscription to TSIMS. Some specific features or platforms\nmay not be enabled if they do not fall under the feature set(s)\ncovered by the specific license fees paid.\n\n\nSection 3 - Licensee Obligations\n\nLicensee shall be solely responsible for all marketing, manufacturing,\npackaging, documentation production, distribution and customer pricing\nof the Products, and ensure that the Products and Licensee's such\nactivities shall be in compliance with the applicable laws and\nregulations.  Except as otherwise provided in this Agreement, Licensee\nshall also assume all responsibility and liability to customers for\nrelated support and assistance.  Under no circumstances may Licensee\nmodify, decompile, reverse engineer or disassemble any executable code\ncontained within the Software Program nor create or prepare derivative\nworks of, or attempt to discover or modify in any way the underlying\nsource code of the Software Program or any part thereof.  Licensee\nagrees that Licensee will not, nor will Licensee authorize or license\nanother to, sell, market or license the Software Program, or any\nportion thereof, as a standalone computer software program, component\nor software development tool, or as a component or components of a\ncomputer software program, the chief marketability and functionality\nof which is the Software Program.  Licensee further agrees that\nLicensee will not publish, present or document the application\nprogramming interface (API) of the Software Program except as required\nfor specific use within the Product.\n\nLicensee shall ensure that each end user receiving a copy of any\nProduct shall receive a license agreement containing terms no less\nprotective of the Software Program than those contained in Exhibit 2,\nwhich shall include the Copyright Notices described therein in a\nlocation that is obvious to Licensee's customers. \n\nNeither the Software Program nor Product may be modified, nor in any\nway obfuscate or obstruct the copyright notice and license information\ndisplayed in the console and log files by the Software Program on\nstartup.\n\nLicensee may extend and/or modify the Community Edition of the\nSoftware Program and distribute under the terms of this agreement\nprovided that a) the Software Program is only distributed in\nexecutable form, and b) a valid license key is distributed with\nSoftware Program such that the Software Program is able to access the\nlicense key, and c) the Copyright and \"Licensed to {Licensee} for\n{Product}\" notices are clearly visible in the console and log files of\nthe Software Program on startup, and d) the \"Licensed to {Licensee}\nfor {Product}\" notice displays the Licensee and Product values from\nthe license key file.\n\n\nSection 4 - Copyright and Trademark\n\nLicensee acknowledges that all copyrights in the Software Program and\nthe goodwill associated therewith are vested in and belong to TSI.\n\n\nSection 5 - Maintenance Services\n\n5.1 Scope and Duration\nTSI Maintenance Services (\"TSIMS\") are provided on an annual basis for\nthe Software Program. The first year of TSIMS shall be included in the\ninitial fees paid for the license.  Successive one (1) year periods of\nTSIMS, can optionally be ordered for 25% of the then current rate\nestablished by TSI for an equivalent Agreement. TSI shall provide\nLicensee with notice of such renewal, at least thirty (30) days prior\nto the end of the current TSIMS period. In the event that Licensee\nallows TSIMS to expire, TSI will allow Licensee to obtain TSIMS for\nsuch Licensed Software including any new versions of the Licensed\nSoftware upon payment of 125% of all lapsed TSIMS fees.\n\nFor Licensees who have qualified as a Small Business, this status may\nbe reviewed each time TSIMS is renewed.  For Licensees who no longer\nqualify as a Small Business, this agreement will continue to cover\nexisting Products and Product Groups, but additional Product Group(s)\nwill require their own separate Agreement(s).\n\n5.2 Maintenance Obligations of the Parties\nLicensee agrees to provide first line support for the Product and\nSoftware Program to Licensee customers, which support will include\n(i) appropriate number of trained personnel available to provide, in a\ncompetent manner, first line support of the Software Program to\nLicensee customers, (ii) log of all communication between Licensee and\nLicensee customer, as well as a reproducible test case (wherever\npossible) and any relevant information for any second line support\ncases that have been opened by Licensee with TSI.\n\n\nSection 6 - Warranty and Limited Liability\n\nSoftware Warranty: TSI warrants that, for a period of ninety (90) days\nfrom the initial delivery of the Software Program to Licensee, the\nSoftware Program, if used by Licensee in accordance with the\nDocumentation, shall operate in material conformity with the\nDocumentation for such Software Program. TSI does not warrant that the\nSoftware Program will meet all of Licensee requirements or that the\nuse of the Software Program will be uninterrupted or error free. TSI's\nentire liability, and Licensee exclusive remedy, under this limited\nSoftware Warranty shall be for TSI (i) to attempt, through reasonable\nefforts, to correct any reproducible material nonconformity discovered\nwithin the ninety (90) day warranty period; or (ii) to replace the\nnonconforming Software Program with Software Program which conforms to\nthe foregoing warranty. In the event TSI is unable to cure the breach\nof warranty described in this Section 6, after attempting the remedies\ndescribed in (i) and (ii) above, Licensee may return the Software\nProgram and TSI shall refund any license and maintenance fees paid by\nLicensee to TSI for the Software Program provided the refund of\nmaintenance fees shall be limited to the amount representing the\nperiod during which the Software Program showed nonconformity. The\nabove remedies are available only if TSI is promptly notified in\nwriting, within the warranty period, upon discovery of the\nnonconformity by Licensee and TSI's examination of the Software\nProgram discloses that such nonconformity exists, and that the\nSoftware Program has not been (i) altered or modified, other than by\nTSI, (ii) subjected to negligence, or computer or electrical\nmalfunctions, or (iii) used, adjusted, or installed other than in\naccordance with the Documentation.  \n\nTSIMS and Other Services Warranty: TSI warrants that any TSIMS or\nother services performed pursuant to the terms of this Agreement shall\nbe performed in a professional and workmanlike manner consistent with\ngenerally accepted industry standards. \n\nDisclaimer: THE EXPRESS LIMITED WARRANTIES SET FORTH ABOVE ARE\nEXCLUSIVE AND IN LIEU OF ALL OTHER WARRANTIES, EXPRESS, IMPLIED OR\nSTATUTORY WITH RESPECT TO THE SOFTWARE PROGRAM, AND TSI EXPRESSLY\nDISCLAIMS ANY IMPLIED WARRANTIES, INCLUDING WITHOUT LIMITATION,\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nLimitation of Liability: IN NO EVENT SHALL EITHER PARTY'S LIABILITY\nARISING OUT OF THIS AGREEMENT OR THE TERMINATION OF THIS AGREEMENT\nEXCEED THE AMOUNTS PAID OR DUE TO TSI HEREUNDER DURING A FULL YEAR\nIMMEDIATELY PRECEDING SUCH EVENT.  IF SUCH LIABILITY RELATES TO\nPARTICULAR ITEMS OF SOFTWARE PROGRAM OR SERVICES PROVIDED BY TSI, SUCH\nLIABILITY SHALL BE LIMITED TO THE FEES PAID FOR THE RELEVANT SOFTWARE\nPROGRAM OR SERVICES. IN NO EVENT SHALL EITHER PARTY HAVE ANY LIABILITY\nFOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES INCLUDING, WITHOUT\nLIMITATION, DAMAGES FOR LOST PROFITS, LOSS OF DATA OR COSTS OF\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, ARISING IN ANY WAY OUT OF\nTHIS AGREEMENT UNDER ANY CAUSE OF ACTION, WHETHER OR NOT THE OTHER\nPARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.  NO ACTION\nMAY BE BROUGHT AGAINST TSI LATER THAN ONE (1) YEAR AFTER THE CAUSE OF\nACTION OCCURRED.  EXCEPT FOR CLAIMS MADE UNDER SECTION 7\n(INDEMNIFICATION), IN NO EVENT SHALL TSI BE LIABLE FOR ANY CLAIMS,\nDEMANDS OR ACTIONS OF ANY NATURE BROUGHT BY ANY THIRD PARTY AGAINST\nLICENSEE.  THESE LIMITATIONS SHALL APPLY NOTWITHSTANDING THE FAILURE\nOF THE ESSENTIAL PURPOSE OF ANY LIMITED REMEDY.\n\nWarranty Claims: Any claims made by Licensee for the breach of a\nwarranty set forth in this Section 6, shall be made in writing and\ndelivered to TSI by the end of the applicable warranty period, and\nLicensee shall provide TSI a reproducible test case, if applicable,\ndemonstrating the breach of warranty.\n\n\nSection 7 - Indemnification\n\nTSI warrants that the use or distribution of unaltered Software\nProgram(s), or the exercise of the licenses granted hereunder, will\nnot infringe any copyright or patent, or other intellectual property\nrights of any third party, and TSI has all rights necessary for the\ngrant of the rights and licenses granted by this Agreement. TSI agrees\nto indemnify, defend and hold Licensee harmless from any and all\nactions, causes of action, claims, demands, reasonable costs,\nliabilities, reasonable expenses (including reasonable attorney's\nfees) and damages (collectively, a \"Loss\" or \"Losses\") arising from\nany claim that the Software Program infringes any copyright or patent,\nor other intellectual property right of a third party, provided,\nhowever:\n(1) Licensee shall promptly deliver to TSI notice in writing of any\n    infringement claim made by a third party, and, if known, specify\n    in reasonable detail the nature of the claim and the amount, or an\n    estimate of the amount, of the liability arising there from.\n    Licensee shall, at TSI's expense, provide to TSI as promptly as\n    practicable thereafter information and documentation reasonably\n    requested by TSI to support and verify the claim asserted,\n    provided that, in so doing, TSI may restrict or condition any\n    disclosure in the interest of preserving privileges of importance\n    in any foreseeable litigation.\n(2) TSI may assume and retain sole control of the investigation, the\n    defense or the settlement of any third party infringement claim\n    made against Licensee or TSI with respect to the Software Program,\n    including the employment of counsel or accountants, at its cost\n    and expense. Licensee shall have the right to employ counsel\n    separate from counsel employed by TSI in any such action and to\n    participate therein, but the fees and expenses of such counsel\n    employed by Licensee shall be at Licensee expense.  TSI shall have\n    the right to determine and adopt (or, in the case of a proposal by\n    Licensee, to approve) a settlement of such matter in its\n    reasonable discretion. TSI shall not be liable for any settlement\n    of any claim effected without TSI's prior written consent, which\n    shall not be unreasonably withheld.  Whether or not TSI chooses to\n    so investigate or defend such claim, Licensee shall reasonably\n    cooperate with TSI in the defense thereof and shall furnish such\n    records, information and testimony, and attend such conferences,\n    discovery proceedings, hearings, trials and appeals, as may be\n    reasonably requested by TSI in connection therewith.\n(3) If such a claim arises, or in either party's judgment is likely to\n    arise, Licensee agrees to allow TSI, at TSI's option, to either\n    (i) procure the right to permit the continued exercise of the\n    rights and licenses in the Software Program granted under this\n    Agreement; (ii) replace or modify the Software Program so it\n    be-comes non-infringing, while affording equivalent performance;\n    or (iii) terminate the license for the infringing Software Program\n    and upon return thereof by Licensee, refund the unearned portion\n    of any license fees paid by Licensee for the remainder of the\n    current term hereof.\n(4) TSI shall have no indemnity obligation for claims of infringement\n    resulting from any combination, operation or use of the Software\n    Program, or any components thereof, with any software programs or\n    data not supplied by TSI if such infringement would have been\n    avoided by use of the Software Program alone. Licensee\n    acknowledges and agrees that these four items are the exclusive\n    remedy of Licensee for damages for breach of warranty or\n    representations contained in this Section 7.\n\n\nSection 8 - Termination\n\nShould either party commit a material breach of its obligations\nhereunder, the other party may, at its option, terminate this\nAgreement by written notice to the party in default. Such notice shall\nidentify and describe the default upon which termination is based. The\ndefaulting party shall have thirty (30) days from the effective\ndelivery of the notice to cure such default, which, if affected, shall\nprevent termination by virtue of such default.  Should an insolvency\nproceeding be filed by or against either party, the other party may\nterminate this Agreement forthwith by giving a written notice to the\nfirst party.  Upon termination of this Agreement, Licensee will either\nreturn to TSI or destroy all copies of the Software Program and\ndocumentation then in Licensee's possession.  Licenses to the Software\nProgram granted in the normal course of business by Licensee to its\ncustomers shall survive termination of this Agreement.  Licensee\nshall, within thirty (30) days after the date of such termination,\nfurnish TSI with a certificate of compliance in accordance with this\nSection.  The parties agree that TSI shall have the right to enforce\nthe obligations arising under this Section and to enjoin or compel\nLicensee through injunctive relief. Licensee may retain a commercially\nreasonable number of copies of the Software Program and documentation\nsolely for the purpose of supporting Licensee customers who purchased\na Product prior to the termination of this Agreement.\n\n\nSection 9 - Export Controls\n\nLicensee shall comply with, and ensure that Licensee distributors and\nresellers comply with, all applicable laws, regulations, rulings and\nexecutive orders of Japan or any other relevant jurisdiction relating\nto the export and re-export of the Software Program or any products\ncontaining the Software Program. Licensee shall not directly or\nindirectly export or re-export any Software Program or any Products\ncontaining the Software Program unless Licensee have obtained a\nlicense to do so if such a license is required.  Licensee further\nagree that Licensee take appropriate measure to ensure that the\nSoftware Program or any Products containing the Software Program will\nnot be exported or re-exported in violation of any applicable laws or\nregulations of any relevant jurisdiction.\n\n\nSection 10 - Entire Agreement\n\nThis Agreement, including any attachments, constitutes the entire\nagreement of the parties with respect to the subject matter hereof and\nsupersedes all prior agreements, both oral and written,\nrepresentations, statements, negotiations and undertakings, with\nrespect to the subject matter hereof, which such agreements,\nrepresentations, statements, negotiations and undertakings are merged\nherein.  No amendment or modification of this Agreement or any\nprovision or attachment of this Agreement shall be effective unless it\nis in writing and signed by both parties.\n\n\nSection 11 - Governing Law\n\nThe validity, construction and performance of this Agreement shall be\ngoverned by the substantive laws of  Japan (excluding conflicts of law\nprinciples).  Licensee and TSI agree that any dispute arising out of\nthis Agreement shall be subject to the exclusive jurisdiction of the\nTokyo District Court of Japan. If any legal action is undertaken to\nenforce the terms of this Agreement, the prevailing party shall be\nentitled to reasonable attorney's fees and costs in addition to any\nother relief to which that party may be entitled.\n\n Licensee agrees that the United Nations Convention on Contracts for\nthe International Sales of Goods will not apply to this Agreement.\n\n\nSection 12 - Assignment and Benefit\n\nWithout the consent of the other party in writing, neither party may\nassign this Agreement; provided, however, TSI or Licensee may assign\nthis Agreement to a wholly-owned subsidiary of the respective\ncorporation or a corporation in which the shareholders of the\nrespective corporation own a majority interest of the voting control\nprovided that the assigning party remains obligated hereunder; further\nprovided, however, TSI or Licensee may assign this Agreement to\nanother corporation which acquires or has acquired substantially all\nof the stock or assets of the assignor.  Where the Licensee had\nqualified as a Small Business, and the assignee does not, this\nagreement will continue to cover existing Products and Product\nGroup(s), but additional Product Group(s) will require their own\nseparate Agreement(s).\n\nThis Agreement shall be binding upon and shall inure to the benefit of\nLicensee and TSI and each party's successors, subject to the other\nprovisions of this Section.\n\n\nSection 13 - 3rd Party Components\n\n(1) The Software Program includes software and documentation\ncomponents developed in part by Silver Egg Technology, Inc.(\"SET\")\nprior to 2001 and released under the following license.\n\n    Copyright (c) 2001 Silver Egg Technology\n\n    Permission is hereby granted, free of charge, to any person\n    obtaining a copy of this software and associated documentation\n    files (the \"Software\"), to deal in the Software without\n    restriction, including without limitation the rights to use, copy,\n    modify, merge, publish, distribute, sub-license, and/or sell\n    copies of the Software, and to permit persons to whom the Software\n    is furnished to do so, subject to the following conditions:\n    \n    The above copyright notice and this permission notice shall be\n    included in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n    EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n    NON-INFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT\n    HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\n    WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\n    DEALINGS IN THE SOFTWARE.\n\nLicensor represents and warrants that the Program does not contain any\ncode subject to the GNU General Public License (\"GPL\"), GNU Lesser\nGPL, \"copyleft\" license, or any other license that requires as a\ncondition of use, modification and/or distribution of such code that\nother software incorporated into, derived from, or distributed with\nsuch code be (i) disclosed or distributed in Source Code Program form;\n(ii) licensed for the purpose of making derivative works; or (iii)\nredistributable at no charge.\n\n\nSection 14 - Confidentiality \n\nConfidential Information means all technical, business, financial and\nother information that is disclosed by either party to the other,\nwhether orally or in writing, and all the terms and conditions of this\nAgreement, and all non-publicly available information.  \"Confidential\nInformation\" will not include any information (a) that is publicly\navailable through no breach of this Agreement by either party, (b)\nthat is independently developed or was previously known by either\nparty, or (c) that is rightfully acquired by either party from a third\nparty not under an obligation of confidentiality.\n\nExcept as expressly permitted by this Agreement, both parties shall\nnot, nor shall they permit their respective employees, agents,\nattorneys or independent contractors to, disclose, use, copy,\ndistribute, sell, license, publish, reproduce or otherwise make\navailable Confidential Information of the other party.  Each party\nwill (a) secure and protect the other party's Confidential Information\nby using the same or greater level of care that it uses to protect its\nown confidential and proprietary information of like kind, but in no\nevent less than a reasonable degree of care, and (b) advise each of\ntheir respective employees, agents, attorneys and independent\ncontractors who have access to such Confidential Information of the\nterms of this paragraph.  Notwithstanding the foregoing, either party\nmay disclose the other party's Confidential Information to the extent\nrequired by applicable law or regulation, or by order of a court or\nother governmental entity, in which case such party shall so notify\nthe other party as soon as practicable.  \n\nThe confidentiality obligation hereunder shall survive termination or\nexpiration of this Agreement.\n\n\nSection 15 - Payments\n\nAll amounts payable are due net 30 days from the invoice date unless\notherwise specified in the invoice.  All amounts payable are gross\namounts but exclusive only of any value added tax, sales tax or their\nequivalent. If any such tax is or will be chargeable, the Licensee\nshall pay the tax to the Licensor and the Licensor shall provide the\nLicensee with a tax invoice that meets all conditions necessary to\nallow the Licensee to reclaim such tax. If according to applicable law\nor regulations the Licensee is liable for any such tax, the Licensee\nwill account for or pay the tax to the tax authorities. Each Party is\nresponsible for all taxes (including, but not limited to, taxes based\nupon its income) or levies imposed on it under applicable laws,\nregulations and tax treaties as a result of this agreement. In the\nevent that a withholding tax is payable, and the Licensee is required\nto deduct the withholding tax from the payment to the Licensor as\nrequired under applicable laws, regulations and tax treaties, the\nLicensee agrees to furnish evidence of such paid taxes to the Licensor\nas is sufficient to enable the Licensor to obtain any tax credits\navailable to it.  Such evidence must be translated into English or\nJapanese and be provided with the original, unless approved by the\nLicensor in writing. \n\n\n----------------------------------------------------------------------\nIN WITNESS WHEREOF, the parties have caused this Agreement to be\nexecuted by their respective duly authorized representatives. \n\nLICENSEE           \t\t\t\t\tTSI \n \n__________________________          By: ______________________________  \n  \nDepartment name                     Title: ___________________________ \n\n__________________________          Date: ____________________________\n  \n\nLicensee's Authorized Signature\n\n___________________________\n\n\nTyped or Printed Name\n\n___________________________\n\n\nTitle:\n\n___________________________\n\n\nDate:\n\n___________________________\n\n\nStreet Address\n\n___________________________\n\nCity or Town\n___________________________\n\nState or Province\n___________________________\n\nZip Code\n___________________________\n\nCountry\n___________________________\n \n\n\n----------------------------------------------------------------------\nEXHIBIT 1\n\nLicensed Software:\nJava Service Wrapper version ____, __________ Edition __ Bit\n\nLicensed Operating System and Hardware Platform:\nAll platforms\n\nLicensed Software Commercial Restrictions:\nNone\n\nLicensed Software Use:\nBundle Development / Deployment.\n\nLicensed Software Use Location:\nBundle Development/Deployment Worldwide\n\nAuthorized Number of Users:\nUnlimited\n\nLicensee Small Business Status:\n[   ] Small Business\n[ X ] N/A\n\nLicensee Product Group(s) Covered by this Agreement:\n\n\nFEES:\nSoftware License + first year of TSIMS\n$ \n\nTSIMS for year 2 and onward will be priced at 25% of the then current\nprice of a new Software License.\n[   ] TSIMS for year 2 and later will be automatically invoiced one\n      month prior to TSIMS expiring unless previously notified in\n      writing of a request not to renew.\n[ X ] TSIMS for year 2 and later will be invoiced on request.\n      Requests made after TSIMS has expired will be at 125% of the\n      regular price.\n\n(Services)\nNone\n\n\n----------------------------------------------------------------------\nEXHIBIT 2\nEnd User License Terms / Copyright Notice\n\nAll End User Licenses shall include provisions that:\n\n(1) the End User is granted only a personal, nontransferable, and\n    nonexclusive right to use the software only for personal use of\n    the End User;\n\n(2) Licensee and/or its licensors retain all of their intellectual\n    property rights in the software, and no title to such intellectual\n    property is transferred to the End User;\n\n(3) the End User agrees not to reverse assemble, decompile, or\n    otherwise attempt to derive source code from the TSI software;\n\n(4) Licensee's licensors shall not be liable to the End User for any\n    indirect, consequential, incidental or special damages arising out\n    of the use or license of the software, regardless of the theory of\n    liability (including negligence and strict liability); and\n\n(5) Licensee and/or its licensors will have the right to terminate the\n    license at any time in the event the End Users misuses the\n    software;\n\nand\n\nA section concerning 3rd party components shall be provided, in all\nEnd User licenses, which contains at least the following:\n\nThe Software Program includes software and documentation components\ndeveloped in part by Silver Egg Technology, Inc.(\"SET\") prior to 2001\nand released under the following license.\n\n    Copyright (c) 2001 Silver Egg Technology\n\n    Permission is hereby granted, free of charge, to any person\n    obtaining a copy of this software and associated documentation\n    files (the \"Software\"), to deal in the Software without\n    restriction, including without limitation the rights to use, copy,\n    modify, merge, publish, distribute, sub-license, and/or sell\n    copies of the Software, and to permit persons to whom the Software\n    is furnished to do so, subject to the following conditions:\n    \n    The above copyright notice and this permission notice shall be\n    included in all copies or substantial portions of the Software."
}