{
  "key": "tgppl-1.0",
  "short_name": "TGGPL 1.0",
  "name": "Transitive Grace Period Public Licence 1.0",
  "category": "Copyleft",
  "owner": "Tahoe-LAFS",
  "homepage_url": "http://allmydata.org/source/tahoe/trunk/COPYING.TGPPL.html",
  "spdx_license_key": "LicenseRef-scancode-tgppl-1.0",
  "text_urls": [
    "https://tahoe-lafs.org/source/tahoe/trunk/COPYING.TGPPL.rst",
    "http://allmydata.org/source/tahoe/trunk/COPYING.TGPPL.html"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2007 Zooko"
  ],
  "ignorable_holders": [
    "Zooko"
  ],
  "text": "Transitive Grace Period Public Licence (\"TGPPL\") v. 1.0\n\nThis Transitive Grace Period Public Licence (the \"License\") applies to\nany original work of authorship (the \"Original Work\") whose owner (the\n\"Licensor\") has placed the following licensing notice adjacent to the\ncopyright notice for the Original Work:\n\n*Licensed under the Transitive Grace Period Public Licence version 1.0*\n\n   1. *Grant of Copyright License.* Licensor grants You a worldwide,\n      royalty-free, non-exclusive, sublicensable license, for the\n      duration of the copyright, to do the following:\n\n         1. to reproduce the Original Work in copies, either alone or as\n            part of a collective work;\n\n         2. to translate, adapt, alter, transform, modify, or arrange\n            the Original Work, thereby creating derivative works\n            (\"Derivative Works\") based upon the Original Work;\n\n         3. to distribute or communicate copies of the Original Work and\n            Derivative Works to the public, with the proviso that copies\n            of Original Work or Derivative Works that You distribute or\n            communicate shall be licensed under this Transitive Grace\n            Period Public Licence no later than 12 months after You\n            distributed or communicated said copies;\n\n         4. to perform the Original Work publicly; and\n\n         5. to display the Original Work publicly.\n\n   2. *Grant of Patent License.* Licensor grants You a worldwide,\n      royalty-free, non-exclusive, sublicensable license, under patent\n      claims owned or controlled by the Licensor that are embodied in\n      the Original Work as furnished by the Licensor, for the duration\n      of the patents, to make, use, sell, offer for sale, have made, and\n      import the Original Work and Derivative Works.\n\n   3. *Grant of Source Code License.* The term \"Source Code\" means the\n      preferred form of the Original Work for making modifications to it\n      and all available documentation describing how to modify the\n      Original Work. Licensor agrees to provide a machine-readable copy\n      of the Source Code of the Original Work along with each copy of\n      the Original Work that Licensor distributes. Licensor reserves the\n      right to satisfy this obligation by placing a machine-readable\n      copy of the Source Code in an information repository reasonably\n      calculated to permit inexpensive and convenient access by You for\n      as long as Licensor continues to distribute the Original Work.\n\n   4. *Exclusions From License Grant.* Neither the names of Licensor,\n      nor the names of any contributors to the Original Work, nor any of\n      their trademarks or service marks, may be used to endorse or\n      promote products derived from this Original Work without express\n      prior permission of the Licensor. Except as expressly stated\n      herein, nothing in this License grants any license to Licensor's\n      trademarks, copyrights, patents, trade secrets or any other\n      intellectual property. No patent license is granted to make, use,\n      sell, offer for sale, have made, or import embodiments of any\n      patent claims other than the licensed claims defined in Section 2.\n      No license is granted to the trademarks of Licensor even if such\n      marks are included in the Original Work. Nothing in this License\n      shall be interpreted to prohibit Licensor from licensing under\n      terms different from this License any Original Work that Licensor\n      otherwise would have a right to license.\n\n   5. *External Deployment.* The term \"External Deployment\" means the\n      use, distribution, or communication of the Original Work or\n      Derivative Works in any way such that the Original Work or\n      Derivative Works may be used by anyone other than You, whether\n      those works are distributed or communicated to those persons or\n      made available as an application intended for use over a network.\n      As an express condition for the grants of license hereunder, You\n      must treat any External Deployment by You of the Original Work or\n      a Derivative Work as a distribution under section 1(c).\n\n   6. *Attribution Rights.* You must retain, in the Source Code of any\n      Derivative Works that You create, all copyright, patent, or\n      trademark notices from the Source Code of the Original Work, as\n      well as any notices of licensing and any descriptive text\n      identified therein as an \"Attribution Notice.\" You must cause the\n      Source Code for any Derivative Works that You create to carry a\n      prominent Attribution Notice reasonably calculated to inform\n      recipients that You have modified the Original Work.\n\n   7. *Warranty of Provenance and Disclaimer of Warranty.* Licensor\n      warrants that the copyright in and to the Original Work and the\n      patent rights granted herein by Licensor are owned by the Licensor\n      or are sublicensed to You under the terms of this License with the\n      permission of the contributor(s) of those copyrights and patent\n      rights. Except as expressly stated in the immediately preceding\n      sentence, the Original Work is provided under this License on an\n      \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied,\n      including, without limitation, the warranties of non-infringement,\n      merchantability or fitness for a particular purpose. THE ENTIRE\n      RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This\n      DISCLAIMER OF WARRANTY constitutes an essential part of this\n      License. No license to the Original Work is granted by this\n      License except under this disclaimer.\n\n   8. *Limitation of Liability.* Under no circumstances and under no\n      legal theory, whether in tort (including negligence), contract, or\n      otherwise, shall the Licensor be liable to anyone for any\n      indirect, special, incidental, or consequential damages of any\n      character arising as a result of this License or the use of the\n      Original Work including, without limitation, damages for loss of\n      goodwill, work stoppage, computer failure or malfunction, or any\n      and all other commercial damages or losses. This limitation of\n      liability shall not apply to the extent applicable law prohibits\n      such limitation.\n\n   9. *Acceptance and Termination.* If, at any time, You expressly\n      assented to this License, that assent indicates your clear and\n      irrevocable acceptance of this License and all of its terms and\n      conditions. If You distribute or communicate copies of the\n      Original Work or a Derivative Work, You must make a reasonable\n      effort under the circumstances to obtain the express assent of\n      recipients to the terms of this License. This License conditions\n      your rights to undertake the activities listed in Section 1,\n      including your right to create Derivative Works based upon the\n      Original Work, and doing so without honoring these terms and\n      conditions is prohibited by copyright law and international\n      treaty. Nothing in this License is intended to affect copyright\n      exceptions and limitations (including 'fair use' or 'fair\n      dealing'). This License shall terminate immediately and You may no\n      longer exercise any of the rights granted to You by this License\n      upon your failure to honor the conditions in Section 1(c).\n\n  10. *Termination for Patent Action.* This License shall terminate\n      automatically and You may no longer exercise any of the rights\n      granted to You by this License as of the date You commence an\n      action, including a cross-claim or counterclaim, against Licensor\n      or any licensee alleging that the Original Work infringes a\n      patent. This termination provision shall not apply for an action\n      alleging patent infringement by combinations of the Original Work\n      with other software or hardware.\n\n  11. *Jurisdiction, Venue and Governing Law.* Any action or suit\n      relating to this License may be brought only in the courts of a\n      jurisdiction wherein the Licensor resides or in which Licensor\n      conducts its primary business, and under the laws of that\n      jurisdiction excluding its conflict-of-law provisions. The\n      application of the United Nations Convention on Contracts for the\n      International Sale of Goods is expressly excluded. Any use of the\n      Original Work outside the scope of this License or after its\n      termination shall be subject to the requirements and penalties of\n      copyright or patent law in the appropriate jurisdiction. This\n      section shall survive the termination of this License.\n\n  12. *Attorneys' Fees.* In any action to enforce the terms of this\n      License or seeking damages relating thereto, the prevailing party\n      shall be entitled to recover its costs and expenses, including,\n      without limitation, reasonable attorneys' fees and costs incurred\n      in connection with such action, including any appeal of such\n      action. This section shall survive the termination of this License.\n\n  13. *Miscellaneous.* If any provision of this License is held to be\n      unenforceable, such provision shall be reformed only to the extent\n      necessary to make it enforceable.\n\n  14. *Definition of \"You\" in This License.* \"You\" throughout this\n      License, whether in upper or lower case, means an individual or a\n      legal entity exercising rights under, and complying with all of\n      the terms of, this License. For legal entities, \"You\" includes any\n      entity that controls, is controlled by, or is under common control\n      with you. For purposes of this definition, \"control\" means (i) the\n      power, direct or indirect, to cause the direction or management of\n      such entity, whether by contract or otherwise, or (ii) ownership\n      of fifty percent (50%) or more of the outstanding shares, or (iii)\n      beneficial ownership of such entity.\n\n  15. *Right to Use.* You may use the Original Work in all ways not\n      otherwise restricted or conditioned by this License or by law, and\n      Licensor promises not to interfere with or be responsible for such\n      uses by You.\n\n  16. *Modification of This License.* This License is Copyright © 2007\n      Zooko Wilcox-O'Hearn. Permission is granted to copy, distribute,\n      or communicate this License without modification. Nothing in this\n      License permits You to modify this License as applied to the\n      Original Work or to Derivative Works. However, You may modify the\n      text of this License and copy, distribute or communicate your\n      modified version (the \"Modified License\") and apply it to other\n      original works of authorship subject to the following conditions:\n      (i) You may not indicate in any way that your Modified License is\n      the \"Transitive Grace Period Public Licence\" or \"TGPPL\" and you\n      may not use those names in the name of your Modified License; and\n      (ii) You must replace the notice specified in the first paragraph\n      above with the notice \"Licensed under \" or with a notice of your\n      own that is not confusingly similar to the notice in this License."
}