{
  "key": "trendmicro-cl-1.0",
  "short_name": "Trend Micro Community License 1.0",
  "name": "Trend Micro Community License 1.0",
  "category": "Proprietary Free",
  "owner": "Trend Micro",
  "homepage_url": "https://github.com/trendmicro/cloud-risk-assessment-agent/blob/main/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-trendmicro-cl-1.0",
  "ignorable_copyrights": [
    "Copyright Meta Platforms, Inc."
  ],
  "ignorable_holders": [
    "Meta Platforms, Inc."
  ],
  "ignorable_urls": [
    "https://github.com/trendmicro/cloud-risk-assessment-agent/blob/main"
  ],
  "text": "Trend Micro Community License 1.0\n\nThis license agreement (the “Agreement”) contains the terms and conditions\nfor use of the TrendMicro Llama-TrendCybertron-8B-Instruct large language\nmodel (the “Model”) and related agent software (the “Software”) with which\nthese terms and conditions are provided. The Model is based on the Meta\nLlama 3 model. Meta Llama 3 is licensed under the Meta Llama 3 Community\nLicense, Copyright Meta Platforms, Inc. All Rights Reserved.\n\n“Licensee” means the entity entering into this Agreement.\n“Licensed Materials” means, collectively, the Model and the Software.\n“Licensor” means Trend Micro Incorporated.\n\nBy using or distributing any portion or element of the Licensed Materials, you\nagree to be bound by this Agreement.\n\n1. License Rights and Redistribution.\n   a. Grant of Rights. Licensor hereby grants you a non-exclusive, worldwide,\n      non-transferable and royalty-free limited license to use, reproduce, modify\n      and distribute the Licensed Materials, but not in connection with any\n      product or service that competes with the Licensed Materials or any product\n      or service of Licensor. Products and services compete even when provided\n      free of charge. If you market a product as a practical substitute for a\n      product or service, it competes with that product or service.\n   b. Redistribution and Use.\n      i. If you distribute or make available to others the Licensed Materials, or\n         offer a product or service that uses the Licensed Materials, you (x) must\n         provide such others with copy of this Agreement; (y) must prominently\n         display “Powered by Trend Micro’s TrendMicro Llama-TrendCybertron-8B-\n         Instruct” on the user interface, splash screen, dashboard, or similar\n         product documentation; and (z) hereby consent to Licensor listing your\n         name and product on its adopter’s web page.\n      ii. You must retain, in all copies of the Licensed Materials that you make or\n          distribute, a copy of this Agreement, or the following statement: “These\n          materials are made available under the Trend Micro Community License\n          1.0 https://github.com/trendmicro/cloud-risk-assessment-agent/blob/main\n          /Trend Micro Community License 1.0.pdf” If you modify the\n          Licensed Materials, you must also indicate that you have done so.\n      iii. Your use of the Licensed Materials must comply with applicable laws and\n           regulations, and, for the benefit of Meta Platforms Inc. and its\n           affiliates, and Licensor, comply with the terms of the Llama 3 Community\n           License.\n      iv. The Licensed Materials are intended for security purposes. However, you\n          must not make any statement to any other party regarding the Licensed\n          Materials, or any products or services you provide using the Licensed\n          Materials, that would constitute a warranty by Licensor, or that would\n          reasonably be considered a warranty by Licensor.\n\n2. Disclaimer of Warranty. THE LICENSED MATERIALS AND ANY OUTPUT\n   THEREFROM ARE PROVIDED ON AN “AS IS” BASIS, WITHOUT WARRANTIES\n   OF ANY KIND, AND LICENSOR DISCLAIMS ALL WARRANTIES OF ANY KIND,\n   BOTH EXPRESS AND IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY\n   WARRANTIES OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, OR\n   FITNESS FOR A PARTICULAR PURPOSE. YOU ARE SOLELY RESPONSIBLE\n   FOR DETERMINING THE APPROPRIATENESS OF USING OR REDISTRIBUTING\n   THE LICENSED MATERIALS AND ASSUME ANY RISKS ASSOCIATED WITH\n   YOUR USE OF THE LICENSED MATERIALS AND ANY OUTPUT AND RESULTS.\n   If this provision is unenforceable under applicable law, the licenses granted to\n   you hereunder are void.\n\n3. Limitation of Liability. IN NO EVENT WILL LICENSOR BE LIABLE UNDER ANY\n   THEORY OF LIABILITY, WHETHER IN CONTRACT, TORT, NEGLIGENCE,\n   PRODUCTS LIABILITY, OR OTHERWISE, ARISING OUT OF THIS AGREEMENT,\n   FOR ANY LOST PROFITS OR ANY INDIRECT, SPECIAL, CONSEQUENTIAL,\n   INCIDENTAL, EXEMPLARY OR PUNITIVE DAMAGES, EVEN IF LICENSOR OR\n   ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF ANY OF THE\n   FOREGOING. If this provision is unenforceable under applicable law, the\n   licenses granted to you hereunder are void.\n\n4. Intellectual Property.\n   a. Licensor hereby reserves all rights not expressly granted in this Agreement.\n      No trademark licenses are granted under this Agreement, except to you as\n      necessary to comply with Section 1.b.\n   b. If you bring litigation or other claims against Licensor alleging that the\n      Licensed Materials constitutes infringement of intellectual property rights,\n      then any licenses granted to you under this Agreement shall terminate\n      immediately.\n\n5. Term and Termination. The term of this Agreement will commence upon your\n   first access to the Licensed Materials and will continue unless and until you\n   violate its terms, at which point your rights hereunder will terminate\n   automatically. Sections 2, 3, 4 and 6 will survive any termination of this\n   Agreement.\n\n6. Governing Law and Jurisdiction. This Agreement will be governed and\n   construed under the laws of the State of California without regard to choice\n   of law principles, and the UN Convention on Contracts for the International\n   Sale of Goods does not apply to this Agreement. The courts of California shall\n   have exclusive jurisdiction of any dispute arising out of this Agreement."
}