{
  "key": "ubdl",
  "short_name": "Unmodified Binary Distribution Licence",
  "name": "Unmodified Binary Distribution Licence Exception",
  "category": "Copyleft Limited",
  "owner": "iPXE",
  "homepage_url": "https://github.com/ipxe/ipxe/blob/master/COPYING.UBDL",
  "notes": "this is a rare license that extends extra persmission on top of the GPL",
  "is_exception": true,
  "spdx_license_key": "UBDL-exception",
  "other_spdx_license_keys": [
    "LicenseRef-scancode-ubdl"
  ],
  "text_urls": [
    "https://git.ipxe.org/ipxe.git/blob_plain/HEAD:/COPYING.UBDL"
  ],
  "other_urls": [
    "https://github.com/ipxe/ipxe/blob/master/COPYING.UBDL"
  ],
  "text": "UNMODIFIED BINARY DISTRIBUTION LICENCE\n\n\nPREAMBLE\n\nThe GNU General Public License provides a legal guarantee that\nsoftware covered by it remains free (in the sense of freedom, not\nprice).  It achieves this guarantee by imposing obligations on anyone\nwho chooses to distribute the software.\n\nSome of these obligations may be seen as unnecessarily burdensome.  In\nparticular, when the source code for the software is already publicly\nand freely available, there is minimal value in imposing upon each\ndistributor the obligation to provide the complete source code (or an\nequivalent written offer to provide the complete source code).\n\nThis Licence allows for the distribution of unmodified binaries built\nfrom publicly available source code, without imposing the obligations\nof the GNU General Public License upon anyone who chooses to\ndistribute only the unmodified binaries built from that source code.\n\nThe extra permissions granted by this Licence apply only to unmodified\nbinaries built from source code which has already been made available\nto the public in accordance with the terms of the GNU General Public\nLicence.  Nothing in this Licence allows for the creation of\nclosed-source modified versions of the Program.  Any modified versions\nof the Program are subject to the usual terms and conditions of the\nGNU General Public License.\n\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\nThis Licence applies to any Program or other work which contains a\nnotice placed by the copyright holder saying it may be distributed\nunder the terms of this Unmodified Binary Distribution Licence.  All\nterms used in the text of this Licence are to be interpreted as they\nare used in version 2 of the GNU General Public License as published\nby the Free Software Foundation.\n\nIf you have made this Program available to the public in both source\ncode and executable form in accordance with the terms of the GNU\nGeneral Public License as published by the Free Software Foundation;\neither version 2 of the License, or (at your option) any later\nversion, then you are hereby granted an additional permission to use,\ncopy, and distribute the unmodified executable form of this Program\n(the \"Unmodified Binary\") without restriction, including the right to\npermit persons to whom the Unmodified Binary is furnished to do\nlikewise, subject to the following conditions:\n\n- when started running, the Program must display an announcement which\n  includes the details of your existing publication of the Program\n  made in accordance with the terms of the GNU General Public License.\n  For example, the Program could display the URL of the publicly\n  available source code from which the Unmodified Binary was built.\n\n- when exercising your right to grant permissions under this Licence,\n  you do not need to refer directly to the text of this Licence, but\n  you may not grant permissions beyond those granted to you by this\n  Licence."
}