{
  "key": "unicode-dfs-2015",
  "short_name": "Unicode DFS 2015",
  "name": "Unicode License Agreement - Data Files and Software (2015)",
  "category": "Permissive",
  "owner": "Unicode Consortium",
  "homepage_url": "https://web.archive.org/web/20151224134844/http://unicode.org/copyright.html",
  "spdx_license_key": "Unicode-DFS-2015",
  "other_urls": [
    "https://web.archive.org/web/20151224134844/http://unicode.org/copyright.html"
  ],
  "minimum_coverage": 70,
  "ignorable_copyrights": [
    "Copyright (c) 1991-2015 Unicode, Inc."
  ],
  "ignorable_holders": [
    "Unicode, Inc."
  ],
  "ignorable_urls": [
    "http://www.unicode.org/Public",
    "http://www.unicode.org/cldr/data",
    "http://www.unicode.org/copyright.html",
    "http://www.unicode.org/reports"
  ],
  "text": "UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n\nUnicode Data Files include all data files under the directories\nhttp://www.unicode.org/Public/, http://www.unicode.org/reports/, and\nhttp://www.unicode.org/cldr/data/. Unicode Data Files do not include PDF\nonline code charts under the directory http://www.unicode.org/Public/.\nSoftware includes any source code published in the Unicode Standard or\nunder the directories http://www.unicode.org/Public/,\nhttp://www.unicode.org/reports/, and http://www.unicode.org/cldr/data/.\n\nNOTICE TO USER: Carefully read the following legal agreement. BY\nDOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S DATA\nFILES (\"DATA FILES\"), AND/OR SOFTWARE (\"SOFTWARE\"), YOU UNEQUIVOCALLY\nACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE TERMS AND CONDITIONS OF\nTHIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY,\nDISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n\nCOPYRIGHT AND PERMISSION NOTICE\n\nCopyright © 1991-2015 Unicode, Inc. All rights reserved. Distributed\nunder the Terms of Use in http://www.unicode.org/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of the Unicode data files and any associated documentation (the\n\"Data Files\") or Unicode software and any associated documentation (the\n\"Software\") to deal in the Data Files or Software without restriction,\nincluding without limitation the rights to use, copy, modify, merge,\npublish, distribute, and/or sell copies of the Data Files or Software,\nand to permit persons to whom the Data Files or Software are furnished\nto do so, provided that\n\n(a) this copyright and permission notice appear with all copies of\nthe Data Files or Software,\n\n(b) this copyright and permission notice appear in associated\ndocumentation, and\n\n(c) there is clear notice in each modified Data File or in the\nSoftware as well as in the documentation associated with the Data\nFile(s) or Software that the data or software has been modified.\n\nTHE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF\nANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT\nHOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR\nANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER\nRESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF\nCONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN\nCONNECTION WITH THE USE OR PERFORMANCE OF THE DATA FILES OR SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall\nnot be used in advertising or otherwise to promote the sale, use or\nother dealings in these Data Files or Software without prior written\nauthorization of the copyright holder."
}