{
  "key": "unicode-tou",
  "short_name": "Unicode Terms of Use",
  "name": "Unicode Terms of Use",
  "category": "Proprietary Free",
  "owner": "Unicode Consortium",
  "homepage_url": "http://www.unicode.org/copyright.html",
  "spdx_license_key": "Unicode-TOU",
  "ignorable_copyrights": [
    "Copyright (c) Unicode, Inc."
  ],
  "ignorable_holders": [
    "Unicode, Inc."
  ],
  "text": "Unicode Terms of Use\n\nFor the general privacy policy governing access to this site, see the\nUnicode Privacy Policy. For trademark usage, see the Unicode® Consortium\nName and Trademark Usage Policy.\n\nA. Unicode Copyright.\n\n1. Copyright ©  Unicode, Inc. All rights reserved.\n\n2. Certain documents and files on this website contain a legend\nindicating that \"Modification is permitted.\" Any person is hereby\nauthorized, without fee, to modify such documents and files to create\nderivative works conforming to the Unicode® Standard, subject to Terms\nand Conditions herein.\n\n3. Any person is hereby authorized, without fee, to view, use,\nreproduce, and distribute all documents and files solely for\ninformational purposes in the creation of products supporting the\nUnicode Standard, subject to the Terms and Conditions herein.\n\n4. Further specifications of rights and restrictions pertaining to the\nuse of the particular set of data files known as the \"Unicode Character\nDatabase\" can be found in Exhibit 1.\n\n5. Each version of the Unicode Standard has further specifications of\nrights and restrictions of use. For the book editions (Unicode 5.0 and\nearlier), these are found on the back of the title page. The online code\ncharts carry specific restrictions. All other files, including online\ndocumentation of the core specification for Unicode 6.0 and later, are\ncovered under these general Terms of Use.\n\n6. No license is granted to \"mirror\" the Unicode website where a fee is\ncharged for access to the \"mirror\" site.\n\n7. Modification is not permitted with respect to this document. All\ncopies of this document must be verbatim.\n\nB. Restricted Rights Legend. Any technical data or software which is\nlicensed to the United States of America, its agencies and/or\ninstrumentalities under this Agreement is commercial technical data or\ncommercial computer software developed exclusively at private expense as\ndefined in FAR 2.101, or DFARS 252.227-7014 (June 1995), as applicable.\nFor technical data, use, duplication, or disclosure by the Government is\nsubject to restrictions as set forth in DFARS 202.227-7015 Technical\nData, Commercial and Items (Nov 1995) and this Agreement. For Software,\nin accordance with FAR 12-212 or DFARS 227-7202, as applicable, use,\nduplication or disclosure by the Government is subject to the\nrestrictions set forth in this Agreement.\n\nC. Warranties and Disclaimers.\n\n1. This publication and/or website may include technical or\ntypographical errors or other inaccuracies . Changes are periodically\nadded to the information herein; these changes will be incorporated in\nnew editions of the publication and/or website. Unicode may make\nimprovements and/or changes in the product(s) and/or program(s)\ndescribed in this publication and/or website at any time.\n\n2. If this file has been purchased on magnetic or optical media from\nUnicode, Inc. the sole and exclusive remedy for any claim will be\nexchange of the defective media within ninety (90) days of original\npurchase.\n\n3. EXCEPT AS PROVIDED IN SECTION C.2, THIS PUBLICATION AND/OR SOFTWARE\nIS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND EITHER EXPRESS,\nIMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.\nUNICODE AND ITS LICENSORS ASSUME NO RESPONSIBILITY FOR ERRORS OR\nOMISSIONS IN THIS PUBLICATION AND/OR SOFTWARE OR OTHER DOCUMENTS WHICH\nARE REFERENCED BY OR LINKED TO THIS PUBLICATION OR THE UNICODE WEBSITE.\n\nD. Waiver of Damages. In no event shall Unicode or its licensors be\nliable for any special, incidental, indirect or consequential damages of\nany kind, or any damages whatsoever, whether or not Unicode was advised\nof the possibility of the damage, including, without limitation, those\nresulting from the following: loss of use, data or profits, in\nconnection with the use, modification or distribution of this\ninformation or its derivatives.\n\nE. Trademarks & Logos.\n\n1. The Unicode Word Mark and the Unicode Logo are trademarks of Unicode,\nInc. \"The Unicode Consortium\" and \"Unicode, Inc.\" are trade names of\nUnicode, Inc. Use of the information and materials found on this website\nindicates your acknowledgement of Unicode, Inc.’s exclusive worldwide\nrights in the Unicode Word Mark, the Unicode Logo, and the Unicode trade\nnames.\n\n2. The Unicode Consortium Name and Trademark Usage Policy (\"Trademark\nPolicy\") are incorporated herein by reference and you agree to abide by\nthe provisions of the Trademark Policy, which may be changed from time\nto time in the sole discretion of Unicode, Inc.\n\n3. All third party trademarks referenced herein are the property of\ntheir respective owners.\n\nF. Miscellaneous.\n\n1. Jurisdiction and Venue. This server is operated from a location in\nthe State of California, United States of America. Unicode makes no\nrepresentation that the materials are appropriate for use in other\nlocations. If you access this server from other locations, you are\nresponsible for compliance with local laws. This Agreement, all use of\nthis site and any claims and damages resulting from use of this site are\ngoverned solely by the laws of the State of California without regard to\nany principles which would apply the laws of a different jurisdiction.\nThe user agrees that any disputes regarding this site shall be resolved\nsolely in the courts located in Santa Clara County, California. The user\nagrees said courts have personal jurisdiction and agree to waive any\nright to transfer the dispute to any other forum.\n\n2. Modification by Unicode Unicode shall have the right to modify this\nAgreement at any time by posting it to this site. The user may not\nassign any part of this Agreement without Unicode’s prior written\nconsent.\n\n3. Taxes. The user agrees to pay any taxes arising from access to this\nwebsite or use of the information herein, except for those based on\nUnicode’s net income.\n\n4. Severability. If any provision of this Agreement is declared invalid\nor unenforceable, the remaining provisions of this Agreement shall\nremain in effect.\n\n5. Entire Agreement. This Agreement constitutes the entire agreement\nbetween the parties."
}