{
  "key": "universal-foss-exception-1.0",
  "short_name": "Universal FOSS Exception v1.0",
  "name": "Universal FOSS Exception v1.0",
  "category": "Copyleft Limited",
  "owner": "Oracle Corporation",
  "homepage_url": "https://oss.oracle.com/licenses/universal-foss-exception/",
  "is_exception": true,
  "spdx_license_key": "Universal-FOSS-exception-1.0",
  "other_urls": [
    "https://oss.oracle.com/licenses/universal-foss-exception/"
  ],
  "text": "The Universal FOSS Exception, Version 1.0\n\nIn addition to the rights set forth in the other license(s) included in the\ndistribution for this software, data, and/or documentation (collectively the\n\"Software,\" and such licenses collectively with this additional permission the\n\"Software License\"), the copyright holders wish to facilitate interoperability\nwith other software, data, and/or documentation distributed with complete\ncorresponding source under a license that is OSI-approved and/or categorized by\nthe FSF as free (collectively \"Other FOSS\"). We therefore hereby grant the\nfollowing additional permission with respect to the use and distribution of the\nSoftware with Other FOSS, and the constants, function signatures, data\nstructures and other invocation methods used to run or interact with each of\nthem (as to each, such software's \"Interfaces\"):\n\n   (i) The Software's Interfaces may, to the extent permitted by the license of\n   the Other FOSS, be copied into, used and distributed in the Other FOSS in\n   order to enable interoperability, without requiring a change to the license\n   of the Other FOSS other than as to any Interfaces of the Software embedded\n   therein. The Software's Interfaces remain at all times under the Software\n   License, including without limitation as used in the Other FOSS (which upon\n   any such use also then contains a portion of the Software under the Software\n   License).\n\n   (ii) The Other FOSS's Interfaces may, to the extent permitted by the license\n   of the Other FOSS, be copied into, used and distributed in the Software in\n   order to enable interoperability, without requiring that such Interfaces be\n   licensed under the terms of the Software License or otherwise altering their\n   original terms, if this does not require any portion of the Software other\n   than such Interfaces to be licensed under the terms other than the Software\n   License.\n\n   (iii) If only Interfaces and no other code is copied between the Software and\n   the Other FOSS in either direction, the use and/or distribution of the\n   Software with the Other FOSS shall not be deemed to require that the Other\n   FOSS be licensed under the license of the Software, other than as to any\n   Interfaces of the Software copied into the Other FOSS. This includes, by way\n   of example and without limitation, statically or dynamically linking the\n   Software together with Other FOSS after enabling interoperability using the\n   Interfaces of one or both, and distributing the resulting combination under\n   different licenses for the respective portions thereof.\n\nFor avoidance of doubt, a license which is OSI-approved or categorized by the\nFSF as free, includes, for the purpose of this permission, such licenses with\nadditional permissions, and any license that has previously been so-approved or\ncategorized as free, even if now deprecated or otherwise no longer recognized as\napproved or free. Nothing in this additional permission grants any right to\ndistribute any portion of the Software on terms other than those of the Software\nLicense or grants any additional permission of any kind for use or distribution\nof the Software in conjunction with software other than Other FOSS."
}