{
  "key": "verisign",
  "short_name": "VeriSign License",
  "name": "VeriSign License",
  "category": "Proprietary Free",
  "owner": "VeriSign, Inc.",
  "spdx_license_key": "LicenseRef-scancode-verisign",
  "other_urls": [
    "http://www.verisign.com/repository/CPS"
  ],
  "ignorable_copyrights": [
    "Copyright 1995 VeriSign, Inc."
  ],
  "ignorable_holders": [
    "VeriSign, Inc."
  ],
  "ignorable_urls": [
    "http://www.verisign.com/repository/CPS"
  ],
  "text": "VERISIGN, INC. LICENSE AGREEMENT\n\nIMPORTANT - READ CAREFULLY BEFORE DOWNLOADING OR INSTALLING\n\nThis file lists the VeriSign, Inc. (\"VeriSign\") Class 1 Certification\nAuthority Distinguished Name and Public Key information (the \"Information\").\nBY DOWNLOADING OR INSTALLING THE INFORMATION, YOU INDICATE YOUR ACCEPTANCE\nOF THIS LICENSE.  IF YOU DO NOT AGREE TO ALL OF THE TERMS OF THIS LICENSE,\nDO NOT DOWNLOAD OR USE THE INFORMATION.\n\n1.   License and Limitations.  VeriSign grants you a royalty-free license to\nuse, copy and distribute the Information or any compiled derivative of it,\nsubject to the terms of this License.  You must reproduce and include this\nentire License and VeriSign's copyright notices and trademarks on each copy\nof the Information and compiled derivative of it.  VeriSign retains all\nownership of the Information and all intellectual property rights therein.\n\n2.   No Warranty.  VeriSign provides the Information \"AS IS\" and makes no\nwarranties, expressed or implied, about the Information or the use thereof.\nWITHOUT LIMITATION, VERISIGN DISCLAIMS ANY IMPLIED WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT OF\nTHIRD PARTY RIGHTS.\n\n3.   Limitation of Liability.  VeriSign's entire liability to you under this\nLicense shall be limited to a maximum of $10.00.  IN NO EVENT SHALL VERISIGN\nBE LIABLE TO YOU OR TO ANY OTHER PERSON FOR ANY SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE\nINFORMATION.\n\n4.   General.  This License is governed by the laws of the State of California\nand is the complete and exclusive statement of your agreement with VeriSign\nwith respect to the Information.  You acknowledge that the Information is\nbeing provided to you without charge and that this is reflected in the\nabsence of warranties and limitations of liability in this License.\n\n5.   NOTICE: THE USE OF THIS VERISIGN CERTIFICATE IS SUBJECT TO THE\nVERISIGN CERTIFICATION PRACTICE STATEMENT LOCATED AT\n     http://www.verisign.com/repository/CPS\nOR AVAILABLE FROM:\n   VeriSign, Inc.\n   2593 Coast Ave.\n   Mountain View, CA 94043\n   (415) 961-7500\n\nCode Fragments and ASN.1 discussion are taken from the PKCS standards\npublished by RSA Data Security, Inc.\n\nCopyright 1995 VeriSign, Inc. All Rights Reserved."
}