{
  "key": "vicomsoft-software",
  "short_name": "Vicomsoft Software License",
  "name": "Vicomsoft Software License",
  "category": "Commercial",
  "owner": "Vicomsoft Ltd.",
  "homepage_url": "http://www.vicomsoft.com/",
  "spdx_license_key": "LicenseRef-scancode-vicomsoft-software",
  "text": "VICOMSOFT SOFTWARE LICENSE\nPlease read this document carefully before installing the \nVicomsoft software. By installing the software you agree \nto become contractually bound by the terms of this licence. \n\nDEMONSTRATION SOFTWARE\nDemonstration software is provided for evaluation purposes \nonly, for the period stated on the download site or in \naccompanying literature. If not stated then the demonstration\nperiod is 30 days from the time the software is first run.\n\nThe enclosed computer program(s) (\"Software\") is licensed, not \nsold, to you by Vicomsoft for use only under the following terms \nand Vicomsoft reserves any rights not expressly granted to you. \n\nYou own the disk on which any Software is recorded, but Vicomsoft \nretains ownership of all copies of the Software itself.\n\nLICENSE.\nThis License allows you to:\n\n(a)\tHave the Software installed only on a single \n\tcomputer at a time. Copies on more than one computer \n\tshall be deemed to be illegal copies and are in \n\tbreach of both copyright and this License.\n\n(b) \tTotally remove a copy from the computer on which it \n\tis installed and install it on an alternative \n\tcomputer provided once again that the Software shall \n\tnot at any time be installed on more than one \n\tcomputer at any one time.\n\n(c) \tExecute the Software from a common disk shared by \n\tmultiple CPUs provided one authorized copy of the \n\tSoftware has been licensed from Vicomsoft for each \n\tCPU executing the Software.\n\n(d) \tMake one copy of the Software in machine readable \n\tform; provided that such copy or the original may \n\tbe used solely for backup purposes. The Software is \n\tprotected by copyright law. As an express condition \n\tof this License, you must reproduce on the backup \n\tcopy the Vicomsoft copyright notice and any other \n\tproprietary legends on the original supplied by \n\tVicomsoft. \n\nRESTRICTIONS.\n(a)\tYou may NOT distribute copies of the Software to others. \n\n(b)\tThe Software contains trade secrets and to protect them \n\tyou may NOT decompile, reverse engineer, disassemble \n\tor otherwise reduce the Software to human readable form.\n\n(c)\tYou may NOT modify, adapt, translate, rent, lease, loan, \n\tresell for profit, distribute, network, or create \n\tderivative works based on the Software or any part thereof.\n\n\nTERMINATION. \nThis License is effective until terminated. The License will \nterminate immediately without notice from Vicomsoft if \nyou fail to comply with any of its provisions. Upon termination \nyou must destroy the Software and all copies thereof, and you \nmay terminate this License at any time by so doing.\n\n\nWARRANTY DISCLAIMER. \nThis Software and the accompanying written materials are licensed \n\"as is\". The full text of the warranty is provided in the User \nManual and in no event will Vicomsoft, or its developers, \nDirectors, Officers, Employees be liable to you for any \nconsequential, incidental, or indirect damage (including damages \nfor loss of business profits, business interruption, loss of \nbusiness information, and the like) arising out of the use or \ninability to use the Software or accompanying written materials \neven if Vicomsoft or an authorized Vicomsoft representative has been \nadvised of the possibility of such damages. \nVicomsoft does not warrant that the Software will function \nproperly in your particular environment. Vicomsoft's liability \nto you for actual damages for any cause whatsoever and regardless of \nthe form of the action will be limited to the money paid for the \nSoftware that caused the damages.\n\n\nGENERAL. \nThis License will be construed under the laws of England."
}