{
  "key": "vita-nuova-liberal",
  "short_name": "Vita Nuova Liberal Source License",
  "name": "Vita Nuova Liberal Source License",
  "category": "Copyleft",
  "owner": "Vita Nuova",
  "homepage_url": "https://web.archive.org/web/20070227005341/https://www.vitanuova.com/inferno/liblicence.txt",
  "spdx_license_key": "LicenseRef-scancode-vita-nuova-liberal",
  "text_urls": [
    "https://fedoraproject.org/wiki/Licensing/Vita_Nuova_Liberal_Source_License"
  ],
  "other_urls": [
    "https://github.com/search?q=\"VITA+NUOVA+LIBERAL+SOURCE+LICENCE\"&type=code",
    "https://github.com/dsummerfield/acme-sac/blob/a37310031957f93b176f483b33c10095d341af86/LICENCE#L1"
  ],
  "ignorable_urls": [
    "http://www.vitanuova.com/"
  ],
  "text": "VITA NUOVA LIBERAL SOURCE LICENCE\n                        29 May 2003\nIMPORTANT NOTICE - READ CAREFULLY:  This  Licence  Agreement\n(``LICENCE'')  is  a legal agreement between you as an indi-\nvidual person or organisation (``YOU'') and Vita Nuova Hold-\nings Limited (``VITA NUOVA'') (having an office at 3 Innova-\ntion Close, York Science Park, University Road, York England\nYO10  5ZF),  for  all or any portion of the software product\naccompanying this LICENCE, which includes computer  software\nin  binary and source code form, other information and docu-\nmentation (``LICENSED SOFTWARE''), where a  notice  declares\nthat this LICENCE applies.\nBy copying (except for the sole purpose of making  a  backup\ncopy), using, modifying, or distributing all or part of YOUR\ncopy of the LICENSED SOFTWARE YOU accept all the  terms  and\nconditions  of this LICENCE.  Distribution includes allowing\nothers to use YOUR copy directly or indirectly (eg,  over  a\ncomputer network).\nYOU may cancel this LICENCE without explanation  or  penalty\nby  ceasing  to copy, use, modify or distribute the LICENSED\nSOFTWARE.\nSubject to the restrictions and conditions in Clause 2 below\nand  to third party intellectual property claims YOU MAY for\ncommercial  or  non-commercial  purposes  on  a  world-wide,\nroyalty-free,  non-exclusive and perpetual basis (subject to\nClause 3):\n1.1.  make ADAPTATIONS of the LICENSED SOFTWARE in binary or\n      source  code  form.   ADAPTATIONS  means  any work (ie\n      code, document, etc) based on the LICENSED SOFTWARE or\n      any part of it, for example (i) any work incorporating\n      the LICENSED SOFTWARE or any part of it, (ii) any work\n      incorporating  any modified form of the LICENSED SOFT-\n      WARE or any part of it (eg where the LICENSED SOFTWARE\n      is  rewritten in a different computer language or con-\n      verted to operate on a  different  type  of  CPU),  or\n      (iii)  any  work  otherwise  covered  by  any  of VITA\n      NUOVA's or any  third  party's  intellectual  property\n      rights in the LICENSED SOFTWARE.\n1.2.  use, copy and distribute the LICENSED SOFTWARE  and/or\n      ADAPTATIONS  in  binary  or  source code form provided\n      that each copy of the LICENSED  SOFTWARE  and  ADAPTA-\n      TIONS  shall  retain  without  change  a  copy of this\n      LICENCE and all notices related to it and  retain  all\n      existing  copyright  notices in files and directories.\n      Where non-trivial extracts are taken from the LICENSED\n      SOFTWARE  YOU  must ensure the extracts contain appro-\n      priate copyright notices based on the  existing  copy-\n      right  notices pertaining to the files and/or directo-\n      ries from which the extracts were  taken  including  a\n      reference to this LICENCE.\n1.3.  choose to offer and to make a charge for support, war-\n      ranties,  indemnity  or liability obligations (``Addi-\n      tional Terms'') provided  always  that  YOU  may  only\n      offer  such Additional Terms on YOUR own behalf and as\n      YOUR exclusive responsibility and  not  on  behalf  of\n      VITA  NUOVA.   If  YOU offer Additional Terms YOU must\n      offer them under an agreement  of  YOUR  own  separate\n      from  this  one.   YOU  must obtain YOUR sub-licensees\n      agreement that any Additional Terms are offered by YOU\n      alone  and  YOU hereby agree to indemnify, defend hold\n      harmless VITA NUOVA its servants and  agents  for  any\n      liability  arising  directly or indirectly as a result\n      of any such Additional Terms.\n      YOU shall have the right to  determine  the  form  and\n      content of any non-exclusive sub-licence provided that\n      YOU are in compliance with the terms of  this  licence\n      and that YOUR sub-licence does not attempt to limit or\n      change the recipient's rights in the LICENSED SOFTWARE\n      and  licence  conditions  from those set forth in this\n      LICENCE in this Clause 1 and in Clause 2.  YOUR  right\n      to  grant  such  sub-licence  is always subject to the\n      terms of this LICENCE with VITA NUOVA.  YOU agree that\n      in  the event of any conflict or inconsistency between\n      any provision of  this  LICENCE  and  any  sub-licence\n      granted under this Clause, this LICENCE shall prevail.\nAll rights not specifically and expressly granted under this\nLICENCE  are reserved by VITA NUOVA.  Notwithstanding Clause\n1 above:\n2.1.  If YOU distribute the LICENSED SOFTWARE or any ADAPTA-\n      TIONS  of  it  to any other party in any form, with or\n      without fee, YOU MUST make the  complete  source  code\n      including  any  ADAPTATIONS available to that party in\n      any mutually convenient form and license its use, mod-\n      ification,  copying, and redistribution under terms no\n      more restrictive than  those  of  Clause  1  and  this\n      Clause 2 of this LICENCE.\n2.2.  If YOU use the LICENSED SOFTWARE or any ADAPTATIONS of\n      it  as  the  basis  or as supporting software for YOUR\n      software (``APPLICATION'') and YOU make  the  APPLICA-\n      TION available for use by any other party in any form,\n      with or without fee, YOU MUST make the complete source\n      code of the APPLICATION available to that party in any\n      mutually convenient form and license its use,  modifi-\n      cation,  copying,  and  redistribution  under terms no\n      more restrictive than  those  of  Clause  1  and  this\n      Clause 2 of this LICENCE.\n3.1.  This LICENCE is effective until  terminated.   Without\n      prejudice  to  any  other  rights,  VITA NUOVA has the\n      option to terminate this LICENCE by written notice  if\n      YOU  fail to comply with any term or condition of this\n      LICENCE.  Further, YOU agree upon any  termination  of\n      this  LICENCE to cease to use it in any manner whatso-\n      ever.\n3.2.  All sub-licences of  the  LICENSED  SOFTWARE  and  any\n      ADAPTATIONS  validly granted to third parties pursuant\n      to the terms of this LICENCE shall survive any  termi-\n      nation  of this LICENCE.  Those terms of this LICENCE,\n      which by their nature survive the termination of  this\n      LICENCE, shall remain in effect beyond any termination\n      of this LICENCE.\n4.1.  The LICENSED SOFTWARE is protected  by  copyright  law\n      and  international treaty provisions.  YOU acknowledge\n      that all rights, title  and  interest  (including  but\n      without  limitation  all intellectual property rights)\n      in the LICENSED SOFTWARE  will  remain  the  exclusive\n      property  of VITA NUOVA or its suppliers, and YOU will\n      not acquire any rights to the LICENSED SOFTWARE  other\n      than  those  expressly  set out in this LICENCE.  VITA\n      NUOVA  and  its  suppliers  reserve  all  rights   not\n      expressly  granted  to  YOU, and no other licences are\n      granted or implied.\n4.2.  Subject to Clause 4.1 above, YOU shall own all  rights\n      title and interest in any intellectual property rights\n      resulting from YOUR creation of ADAPTATIONS and  addi-\n      tions to the LICENSED SOFTWARE.\n5.1.  TO THE MAXIMUM EXTENT PERMITTED BY THE APPLICABLE  LAW\n      VITA  NUOVA  PROVIDES THE LICENSED SOFTWARE ON AN ``AS\n      IS'' BASIS AND DOES NOT WARRANT OR REPRESENT THAT  THE\n      LICENSED  SOFTWARE WILL MEET YOUR REQUIREMENTS OR THAT\n      THE OPERATION OF THE LICENSED SOFTWARE WILL  BE  UNIN-\n      TERRUPTED   OR  ERROR-FREE  OR  THAT  DEFECTS  IN  THE\n      LICENSED SOFTWARE WILL  BE  CORRECTED.   THE  LICENSED\n      SOFTWARE  MAY CONTAIN IN WHOLE OR IN PART PRE-RELEASE,\n      UNTESTED OR NOT FULLY TESTED SOFTWARE.  YOU  EXPRESSLY\n      AGREE  THAT  THE  USE  OF THE LICENSED SOFTWARE OR ANY\n      PORTION THEREOF IS AT YOUR SOLE AND ENTIRE RISK.   THE\n      LICENSED SOFTWARE IS PROVIDED WITHOUT UPGRADES OR SUP-\n      PORT OF ANY KIND AND VITA NUOVA AND ITS SUPPLIERS DIS-\n      CLAIM  ALL  WARRANTIES,  EITHER  EXPRESS  OR  IMPLIED,\n      INCLUDING BUT NOT LIMITED TO IMPLIED WARRANTIES AND/OR\n      CONDITIONS  OF  MERCHANTABILITY,  SATISFACTORY QUALITY\n      AND  FITNESS  FOR  A  PARTICULAR  PURPOSE   AND   NON-\n      INFRINGEMENT OF THIRD PARTY RIGHTS, WITH REGARD TO THE\n      LICENSED SOFTWARE AND THE ACCOMPANYING WRITTEN MATERI-\n      ALS.\n5.2.  NOTHING IN THIS LICENCE LIMITS VITA NUOVA'S  LIABILITY\n      TO  YOU  IN  THE  EVENT  OF  DEATH  OR PERSONAL INJURY\n      RESULTING FROM THE NEGLIGENCE  OR  WILFUL  DEFAULT  OF\n      VITA NUOVA.\n6.1.  TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW,  IN\n      NO  EVENT  SHALL VITA NUOVA OR ITS SUPPLIERS BE LIABLE\n      FOR ANY DAMAGES OR LOSS WHATSOEVER INCLUDING  BUT  NOT\n      LIMITED  TO  DIRECT,  INDIRECT, SPECIAL, CONSEQUENTIAL\n      LOSS OR DAMAGE, AND LOSS OF BUSINESS  AND/OR  PROFITS,\n      LOSS  OF  USE, BUSINESS INTERRUPTION, LOSS OF BUSINESS\n      INFORMATION OR DATA, OR ANY OTHER FINANCIAL LOSS ARIS-\n      ING  OUT  OF  THE  USE  OF OR THE INABILITY TO USE THE\n      LICENSED SOFTWARE AND/OR ANY ADAPTATIONS, EVEN IF VITA\n      NUOVA HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAM-\n      AGES.  IN ANY CASE, VITA NUOVA'S  AND  ITS  SUPPLIERS'\n      ENTIRE  LIABILITY  UNDER THIS LICENCE SHALL BE LIMITED\n      TO THE AMOUNT ACTUALLY PAID BY YOU  FOR  THE  LICENSED\n      SOFTWARE.\n7.1.  YOU agree that the laws of England shall apply to  any\n      dispute  arising from this LICENCE.  YOU agree for the\n      benefit of VITA NUOVA that the Courts of England  have\n      exclusive  jurisdiction  to  hear and decide any suit,\n      action or proceedings (``Proceedings''), and to settle\n      any  disputes, which may arise out of or in connection\n      with this LICENCE and, for these purposes YOU  irrevo-\n      cably  submit  to  the  jurisdiction  of  the  English\n      Courts.\n7.2.  The submission to  the  jurisdiction  of  the  English\n      Courts  does  not limit VITA NUOVA's right to take any\n      Proceedings in any one or more jurisdictions, nor does\n      the  taking of Proceedings by VITA NUOVA in any one or\n      more jurisdictions preclude VITA NUOVA taking Proceed-\n      ings in another jurisdiction if and to the extent per-\n      mitted by applicable law.\n8.1.  This is the entire  agreement  between  YOU  and  VITA\n      NUOVA  which  supersedes any prior agreement or under-\n      standing whether written or oral relating to the  sub-\n      ject matter of this LICENCE.\n8.2.  YOU will in all YOUR dealings with the LICENSED  SOFT-\n      WARE  and  any  ADAPTATIONS act as an independent con-\n      tractor.  Nothing in this LICENCE will be construed as\n      creating  an  agency,  partnership, or any other legal\n      association between YOU and VITA NUOVA  and  YOU  will\n      not represent that YOU have any authority to assume or\n      create any obligation express or implied on behalf  of\n      VITA NUOVA.\n8.3.  A person who is not a party to this LICENCE shall have\n      no  rights  pursuant to the Contracts (Rights of Third\n      Parties) Act 1999 (the ``Act'') to enforce any term of\n      this  LICENCE provided that a person who is the lawful\n      successor to or permitted assignee of the rights of  a\n      party  is  considered  to  be a party to this LICENCE.\n      Any right or remedy of a third party which  exists  or\n      is available apart from the Act is not affected.\n8.4.  VITA NUOVA may from time to time and at its sole  dis-\n      cretion  publish  a revised and/or new version of this\n      LICENCE which shall then govern the licensing  of  all\n      copies  of  LICENSED  SOFTWARE  supplied by VITA NUOVA\n      after the posting of  such  revised  or  new  licence.\n      Should  YOU  have any questions regarding this LICENCE\n      or wish to contact VITA NUOVA for any reason visit our\n      web site at www.vitanuova.com for contact details."
}