{
  "key": "vs10x-code-map",
  "short_name": "VS10x Code Map",
  "name": "VS10x Code Map",
  "category": "Proprietary Free",
  "owner": "AxTools",
  "homepage_url": "http://visualstudiogallery.msdn.microsoft.com/site/1c54d1bd-d898-4705-903f-fa4a319b50f2/eula?licenseType=None",
  "spdx_license_key": "LicenseRef-scancode-vs10x-code-map",
  "text": "VS10x Code Map - LIMITED PRODUCT WARRANTY\n\nPlease read the below terms. Continuing with the installation of VS10x Code Map\nwill indicate your acceptance.\n\nMichael Kiss [AxTools] provides VS10x Code Map and licenses its use to you. You\nare responsible for selecting VS10x Code Map to achieve your intended results\nand for the installation, use and results obtained from VS10x Code Map.\n\nVS10x Code Map, including its code, documentation, appearance, structure and\norganization, is a proprietary product of Michael Kiss [AxTools] and is\nprotected by the law. Title to VS10x Code Map, or any copy, modification or\nmerged portion of VS10x Code Map, shall at all times remain with Michael Kiss\n[AxTools].\n\nLimited Warranty\n\nEXCEPT AS SPECIFICALLY SET FORTH IN THIS AGREEMENT, VS10x Code Map IS LICENSED\nAND PROVIDED ON AN \"AS IS\" BASIS, WITHOUT ANY KIND OF WARRANTY, EITHER EXPRESS\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nMichael Kiss [AxTools] warrants that VS10x Code Map will substantially perform\nthe functions or generally conform to VS10x Code Map's specifications as\npublished by Michael Kiss [AxTools]. Michael Kiss [AxTools] does not warrant\nthat the functions contained in VS10x Code Map will meet your requirements or\nthat the operation of VS10x Code Map will be entirely error free or appear\nprecisely as described in the VS10x Code Map documentation.\n\nRemedies and Liabilities\n\nIn no event will Michael Kiss [AxTools] be liable for any damages, including\nlost profits, lost savings, or other direct, indirect, incidental or\nconsequential damages, arising out of the use or inability to use VS10x Code\nMap, even if Michael Kiss [AxTools] or a dealer authorized by Michael Kiss\n[AxTools] had been advised of the possibility of such damages."
}