{
  "key": "vsl-1.0",
  "short_name": "Vovida Software License 1.0",
  "name": "Vovida Software License v. 1.0",
  "category": "Permissive",
  "owner": "Vovida",
  "homepage_url": "http://www.vovida.org/About/license.html",
  "notes": "Per SPDX.org, this license is OSI certified",
  "spdx_license_key": "VSL-1.0",
  "osi_license_key": "VSL-1.0",
  "text_urls": [
    "http://www.vovida.org/About/license.html"
  ],
  "osi_url": "http://opensource.org/licenses/vovidapl.php",
  "other_urls": [
    "http://www.opensource.org/licenses/VSL-1.0",
    "http://www.vovida.org",
    "https://opensource.org/licenses/VSL-1.0"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2000 Vovida Networks, Inc."
  ],
  "ignorable_holders": [
    "Vovida Networks, Inc."
  ],
  "ignorable_urls": [
    "http://www.vovida.org/"
  ],
  "ignorable_emails": [
    "vocal@vovida.org"
  ],
  "text": "Vovida Software License v. 1.0\n\nThis license applies to all software incorporated in the \"Vovida\nOpen Communication Application Library\" except for those portions\nincorporating third party software specifically identified as being\nlicensed under separate license.\n\nThe Vovida Software License, Version 1.0\nCopyright (c) 2000 Vovida Networks, Inc. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in\nthe documentation and/or other materials provided with the\ndistribution.\n\n3. The names \"VOCAL\", \"Vovida Open Communication Application Library\",\nand \"Vovida Open Communication Application Library (VOCAL)\" must\nnot be used to endorse or promote products derived from this\nsoftware without prior written permission. For written\npermission, please contact vocal@vovida.org.\n\n4. Products derived from this software may not be called \"VOCAL\", nor\nmay \"VOCAL\" appear in their name, without prior written\npermission.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESSED OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND\nNON-INFRINGEMENT ARE DISCLAIMED. IN NO EVENT SHALL VOVIDA\nNETWORKS, INC. OR ITS CONTRIBUTORS BE LIABLE FOR ANY DAMAGES\nIN EXCESS OF $1,000, NOR FOR ANY INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\nOF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\nUSE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGE.\n\nThis software consists of voluntary contributions made by Vovida\nNetworks, Inc. and many individuals on behalf of Vovida Networks,\nInc. For more information on Vovida Networks, Inc., please see\nhttp://www.vovida.org.\n\nAll third party licenses and copyright notices and other required\nlegends also need to be complied with as well."
}