{
  "key": "w3c-docs-20021231",
  "short_name": "W3C-DOCS-20021231",
  "name": "W3C Document License (2002-12-31)",
  "category": "Free Restricted",
  "owner": "W3C - World Wide Web Consortium",
  "homepage_url": "http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231",
  "spdx_license_key": "LicenseRef-scancode-w3c-docs-20021231",
  "ignorable_copyrights": [
    "Copyright (c) World Wide Web Consortium, (Massachusetts Institute of Technology, European Research Consortium for Informatics and Mathematics, Keio University, Beihang)"
  ],
  "ignorable_holders": [
    "World Wide Web Consortium, (Massachusetts Institute of Technology, European Research Consortium for Informatics and Mathematics, Keio University, Beihang)"
  ],
  "ignorable_urls": [
    "http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231"
  ],
  "text": "W3C DOCUMENT LICENSE\n\nPublic documents on the W3C site are provided by the copyright holders under the\nfollowing license.\n\nLicense\nBy using and/or copying this document, or the W3C document from which this\nstatement is linked, you (the licensee) agree that you have read, understood,\nand will comply with the following terms and conditions:\n\nPermission to copy, and distribute the contents of this document, or the W3C\ndocument from which this statement is linked, in any medium for any purpose and\nwithout fee or royalty is hereby granted, provided that you include the\nfollowing on ALL copies of the document, or portions thereof, that you use:\n\n* A link or URL to the original W3C document.\n* The pre-existing copyright notice of the original author, or if it doesn't\nexist, a notice (hypertext is preferred, but a textual representation is\npermitted) of the form: \"Copyright © [$date-of-document] World Wide Web\nConsortium, (Massachusetts Institute of Technology, European Research Consortium\nfor Informatics and Mathematics, Keio University, Beihang). All Rights Reserved.\nhttp://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231\"\n\n* If it exists, the STATUS of the W3C document.\n\nWhen space permits, inclusion of the full text of this NOTICE should be\nprovided. We request that authorship attribution be provided in any software,\ndocuments, or other items or products that you create pursuant to the\nimplementation of the contents of this document, or any portion thereof.\n\nNo right to create modifications or derivatives of W3C documents is granted\npursuant to this license. However, if additional requirements (documented in the\nCopyright FAQ) are satisfied, the right to create modifications or derivatives\nis sometimes granted by the W3C to individuals complying with those\nrequirements.\n\nDisclaimers\nTHIS DOCUMENT IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS\nOR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR TITLE;\nTHAT THE CONTENTS OF THE DOCUMENT ARE SUITABLE FOR ANY PURPOSE; NOR THAT THE\nIMPLEMENTATION OF SUCH CONTENTS WILL NOT INFRINGE ANY THIRD PARTY PATENTS,\nCOPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE DOCUMENT OR THE PERFORMANCE\nOR IMPLEMENTATION OF THE CONTENTS THEREOF.\n\nThe name and trademarks of copyright holders may NOT be used in advertising or\npublicity pertaining to this document or its contents without specific, written\nprior permission. Title to copyright in this document will at all times remain\nwith copyright holders.\n\nNotes\nThis version: http://www.w3.org/Consortium/Legal/2002/copyright-documents-20021231\n\nThis formulation of W3C's notice and license became active on December 31 2002.\nThis version removes the copyright ownership notice such that this license can\nbe used with materials other than those owned by the W3C, moves information on\nstyle sheets, DTDs, and schemas to the Copyright FAQ, reflects that ERCIM is now\na host of the W3C, includes references to this specific dated version of the\nlicense, and removes the ambiguous grant of \"use\". See the older formulation for\nthe policy prior to this date. Please see our Copyright FAQ for common questions\nabout using materials from our site, such as the translating or annotating\nspecifications."
}