{
  "key": "w3c-documentation",
  "short_name": "W3C Documentation License",
  "name": "W3C Documentation License",
  "category": "Free Restricted",
  "owner": "W3C - World Wide Web Consortium",
  "homepage_url": "http://www.w3.org/TR/REC-DOM-Level-1/copyright-notice.html",
  "spdx_license_key": "LicenseRef-scancode-w3c-documentation",
  "text_urls": [
    "http://www.w3.org/TR/REC-DOM-Level-1/copyright-notice.html"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 1998 World Wide Web Consortium, (Massachusetts Institute of Technology, Institut National de Recherche en Informatique et en Automatique , Keio University )",
    "Copyright (c) World Wide Web Consortium, (Massachusetts Institute of Technology , Institut National de Recherche en Informatique et en Automatique, Keio University )"
  ],
  "ignorable_holders": [
    "World Wide Web Consortium, (Massachusetts Institute of Technology , Institut National de Recherche en Informatique et en Automatique, Keio University",
    "World Wide Web Consortium, (Massachusetts Institute of Technology, Institut National de Recherche en Informatique et en Automatique , Keio University"
  ],
  "text": "Copyright Notice\n\nCopyright © 1998 World Wide Web Consortium , (Massachusetts Institute of\nTechnology , Institut National de Recherche en Informatique et en Automatique ,\nKeio University ). All Rights Reserved.\n\nDocuments on the W3C site are provided by the copyright holders under the\nfollowing license. By obtaining, using and/or copying this document, or the W3C\ndocument from which this statement is linked, you agree that you have read,\nunderstood, and will comply with the following terms and conditions:\n\nPermission to use, copy, and distribute the contents of this document, or the\nW3C document from which this statement is linked, in any medium for any purpose\nand without fee or royalty is hereby granted, provided that you include the\nfollowing on ALL copies of the document, or portions thereof, that you use:\n\n1. A link or URI to the original W3C document.\n2. The pre-existing copyright notice of the original author, if it doesn't exist,\na notice of the form:\n\n\"Copyright © World Wide Web Consortium , (Massachusetts Institute of Technology ,\nInstitut National de Recherche en Informatique et en Automatique , Keio University ).\nAll Rights Reserved.\"\n\n3. If it exists, the STATUS of the W3C document.\n\nWhen space permits, inclusion of the full text of this NOTICE should be\nprovided. In addition, credit shall be attributed to the copyright holders for\nany software, documents, or other items or products that you create pursuant to\nthe implementation of the contents of this document, or any portion thereof.\n\nNo right to create modifications or derivatives is granted pursuant to this\nlicense.\n\nTHIS DOCUMENT IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS\nOR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR TITLE;\nTHAT THE CONTENTS OF THE DOCUMENT ARE SUITABLE FOR ANY PURPOSE; NOR THAT THE\nIMPLEMENTATION OF SUCH CONTENTS WILL NOT INFRINGE ANY THIRD PARTY PATENTS,\nCOPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE DOCUMENT OR THE PERFORMANCE\nOR IMPLEMENTATION OF THE CONTENTS THEREOF.\n\nThe name and trademarks of copyright holders may NOT be used in advertising or\npublicity pertaining to this document or its contents without specific, written\nprior permission. Title to copyright in this document will at all times remain\nwith copyright holders."
}