{
  "key": "w3c",
  "short_name": "W3C Software Notice and License",
  "name": "W3C Software Notice and License",
  "category": "Permissive",
  "owner": "W3C - World Wide Web Consortium",
  "homepage_url": "http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231",
  "notes": "Per SPDX.org, this license was released 13 December 2002. This license is\nOSI certified.\n",
  "spdx_license_key": "W3C",
  "text_urls": [
    "http://www.open-xchange.com/fileadmin/downloads/W3C_SOFTWARE_NOTICE_AND_LICENSE.pdf",
    "http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231"
  ],
  "other_urls": [
    "http://www.opensource.org/licenses/W3C",
    "http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231.html",
    "http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231.html http://www.opensource.org/licenses/W3C.php",
    "https://opensource.org/licenses/W3C"
  ],
  "text": "By obtaining, using and/or copying this work, you (the licensee) agree that you\nhave read, understood, and will comply with the following terms and conditions.\n\nPermission to copy, modify, and distribute this software and its documentation,\nwith or without modification, for any purpose and without fee or royalty is\nhereby granted, provided that you include the following on ALL copies of the\nsoftware and documentation or portions thereof, including modifications:\n\nThe full text of this NOTICE in a location viewable to users of the\nredistributed or derivative work.\n\nAny pre-existing intellectual property disclaimers, notices, or terms and\nconditions. If none exist, the W3C Software Short Notice should be included\n(hypertext is preferred, text is permitted) within the body of any redistributed\nor derivative code.\n\nNotice of any changes or modifications to the files, including the date changes\nwere made. (We recommend you provide URIs to the location from which the code is\nderived.)\n\nDisclaimers\nTHIS SOFTWARE AND DOCUMENTATION IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE\nNO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED\nTO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT\nTHE USE OF THE SOFTWARE OR DOCUMENTATION WILL NOT INFRINGE ANY THIRD PARTY\nPATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SOFTWARE OR DOCUMENTATION.\n\nThe name and trademarks of copyright holders may NOT be used in advertising or\npublicity pertaining to the software without specific, written prior permission.\nTitle to copyright in this software and any associated documentation will at all\ntimes remain with copyright holders."
}