{
  "key": "whistle",
  "short_name": "Whistle Communications License",
  "name": "Whistle Communications License",
  "category": "Permissive",
  "owner": "FreeBSD",
  "spdx_license_key": "LicenseRef-scancode-whistle",
  "text": "Subject to the following obligations and disclaimer of warranty, use and\nredistribution of this software, in source or object code forms, with or\nwithout modifications are expressly permitted by Whistle Communications;\nprovided, however, that:\n1. Any and all reproductions of the source or object code must include the\ncopyright notice above and the following disclaimer of warranties; and\n\n2. No rights are granted, in any manner or form, to use Whistle\nCommunications, Inc. trademarks, including the mark \"WHISTLE\nCOMMUNICATIONS\" on advertising, endorsements, or otherwise except as\nsuch appears in the above copyright notice or in the software.\n\nTHIS SOFTWARE IS BEING PROVIDED BY WHISTLE COMMUNICATIONS \"AS IS\", AND\nTO THE MAXIMUM EXTENT PERMITTED BY LAW, WHISTLE COMMUNICATIONS MAKES NO\nREPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, REGARDING THIS SOFTWARE,\nINCLUDING WITHOUT LIMITATION, ANY AND ALL IMPLIED WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.\nWHISTLE COMMUNICATIONS DOES NOT WARRANT, GUARANTEE, OR MAKE ANY\nREPRESENTATIONS REGARDING THE USE OF, OR THE RESULTS OF THE USE OF THIS\nSOFTWARE IN TERMS OF ITS CORRECTNESS, ACCURACY, RELIABILITY OR OTHERWISE.\nIN NO EVENT SHALL WHISTLE COMMUNICATIONS BE LIABLE FOR ANY DAMAGES\nRESULTING FROM OR ARISING OUT OF ANY USE OF THIS SOFTWARE, INCLUDING\nWITHOUT LIMITATION, ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,\nPUNITIVE, OR CONSEQUENTIAL DAMAGES, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES, LOSS OF USE, DATA OR PROFITS, HOWEVER CAUSED AND UNDER ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF WHISTLE COMMUNICATIONS IS ADVISED OF THE POSSIBILITY\nOF SUCH DAMAGE."
}