{
  "key": "wifi-alliance",
  "short_name": "Wi-Fi Alliance",
  "name": "Wi-Fi Alliance License",
  "category": "Commercial",
  "owner": "Wi-Fi Alliance",
  "spdx_license_key": "LicenseRef-scancode-wifi-alliance",
  "ignorable_authors": [
    "permission from Wi-Fi Alliance"
  ],
  "text": "Confidential not for redistribution\n\n=======================================================================\nLICENSE\n=======================================================================\n\nLicense is granted only to Wi-Fi Alliance members and designated  Wi-Fi\ncontractors and, unless otherwise expressly authorized in writing by the\nWi-Fi Alliance, is limited for use solely in testing Wi-Fi equipment in\nconjunction with a Wi-Fi certification program. This license is not\ntransferable or sublicensable, and it does not extend to and may not be\nused with non-Wi-Fi applications.\n\nCommercial derivative works or applications that use this software are NOT\nAUTHORIZED without specific prior written permission from Wi-Fi Alliance.\n\nNon-Commercial derivative works for your own internal use are authorized\nand are limited by the same restrictions.\n\nNeither the name of the author nor \"Wi-Fi Alliance\"\nmay be used to endorse or promote products that are derived\nfrom or that use this software without specific prior written\npermission from Wi-Fi Alliance.\n\nTHIS SOFTWARE IS PROVIDED BY WIFI ALLIANCE \"AS IS\" AND ANY EXPRESSED OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS FOR A  PARTICULAR PURPOSE,\nARE DISCLAIMED. IN NO EVENT SHALL WIFI ALLIANCE BE LIABLE FOR ANY DIRECT,\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, THE COST OF PROCUREMENT OF SUBSTITUTE GOODS\nOR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
}