{
  "key": "wingo",
  "short_name": "wingo License",
  "name": "wingo License",
  "category": "Permissive",
  "owner": "wingo",
  "homepage_url": "http://www.wingo.com/jt_/license.html",
  "spdx_license_key": "LicenseRef-scancode-wingo",
  "text_urls": [
    "http://www.wingo.com/jt_/jt_license.html"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 2002-2010 Joseph.Oster, wingo.com"
  ],
  "ignorable_holders": [
    "Joseph.Oster, wingo.com"
  ],
  "ignorable_urls": [
    "http://www.wingo.com/jt_/",
    "http://www.wingo.com/jt_/jt_license.html"
  ],
  "text": "License for 'jt2_.js' (was 'jt_utils.js'), 'jt_DialogBox' and all\nrelated code: http://www.wingo.com/jt_/\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain this copyright notice and link\n   to this License, list of conditions and the following disclaimer:\n\n Copyright (c) 2002-2010 Joseph.Oster, wingo.com - All rights reserved.\n license: http://www.wingo.com/jt_/jt_license.html\n\n2. Products derived from this software may not use the \"wingo.com\" name\n   nor may \"wingo.com\" appear in their names without prior written\n   permission of Joseph Oster, wingo.com.\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL\nJoseph Oster, wingo.com OR ITS CONTRIBUTORS BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n====================================================================\n\nExcept where specifically noted in the source code, this software consists\nsolely of contributions made by Joseph Oster, wingo.com"
}