{
  "key": "wxwidgets",
  "short_name": "wxWidgets Licence",
  "name": "wxWidgets Licence",
  "category": "Permissive",
  "owner": "wxWidgets",
  "homepage_url": "http://www.wxwidgets.org/about/licence.htm",
  "spdx_license_key": "LicenseRef-scancode-wxwidgets",
  "text_urls": [
    "http://www.wxwidgets.org/about/licence.htm"
  ],
  "ignorable_copyrights": [
    "Copyright (c) 1997 Julian Smart, Markus Holzem",
    "copyrighted by the wxWidgets authors"
  ],
  "ignorable_holders": [
    "Julian Smart, Markus Holzem",
    "the wxWidgets authors"
  ],
  "ignorable_emails": [
    "julian@wxwidgets.org"
  ],
  "text": "wxWidgets Licence\n\nCopyright (C) 1997 Julian Smart, Markus Holzem\n\nPreamble\n\nThis licence is intended to protect wxWidgets, its developers, and its users, so\nthat the considerable investment it represents is not abused.\n\nUnlike the wxWidgets licence, you as a user are not obliged to distribute\nwxWidgets source code with your products. However, you are prevented from\nselling the code without permission from the authors, or denying others the\nrights to use or distribute wxWidgets in the way intended.\n\nThe wxWidgets Licence establishes the copyright for the code and related\nmaterial, and it gives you legal permission to copy, distribute and/or modify\nthe library. It also asserts that no warranty is given by the authors for this\nor derived code.\n\nFinally, the licence specifies that any patent involving wxWidgets, must be\nlicenced for everyone's free use.\n\n wxWidgets Licence\n\nTerms and conditions for copying, distribution and modification\n\n1. This Licence Agreement applies to any software library which contains a\nnotice placed by the copyright holder or other authorized party saying it may be\ndistributed under the terms of this wxWidgets Licence (also called \"this\nLicence\"). Each licencee is addressed as \"you\".\n\nA \"library\" means a collection of software functions and/or data prepared so as\nto be conveniently linked with application programs (which use some of those\nfunctions and data) to form executables.\n\nThe \"Library\", below, refers to any such software library or work which has been\ndistributed under these terms. A \"work based on the Library\" means either the\nLibrary or any derivative work under copyright law: that is to say, a work\ncontaining the Library or a portion of it, either verbatim or with modifications\nand/or translated straightforwardly into another language. (Hereinafter,\ntranslation is included without limitation in the term \"modification\".)\n\n\"Source code\" for a work means the preferred form of the work for making\nmodifications to it. For a library, complete source code means all the source\ncode for all modules it contains, plus any associated interface definition\nfiles, plus the scripts used to control compilation and installation of the\nlibrary.\n\nActivities other than copying, distribution and modification are not covered by\nthis Licence; they are outside its scope. The act of running a program using the\nLibrary is not restricted, and output from such a program is covered only if its\ncontents constitute a work based on the Library (independent of the use of the\nLibrary in a tool for writing it). Whether that is true depends on what the\nLibrary does and what the program that uses the Library does.\n\n2. You may copy and distribute verbatim copies of the Library's complete source\ncode as you receive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice and\ndisclaimer of warranty; keep intact all the notices that refer to this Licence\nand to the absence of any warranty; and distribute a copy of this Licence along\nwith the Library.\n\nYou may charge a fee for the physical act of transferring a copy, and you may at\nyour option offer warranty protection in exchange for a fee.\n\n3. You may modify your copy or copies of the Library or any portion of it, thus\nforming a work based on the Library, and copy and distribute such modifications\nor work under the terms of Section 1 above, provided that you cause the files\nmodified to carry prominent notices stating that you changed the files and the\ndate of any change. With agreement from the authors of wxWidgets, you may charge\nfor value added to the Library, for example, a commercially supported version,\nor a port to a new platform. It is expected that collaboration between such\ncommercial interests and the free wxWidgets community will yield benefits to\nboth parties, since wxWidgets represents a substantial investment of time and\neffort. It is not in the spirit of this agreement that commercial exploitation\nof wxWidgets should in any way detract from the free version.\n\n4. You may copy and distribute the Library in object code or derived library\nform under the terms of Sections 1 and 2 above provided that you accompany it\nwith the complete corresponding machine-readable source code.\n\nIf distribution of object code is made by offering access to copy from a\ndesignated place, then offering equivalent access to copy the source code from\nthe same place satisfies the requirement to distribute the source code, even\nthough third parties are not compelled to copy the source along with the object\ncode.\n\n5. You may not copy, modify, sublicence, link with, or distribute the Library\nexcept as expressly provided under this Licence. Any attempt otherwise to copy,\nmodify, sublicence, link with, or distribute the Library is void, and will\nautomatically terminate your rights under this Licence. However, parties who\nhave received copies, or rights, from you under this Licence will not have their\nlicences terminated so long as such parties remain in full compliance.\n\n6. You are not required to accept this Licence, since you have not signed it.\nHowever, nothing else grants you permission to modify or distribute the Library\nor its derivative works. These actions are prohibited by law if you do not\naccept this Licence. Therefore, by modifying or distributing the Library (or any\nwork based on the Library), you indicate your acceptance of this Licence to do\nso, and all its terms and conditions for copying, distributing or modifying the\nLibrary or works based on it.\n\n7. Each time you redistribute the Library (or any work based on the Library),\nthe recipient automatically receives a licence from the original licensor to\ncopy, distribute, link with or modify the Library subject to these terms and\nconditions. You may not impose any further restrictions on the recipients'\nexercise of the rights granted herein. You are not responsible for enforcing\ncompliance by third parties to this Licence.\n\n8. If, as a consequence of a court judgment or allegation of patent infringement\nor for any other reason (not limited to patent issues), conditions are imposed\non you (whether by court order, agreement or otherwise) that contradict the\nconditions of this Licence, they do not excuse you from the conditions of this\nLicence. If you cannot distribute so as to satisfy simultaneously your\nobligations under this Licence and any other pertinent obligations, then as a\nconsequence you may not distribute the Library at all. For example, if a patent\nlicence would not permit royalty-free redistribution of the Library by all those\nwho receive copies directly or indirectly through you, then the only way you\ncould satisfy both it and this Licence would be to refrain entirely from\ndistribution of the Library.\n\nIf any portion of this section is held invalid or unenforceable under any\nparticular circumstance, the balance of the section is intended to apply, and\nthe section as a whole is intended to apply in other circumstances.\n\nIt is not the purpose of this section to induce you to infringe any patents or\nother property right claims or to contest validity of any such claims; this\nsection has the sole purpose of protecting the integrity of the free software\ndistribution system which is implemented by public licence practices. Many\npeople have made generous contributions to the wide range of software\ndistributed through that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing to\ndistribute software through any other system and a licencee cannot impose that\nchoice.\n\nThis section is intended to make thoroughly clear what is believed to be a\nconsequence of the rest of this Licence.\n\n9. If the distribution and/or use of the Library is restricted in certain\ncountries either by patents or by copyrighted interfaces, the original copyright\nholder who places the Library under this Licence may add an explicit\ngeographical distribution limitation excluding those countries, so that\ndistribution is permitted only in or among countries not thus excluded. In such\ncase, this Licence incorporates the limitation as if written in the body of this\nLicence.\n\n10. The authors of wxWidgets may publish revised and/or new versions of the\nwxWidgets Licence from time to time. Such new versions will be similar in spirit\nto the present version, but may differ in detail to address new problems or\nconcerns.\n\nEach version is given a distinguishing version number. If the Library specifies\na version number of this Licence which applies to it and \"any later version\",\nyou have the option of following the terms and conditions either of that version\nor of any later version published by the wxWidgets authors. If the Library does\nnot specify a licence version number, you may choose any version ever published\nby the wxWidgets authors.\n\n11. If you wish to incorporate parts of the Library into other free programs\nwhose distribution conditions are incompatible with these, write to the program\nauthor to ask for permission. For software which is copyrighted by the wxWidgets\nauthors, write to the wxWidgets authors. Our decision will be guided by the two\ngoals of preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\nNO WARRANTY\n\n12. BECAUSE THE LIBRARY IS LICENCED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE\nLIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED\nIN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE LIBRARY \"AS\nIS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT\nNOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nLIBRARY IS WITH YOU. SHOULD THE LIBRARY PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n13. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL\nANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE\nLIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL,\nSPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY\nTO USE THE LIBRARY (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\nRENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF\nTHE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF SUCH HOLDER OR OTHER\nPARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nEND OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Libraries\n\nTo apply these terms, attach the following notices to the library. It is safest\nto attach them to the start of each source file to most effectively convey the\nexclusion of warranty; and each file should have at least the \"copyright\" line\nand a pointer to where the full notice is found.\n\n<one line to give the library's name and a brief idea of what it does.>\n\nCopyright (C) <year> <name of author>\n\nThis library is free software; you can redistribute it and/or\n\nmodify it under the terms of the wxWidgets Licence; either\n\nversion 2 of the Licence, or (at your option) any later version.\n\nThis library is distributed in the hope that it will be useful, but WITHOUT ANY\nWARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A\nPARTICULAR PURPOSE. See the wxWidgets Licence for more details.\n\nYou should have received a copy of the wxWidgets Licence along with this\nlibrary; if not, write to julian@wxwidgets.org.\n\nYou should also get your employer (if you work as a programmer) or your school,\nif any, to sign a \"copyright disclaimer\" for the library, if necessary. Here is\na sample; alter the names:\n\nYoyodyne, Inc., hereby disclaims all copyright interest in the library `Frob' (a\nlibrary for tweaking knobs) written by James Random Hacker.\n\n<signature of Ty Coon>, 1 April 1990\n\nTy Coon, President of Vice\n"
}