{
  "key": "x11-realmode",
  "short_name": "X11-Style (Realmode)",
  "name": "X11-Style (Realmode)",
  "category": "Permissive",
  "owner": "XFree86 Project, Inc",
  "notes": "a composite of x11-keith-packard and other license comments",
  "spdx_license_key": "LicenseRef-scancode-x11-realmode",
  "minimum_coverage": 85,
  "ignorable_emails": [
    "KendallB@scitechsoft.com",
    "x86emu@linuxlabs.com"
  ],
  "text": "Permission to use, copy, modify, distribute, and sell this software and its\ndocumentation for any purpose is hereby granted without fee, provided that the\nabove copyright notice appear in all copies and that both that copyright notice\nand this permission notice appear in supporting documentation, and that the name\nof the authors not be used in advertising or publicity pertaining to\ndistribution of the software without specific, written prior permission.\n\nThe authors makes no representations about the suitability of this software\nfor any purpose. It is provided \"as is\" without express or implied warranty.\n\nTHE AUTHORS DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL THE AUTHORS\nBE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF\nCONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION\nWITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\nLicense information\n\nThe x86emu library is under a BSD style license, compatible with the XFree86 1.0\nand X licenses used by XFree86. The original x86emu libraries were under the GNU\nGeneral Public License. Due to license incompatibilities between the GPL and the\nXFree86 1.0 license, the original authors of the code decided to allow a license\nchange. If you have submitted code to the original x86emu project, and you don't\nagree with the license change, please contact us and let you know. Your code\nwill be removed to comply with your wishes.\n\nIf you have any questions about this, please send email to x86emu@linuxlabs.com\nor KendallB@scitechsoft.com for clarification."
}