{
  "key": "x11-opengl",
  "short_name": "X11-Style (OpenGL)",
  "name": "X11-Style (OpenGL)",
  "category": "Permissive",
  "owner": "SGI - Silicon Graphics",
  "homepage_url": "https://gitlab.freedesktop.org/mesa/glw/-/blob/master/README?ref_type=heads",
  "spdx_license_key": "SGI-OpenGL",
  "other_spdx_license_keys": [
    "LicenseRef-scancode-x11-opengl"
  ],
  "other_urls": [
    "https://gitlab.freedesktop.org/mesa/glw/-/blob/master/README?ref_type=heads"
  ],
  "minimum_coverage": 80,
  "text": "Permission to use, copy, modify, and distribute this software for any purpose\nand without fee is hereby granted, provided that the above copyright notice\nappear in all copies and that both the copyright notice and this permission\nnotice appear in supporting documentation, and that the name of Silicon\nGraphics, Inc. not be used in advertising or publicity pertaining to\ndistribution of the software without specific, written prior permission.\n\nTHE MATERIAL EMBODIED ON THIS SOFTWARE IS PROVIDED TO YOU \"AS-IS\" AND WITHOUT\nWARRANTY OF ANY KIND, EXPRESS, IMPLIED OR OTHERWISE, INCLUDING WITHOUT\nLIMITATION, ANY WARRANTY OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\nIN NO EVENT SHALL SILICON GRAPHICS, INC. BE LIABLE TO YOU OR ANYONE ELSE FOR ANY\nDIRECT, SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR\nANY DAMAGES WHATSOEVER, INCLUDING WITHOUT LIMITATION, LOSS OF PROFIT, LOSS OF\nUSE, SAVINGS OR REVENUE, OR THE CLAIMS OF THIRD PARTIES, WHETHER OR NOT SILICON\nGRAPHICS, INC. HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS, HOWEVER CAUSED\nAND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE\nPOSSESSION, USE OR PERFORMANCE OF THIS SOFTWARE.\n\nUS Government Users Restricted Rights\n\nUse, duplication, or disclosure by the Government is subject to restrictions set\nforth in FAR 52.227.19(c)(2) or subparagraph (c)(1)(ii) of the Rights in\nTechnical Data and Computer Software clause at DFARS 252.227-7013 and/or in\nsimilar or successor clauses in the FAR or the DOD or NASA FAR Supplement.\nUnpublished-- rights reserved under the copyright laws of the United States.\nContractor/manufacturer is Silicon Graphics, Inc., 2011 N. Shoreline Blvd.,\nMountain View, CA 94039-7311.\n\nOpenGL(TM) is a trademark of Silicon Graphics, Inc."
}