{
  "key": "x11-bitstream",
  "short_name": "X11-Style (Bitstream Charter)",
  "name": "X11-Style (Bitstream Charter)",
  "category": "Permissive",
  "owner": "Bitstream",
  "notes": "this is an historical license with an extra grant",
  "spdx_license_key": "LicenseRef-scancode-x11-bitstream",
  "ignorable_copyrights": [
    "(c) Copyright 1989-1992, Bitstream Inc., Cambridge, MA."
  ],
  "ignorable_holders": [
    "Bitstream Inc., Cambridge, MA."
  ],
  "text": "The names \"Bitstream\" and \"Charter\" are registered trademarks of\nBitstream, Inc. Permission to use these trademarks is hereby\ngranted only in association with the images described in this file.\n\nPermission to use, copy, modify, and distribute this software and\nits documentation for any purpose and without fee is hereby\ngranted, provided that the above copyright notice appear in all\ncopies and that both that copyright notice and this permission\nnotice appear in supporting documentation, and that the name of\nBitstream not be used in advertising or publicity pertaining to\ndistribution of the software without specific, written prior\npermission. Bitstream makes no representations about the\nsuitability of this software for any purpose. It is provided \"as\nis\" without express or implied warranty.\n\nBITSTREAM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE,\nINCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN\nNO EVENT SHALL BITSTREAM BE LIABLE FOR ANY SPECIAL, INDIRECT OR\nCONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS\nOF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT,\nNEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION\nWITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n(c) Copyright 1989-1992, Bitstream Inc., Cambridge, MA.\n\nYou are hereby granted permission under all Bitstream propriety rights to use,\ncopy, modify, sublicense, sell, and redistribute the 4 Bitstream Charter (r)\nType 1 outline fonts and the 4 Courier Type 1 outline fonts for any purpose and\nwithout restriction; provided, that this notice is left intact on all copies of\nsuch fonts and that Bitstream's trademark is acknowledged as shown below on all\nunmodified copies of the 4 Charter Type 1 fonts.\n\nBITSTREAM CHARTER is a registered trademark of Bitstream Inc."
}