{
  "key": "zeebe-community-1.1",
  "short_name": "Zeebe Community License v1.1",
  "name": "Zeebe Community License v1.1",
  "category": "Source-available",
  "owner": "Camunda Community Hub",
  "homepage_url": "https://github.com/camunda-community-hub/eze/blob/main/LICENSE",
  "spdx_license_key": "LicenseRef-scancode-zeebe-community-1.1",
  "text": "Zeebe Community License v1.1\n\nThis Zeebe Community License v1.1 (\"this Agreement\") sets forth the terms and\nconditions on which Camunda Services GmbH (\"the Licensor\") makes available this\nsoftware (\"the Software\"). BY INSTALLING, DOWNLOADING, ACCESSING, USING OR\nDISTRIBUTING THE SOFTWARE YOU INDICATE YOUR ACCEPTANCE TO, AND ARE ENTERING\nINTO A CONTRACT WITH, THE LICENSOR ON THE TERMS SET OUT IN THIS AGREEMENT. IF\nYOU DO NOT AGREE TO THESE TERMS, YOU MUST NOT USE THE SOFTWARE. IF YOU ARE\nRECEIVING THE SOFTWARE ON BEHALF OF A LEGAL ENTITY, YOU REPRESENT AND WARRANT\nTHAT YOU HAVE THE ACTUAL AUTHORITY TO AGREE TO THE TERMS AND CONDITIONS OF THIS\nAGREEMENT ON BEHALF OF SUCH ENTITY. \"Licensee\" means you, an individual, or the\nentity on whose behalf you are receiving the Software.\n\nPermission is hereby granted, free of charge, to the Licensee obtaining a copy\nof this Software and associated documentation files, to deal in the Software\nwithout restriction, including without limitation the rights to use, copy,\nmodify, merge, publish, distribute, sublicense, and/or sell copies of the\nSoftware, and to permit persons to whom the Software is furnished to do so,\nsubject in each case to the following conditions:\n\nCondition 1: If the Licensee distributes the Software or any derivative works\nof the Software, the Licensee must attach this Agreement.\n\nCondition 2: Without limiting other conditions in this Agreement, the grant of\nrights under this Agreement does not include the right to provide a Commercial\nProcess Automation Service.\n\nA \"Commercial Process Automation Service\" is a service intended for or directed\ntowards commercial advantage or monetary compensation for the provider of the\nservice enabling third parties (other than the provider’s employees or\nContractors) to deploy and execute Custom Processes or to access the Software\nvia its APIs.\n\n\"Contractors\" means third parties who are engaged to perform ICT development,\nmaintenance, configuration, training, consulting or associated management\nservices and are acting in that capacity.\n\n\"Custom Processes\" means process descriptions contained in BPMN or similar\nconfiguration files, that specify the logic for executing programmatic\nservices, such that third parties can define these programmatic services freely\n(as opposed to selecting them from a restricted set of pre-defined programmatic\nservices made available by the provider of the Commercial Process Automation\nService).\n\nIf the Licensee is in breach of the Conditions, this Agreement, including the\nrights granted under it, will automatically terminate with immediate effect.\n\nSUBJECT AS SET OUT BELOW, THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF\nANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO\nEVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES\nOR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\nARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\nDEALINGS IN THE SOFTWARE.\n\nNOTHING IN THIS AGREEMENT EXCLUDES OR RESTRICTS A PARTY’S LIABILITY FOR (A)\nDEATH OR PERSONAL INJURY CAUSED BY THAT PARTY’S NEGLIGENCE, (B) FRAUD, OR (C)\nANY OTHER LIABILITY TO THE EXTENT THAT IT CANNOT BE LAWFULLY EXCLUDED OR\nRESTRICTED."
}