{
  "key": "zrythm-exception-agpl-3.0",
  "short_name": "Zrythm Exception to AGPL 3.0",
  "name": "Zrythm Exception to AGPL 3.0",
  "category": "Copyleft",
  "owner": "Zrythm",
  "homepage_url": "https://git.sr.ht/~alextee/zrythm/tree/master/item/LICENSES/LicenseRef-ZrythmLicense.txt",
  "is_exception": true,
  "spdx_license_key": "LicenseRef-scancode-zrythm-exception-agpl-3.0",
  "text_urls": [
    "https://git.sr.ht/~alextee/zrythm/blob/master/TRADEMARKS.md"
  ],
  "other_urls": [
    "https://git.sr.ht/~alextee/zrythm/"
  ],
  "standard_notice": "Zrythm is free software: you can redistribute it\nand/or modify it under the terms of the GNU Affero\nGeneral Public License (GNU AGPL) as published by the\nFree Software Foundation, either version 3 of the\nLicense, or (at your option) any later version, with\nthe additional terms below.\nZrythm is distributed in the hope that it will be\nuseful, but WITHOUT ANY WARRANTY; without even the\nimplied warranty of MERCHANTABILITY or FITNESS FOR\nA PARTICULAR PURPOSE.\n",
  "ignorable_copyrights": [
    "Copyright (c) 2020-2022 Alexandros Theodotou"
  ],
  "ignorable_holders": [
    "Alexandros Theodotou"
  ],
  "ignorable_urls": [
    "https://archlinux.org/",
    "https://cve.mitre.org/",
    "https://debian.org/",
    "https://getfedora.org/",
    "https://www.freebsd.org/",
    "https://www.gnu.org/distros/free-distros.html",
    "https://www.zrythm.org/"
  ],
  "ignorable_emails": [
    "trademarks@zrythm.org"
  ],
  "text": "Additional terms under Section 7 of the GNU AGPL:\n\nZrythm and the Zrythm logo are trademarks of\nAlexandros Theodotou and are governed by the Zrythm\nTrademark Policy, found in the TRADEMARKS.md file.\nYou may distribute unaltered copies of Zrythm that\ninclude the Zrythm trademarks without express\npermission from Alexandros Theodotou. However,\nif you make any changes to Zrythm, you may not\nredistribute that product using any Zrythm trademark\nwithout Alexandros Theodotou’s prior written consent.\nFor example, you may not distribute a modified form\nof Zrythm and continue to call it Zrythm, or\ninclude the Zrythm logo, unless explicitly allowed\nby the Trademark Policy.\n\n=============================\nTRADEMARKS.md\n=============================\n\nTrademark Policy\n================\n\n# Applicable Trademarks\nZrythm and the Zrythm logo are registered\ntrademarks of Alexandros Theodotou in the United\nKingdom.\n\n# Objective of this Policy\nThe objective of this trademark policy is:\n- to clarify proper usage of Zrythm trademarks by\nthird parties\n- to prevent misuse of Zrythm trademarks that can\nconfuse or mislead users with respect to Zrythm\n\nFollowing are the guidelines for the proper use of\nZrythm trademarks by publishers and other third\nparties. Any use of or reference to Zrythm trademarks\nthat is inconsistent with these guidelines, or other\nunauthorized use of or reference to Zrythm\ntrademarks, or use of marks that are confusingly\nsimilar to Zrythm trademarks, is prohibited and may\nviolate the trademark rights of Alexandros Theodotou.\n\nAny use of Zrythm trademarks in a misleading and\nfalse manner, such as untruthful advertising, is\nalways prohibited.\n\n# Usage Guidelines\nThis Trademark Policy explicitly affirms your\nnominative fair use rights under trademark law,\nincluding to:\n- Use the Zrythm wordmark in text to truthfully refer\nto and/or link to unmodified programs, products,\nservices and technologies by Alexandros Theodotou.\n- Use the Zrythm logo in visuals to truthfully refer\nto and/or to link to the applicable unmodified\nprograms, products, services and technologies by\nAlexandros Theodotou.\n- Use Zrythm trademarks to make true factual\nstatements about Zrythm or communicate compatibility\nwith your product truthfully.\n\nThe following are explicitly forbidden:\n- Use of the Zrythm wordmark as part of a company\nname or logo, a product name or logo, or branding.\n- Use of the Zrythm logo as part of a company logo or\norganization logo or product logo or branding.\n- Use of the Zrythm wordmark as part of an acronym.\n- Use of Zrythm trademarks in any way that suggests\nan affiliation with or endorsement by the Zrythm\nproject or community, if that is not the case.\n\nAll other uses of a Zrythm trademark require our\nprior written permission. Contact\ntrademarks@zrythm.org for more information.\n\nAlexandros Theodotou reserves the right to review\nall use of the Zrythm trademarks and to object to\nany use that appears outside of this\nTrademark Policy.\n\n# Software Distribution Policy\nYou may distribute unaltered copies of the Zrythm\ndigital audio workstation (DAW) and related software\n(hereinafter collectively referred to as \"the\nsoftware\") published by Alexandros Theodotou that\ninclude the Zrythm trademarks without express\npermission from Alexandros Theodotou (provided that\nthe license of the software in question allows it).\n\nYou may further distribute altered copies of the\nsoftware that include the Zrythm trademarks,\nprovided that alterations solely serve the purposes\nof:\n- porting the software to a free system distribution\ncurrently approved by the Free Software Foundation at\n<https://www.gnu.org/distros/free-distros.html>, OR\n- porting the software to the Debian operating\nsystem, as published by the Debian project at\n<https://debian.org/>, OR\n- porting the software to the Fedora Workstation\noperating system, as published by the Fedora Project\nat <https://getfedora.org/>, OR\n- porting the software to the FreeBSD operating\nsystem, as published by the The FreeBSD Project at\n<https://www.freebsd.org/>, OR\n- porting the software to the Arch Linux operating\nsystem, as published by Levente Polyak and others at\n<https://archlinux.org/>, OR\n- fixing a bug in the software that has already been\nacknowledged by Alexandros Theodotou or CVE\n(<https://cve.mitre.org/>)\n\nYou may further redistribute copies of the software\nas published by the aforementioned software\ndistributors provided that no further modifications\nare made.\n\nIn any case, you may not add or remove\nfunctionalities and you must preserve all messages\npresented to users in the user interface and the\ncommand line, including but not limited to:\n- URLs pointing to official Zrythm web pages\n- informational messages (popups, console output,\netc.)\n\nYou must also provide a link to the original source\ncode as published by Alexandros Theodotou at\nhttps://www.zrythm.org/.\n\n# Requirement of Written Permission for Modified Versions Including Trademarks\nIf you make any changes to the software not\nexplicitly allowed above, you may not\nredistribute that product using any Zrythm trademark\nwithout Alexandros Theodotou’s prior written\nconsent. For example, you may not distribute a\nmodified form of the Zrythm DAW and continue to call\nit Zrythm, or include the Zrythm logo. If you wish to\ndistribute modified versions of the software that\ninclude the Zrythm trademarks please contact us with\nyour request at trademarks@zrythm.org.\n\n# Newer Versions of this Policy\nThis policy may be revised from time to time. New\nversions will be similar in spirit to the present\nversion, but may differ in detail to address new\nproblems or concerns. The file `TRADEMARKS.md` in\nthe source code releases will always contain the\ncurrent policy at the time of each release.\n\n----\n\nCopyright (C) 2020-2022 Alexandros Theodotou\n\nEveryone is permitted to copy and distribute\nverbatim copies of this document, but changing it is\nnot allowed."
}