{
  "key": "zsh",
  "short_name": "zsh License",
  "name": "Z Shell License",
  "category": "Permissive",
  "owner": "Zsh Development Group",
  "homepage_url": "https://sourceforge.net/p/zsh/code/ci/master/tree/LICENCE",
  "spdx_license_key": "LicenseRef-scancode-zsh",
  "minimum_coverage": 90,
  "ignorable_copyrights": [
    "copyright (c) 1992-2017 Paul Falstad, Richard Coleman, Zoltan Hidvegi, Andrew Main, Peter Stephenson, Sven Wischnowsky, and others"
  ],
  "ignorable_holders": [
    "Paul Falstad, Richard Coleman, Zoltan Hidvegi, Andrew Main, Peter Stephenson, Sven Wischnowsky, and others"
  ],
  "text": "Unless otherwise noted in the header of specific files, files in this\ndistribution have the licence shown below.\n\nHowever, note that certain shell functions are licensed under versions\nof the GNU General Public Licence.  Anyone distributing the shell as a\nbinary including those files needs to take account of this.  Search\nshell functions for \"Copyright\" for specific copyright information.\nNone of the core functions are affected by this, so those files may\nsimply be omitted.\n\n--\n\nThe Z Shell is copyright (c) 1992-2017 Paul Falstad, Richard Coleman,\nZoltán Hidvégi, Andrew Main, Peter Stephenson, Sven Wischnowsky, and\nothers.  All rights reserved.  Individual authors, whether or not\nspecifically named, retain copyright in all changes; in what follows, they\nare referred to as `the Zsh Development Group'.  This is for convenience\nonly and this body has no legal status.  The Z shell is distributed under\nthe following licence; any provisions made in individual files take\nprecedence.\n\nPermission is hereby granted, without written agreement and without\nlicence or royalty fees, to use, copy, modify, and distribute this\nsoftware and to distribute modified versions of this software for any\npurpose, provided that the above copyright notice and the following\ntwo paragraphs appear in all copies of this software.\n\nIn no event shall the Zsh Development Group be liable to any party for\ndirect, indirect, special, incidental, or consequential damages arising out\nof the use of this software and its documentation, even if the Zsh\nDevelopment Group have been advised of the possibility of such damage.\n\nThe Zsh Development Group specifically disclaim any warranties, including,\nbut not limited to, the implied warranties of merchantability and fitness\nfor a particular purpose.  The software provided hereunder is on an \"as is\"\nbasis, and the Zsh Development Group have no obligation to provide\nmaintenance, support, updates, enhancements, or modifications."
}